
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第一章：介绍 · 软件设计哲学</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="John Ousterhout">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-page-toc-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="ch2.html" />
    
    
    <link rel="prev" href="preface" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    首页
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="preface">
            
                <span>
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.4" data-path="ch1.html">
            
                <a href="ch1.html">
            
                    
                    第一章：介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="ch2.html">
            
                <a href="ch2.html">
            
                    
                    第二章：复杂性的本质
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="ch3.html">
            
                <a href="ch3.html">
            
                    
                    第三章：工作代码是不够的（战略与战术编程）
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="ch4.html">
            
                <a href="ch4.html">
            
                    
                    第四章：模块应该是深的
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="ch5.html">
            
                <a href="ch5.html">
            
                    
                    第五章：信息隐藏(和泄露)
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="ch6.html">
            
                <a href="ch6.html">
            
                    
                    第六章：通用模块更深入
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="ch7.html">
            
                <a href="ch7.html">
            
                    
                    第七章: 不同的层，不同的抽象
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="ch8.html">
            
                <a href="ch8.html">
            
                    
                    第八章: 降低复杂性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="ch9.html">
            
                <a href="ch9.html">
            
                    
                    第九章: 在一起更好还是分开更好？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="ch10.html">
            
                <a href="ch10.html">
            
                    
                    第十章: 定义不存在的错误
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="ch11.html">
            
                <a href="ch11.html">
            
                    
                    第十一章: 设计它两次
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="ch12.html">
            
                <a href="ch12.html">
            
                    
                    第十二章: 为什么写注释？四个理由
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="ch13.html">
            
                <a href="ch13.html">
            
                    
                    第十三章: 注释应该描述代码中不明显的内容
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="ch14.html">
            
                <a href="ch14.html">
            
                    
                    第十四章: 选择的名字
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="ch15.html">
            
                <a href="ch15.html">
            
                    
                    第十五章: 先写注释
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="ch16.html">
            
                <a href="ch16.html">
            
                    
                    第十六章: 修改现有的代码
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.20" data-path="ch17.html">
            
                <a href="ch17.html">
            
                    
                    第十七章: 一致性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.21" data-path="ch18.html">
            
                <a href="ch18.html">
            
                    
                    第十八章: 代码应该是显而易见的
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.22" data-path="ch19.html">
            
                <a href="ch19.html">
            
                    
                    第十九章: 软件发展趋势
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.23" data-path="ch20.html">
            
                <a href="ch20.html">
            
                    
                    第二十章: 设计性能
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.24" data-path="ch21.html">
            
                <a href="ch21.html">
            
                    
                    第二十一章: 结论
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.25" data-path="summary.html">
            
                <a href="summary.html">
            
                    
                    总结
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >第一章：介绍</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7B2C;&#x4E00;&#x7AE0;&#xFF1A;&#x4ECB;&#x7ECD;">&#x7B2C;&#x4E00;&#x7AE0;&#xFF1A;&#x4ECB;&#x7ECD;</h1>
<p>&#x7F16;&#x5199;&#x8BA1;&#x7B97;&#x673A;&#x8F6F;&#x4EF6;&#x662F;&#x4EBA;&#x7C7B;&#x5386;&#x53F2;&#x4E0A;&#x6700;&#x7EAF;&#x7CB9;&#x7684;&#x521B;&#x4F5C;&#x6D3B;&#x52A8;&#x4E4B;&#x4E00;&#x3002;&#x7A0B;&#x5E8F;&#x5458;&#x4E0D;&#x53D7;&#x8BF8;&#x5982;&#x7269;&#x7406;&#x5B9A;&#x5F8B;&#x7B49;&#x5B9E;&#x9645;&#x9650;&#x5236;&#x7684;&#x7EA6;&#x675F;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7528;&#x73B0;&#x5B9E;&#x4E16;&#x754C;&#x4E2D;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x5B58;&#x5728;&#x7684;&#x884C;&#x4E3A;&#x521B;&#x5EFA;&#x4EE4;&#x4EBA;&#x5174;&#x594B;&#x7684;&#x865A;&#x62DF;&#x4E16;&#x754C;&#x3002;&#x7F16;&#x7A0B;&#x4E0D;&#x9700;&#x8981;&#x5F88;&#x9AD8;&#x7684;&#x8EAB;&#x4F53;&#x6280;&#x80FD;&#x6216;&#x534F;&#x8C03;&#x80FD;&#x529B;&#xFF0C;&#x4F8B;&#x5982;&#x82AD;&#x857E;&#x6216;&#x7BEE;&#x7403;&#x3002;&#x6240;&#x6709;&#x7F16;&#x7A0B;&#x90FD;&#x9700;&#x8981;&#x5177;&#x6709;&#x521B;&#x9020;&#x529B;&#x7684;&#x5934;&#x8111;&#x548C;&#x7EC4;&#x7EC7;&#x601D;&#x60F3;&#x7684;&#x80FD;&#x529B;&#x3002;&#x5982;&#x679C;&#x60A8;&#x53EF;&#x4EE5;&#x53EF;&#x89C6;&#x5316;&#x7CFB;&#x7EDF;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x7A0B;
&#x5E8F;&#x4E2D;&#x5B9E;&#x73B0;&#x5B83;&#x3002;</p>
<p>&#x8FD9;&#x610F;&#x5473;&#x7740;&#x7F16;&#x5199;&#x8F6F;&#x4EF6;&#x7684;&#x6700;&#x5927;&#x9650;&#x5236;&#x662F;&#x6211;&#x4EEC;&#x4E86;&#x89E3;&#x6240;&#x521B;&#x5EFA;&#x7CFB;&#x7EDF;&#x7684;&#x80FD;&#x529B;&#x3002;&#x968F;&#x7740;&#x7A0B;&#x5E8F;&#x7684;&#x53D1;&#x5C55;&#x548C;&#x83B7;&#x5F97;&#x66F4;&#x591A;&#x529F;&#x80FD;&#xFF0C;&#x5B83;&#x53D8;&#x5F97;&#x590D;&#x6742;&#xFF0C;&#x5176;&#x7EC4;&#x4EF6;&#x4E4B;&#x95F4;&#x5177;&#x6709;&#x5FAE;&#x5999;&#x7684;&#x4F9D;&#x8D56;&#x6027;&#x3002;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x6D41;&#x901D;&#xFF0C;&#x590D;&#x6742;&#x6027;&#x4E0D;&#x65AD;&#x7D2F;&#x79EF;&#xFF0C;&#x7A0B;&#x5E8F;&#x5458;&#x5728;&#x4FEE;&#x6539;&#x7CFB;&#x7EDF;&#x65F6;&#x5C06;&#x6240;&#x6709;&#x76F8;&#x5173;&#x56E0;&#x7D20;&#x7262;&#x8BB0;&#x5728;&#x5FC3;&#x4E2D;&#x53D8;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x96BE;&#x3002;&#x8FD9;&#x4F1A;&#x51CF;&#x6162;&#x5F00;&#x53D1;&#x901F;&#x5EA6;&#x5E76;&#x5BFC;&#x81F4;&#x9519;&#x8BEF;&#xFF0C;&#x4ECE;&#x800C;&#x8FDB;&#x4E00;&#x6B65;&#x5EF6;&#x7F13;&#x5F00;&#x53D1;&#x901F;&#x5EA6;&#x5E76;&#x589E;&#x52A0;&#x6210;&#x672C;&#x3002;&#x5728;&#x4EFB;&#x4F55;&#x7A0B;&#x5E8F;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#x4E2D;&#xFF0C;&#x590D;&#x6742;&#x6027;&#x90FD;&#x4F1A;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#x5730;&#x589E;&#x52A0;&#x3002;&#x7A0B;&#x5E8F;&#x8D8A;&#x5927;&#xFF0C;&#x5DE5;&#x4F5C;&#x7684;&#x4EBA;&#x8D8A;&#x591A;&#xFF0C;&#x7BA1;&#x7406;&#x590D;&#x6742;&#x6027;&#x5C31;&#x8D8A;&#x56F0;&#x96BE;&#x3002;</p>
<p>&#x597D;&#x7684;&#x5F00;&#x53D1;&#x5DE5;&#x5177;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x5E94;&#x5BF9;&#x590D;&#x6742;&#x6027;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x8FC7;&#x53BB;&#x7684;&#x51E0;&#x5341;&#x5E74;&#x4E2D;&#x5DF2;&#x7ECF;&#x521B;&#x5EFA;&#x4E86;&#x8BB8;&#x591A;&#x51FA;&#x8272;&#x7684;&#x5DE5;&#x5177;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x4EC5;&#x51ED;&#x5DE5;&#x5177;&#x6211;&#x4EEC;&#x53EA;&#x80FD;&#x505A;&#x4E9B;&#x4E8B;&#x60C5;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x60F3;&#x7B80;&#x5316;&#x7F16;&#x5199;&#x8F6F;&#x4EF6;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x4ECE;&#x800C;&#x53EF;&#x4EE5;&#x66F4;&#x4FBF;&#x5B9C;&#x5730;&#x6784;&#x5EFA;&#x529F;&#x80FD;&#x66F4;&#x5F3A;&#x5927;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x5219;&#x5FC5;&#x987B;&#x627E;&#x5230;&#x7B80;&#x5316;&#x8F6F;&#x4EF6;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x5C3D;&#x7BA1;&#x6211;&#x4EEC;&#x5C3D;&#x4E86;&#x6700;&#x5927;&#x52AA;&#x529B;&#xFF0C;&#x4F46;&#x590D;&#x6742;&#x5EA6;&#x4ECD;&#x4F1A;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x63A8;&#x79FB;&#x800C;&#x589E;&#x52A0;&#xFF0C;&#x4F46;&#x662F;&#x66F4;&#x7B80;&#x5355;&#x7684;&#x8BBE;&#x8BA1;&#x4F7F;&#x6211;&#x4EEC;&#x80FD;&#x591F;&#x5728;&#x590D;&#x6742;&#x6027;&#x538B;&#x5012;&#x6027;&#x4F18;&#x52BF;&#x4E4B;&#x524D;&#x6784;&#x5EFA;&#x66F4;&#x5927;&#xFF0C;&#x529F;&#x80FD;&#x66F4;&#x5F3A;&#x5927;&#x7684;&#x7CFB;&#x7EDF;&#x3002;</p>
<p>&#x6709;&#x4E24;&#x79CD;&#x89E3;&#x51B3;&#x590D;&#x6742;&#x6027;&#x7684;&#x901A;&#x7528;&#x65B9;&#x6CD5;&#xFF0C;&#x8FD9;&#x4E24;&#x79CD;&#x65B9;&#x6CD5;&#x90FD;&#x5C06;&#x5728;&#x672C;&#x4E66;&#x4E2D;&#x8FDB;&#x884C;&#x8BA8;&#x8BBA;&#x3002;
<strong>&#x7B2C;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x901A;&#x8FC7;&#x4F7F;&#x4EE3;&#x7801;&#x66F4;&#x7B80;&#x5355;&#x548C;&#x66F4;&#x660E;&#x663E;&#x6765;&#x6D88;&#x9664;&#x590D;&#x6742;&#x6027;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x6D88;&#x9664;&#x7279;&#x6B8A;&#x60C5;&#x51B5;&#x6216;&#x4EE5;&#x4E00;&#x81F4;&#x7684;&#x65B9;&#x5F0F;&#x4F7F;&#x7528;&#x6807;&#x8BC6;&#x7B26;&#x6765;&#x964D;&#x4F4E;&#x590D;&#x6742;&#x6027;&#x3002;</strong></p>
<p><strong>&#x89E3;&#x51B3;&#x590D;&#x6742;&#x6027;&#x7684;&#x7B2C;&#x4E8C;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x5C01;&#x88C5;&#x5B83;&#xFF0C;&#x4EE5;&#x4FBF;&#x7A0B;&#x5E8F;&#x5458;&#x53EF;&#x4EE5;&#x5728;&#x7CFB;&#x7EDF;&#x4E0A;&#x5DE5;&#x4F5C;&#x800C;&#x4E0D;&#x4F1A;&#x7ACB;&#x5373;&#x66B4;&#x9732;&#x5176;&#x6240;&#x6709;&#x590D;&#x6742;&#x6027;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x79F0;&#x4E3A;&#x6A21;&#x5757;&#x5316;&#x8BBE;&#x8BA1;&#x3002;&#x5728;&#x6A21;&#x5757;&#x5316;&#x8BBE;&#x8BA1;&#x4E2D;&#xFF0C;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x5206;&#x4E3A;&#x6A21;&#x5757;&#xFF0C;&#x4F8B;&#x5982;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x8BED;&#x8A00;&#x7684;&#x7C7B;&#x3002;&#x8FD9;&#x4E9B;&#x6A21;&#x5757;&#x88AB;&#x8BBE;&#x8BA1;&#x4E3A;&#x5F7C;&#x6B64;&#x76F8;&#x5BF9;&#x72EC;&#x7ACB;&#xFF0C;&#x4EE5;&#x4FBF;&#x7A0B;&#x5E8F;&#x5458;&#x53EF;&#x4EE5;&#x5728;&#x4E00;&#x4E2A;&#x6A21;&#x5757;&#x4E0A;&#x5DE5;&#x4F5C;&#x800C;&#x4E0D;&#x5FC5;&#x4E86;&#x89E3;&#x5176;&#x4ED6;&#x6A21;&#x5757;&#x7684;&#x7EC6;&#x8282;&#x3002;</strong></p>
<p>&#x7531;&#x4E8E;&#x8F6F;&#x4EF6;&#x5177;&#x6709;&#x5F88;&#x597D;&#x7684;&#x5EF6;&#x5C55;&#x6027;&#xFF0C;&#x56E0;&#x6B64;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x662F;&#x4E00;&#x4E2A;&#x8D2F;&#x7A7F;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x6574;&#x4E2A;&#x751F;&#x547D;&#x5468;&#x671F;&#x7684;&#x8FDE;&#x7EED;&#x8FC7;&#x7A0B;&#x3002;&#x8FD9;&#x4F7F;&#x5F97;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x4E0E;&#x8BF8;&#x5982;&#x5EFA;&#x7B51;&#x7269;&#xFF0C;&#x8239;&#x8236;&#x6216;&#x6865;&#x6881;&#x7684;&#x7269;&#x7406;&#x7CFB;&#x7EDF;&#x7684;&#x8BBE;&#x8BA1;&#x4E0D;&#x540C;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5E76;&#x975E;&#x603B;&#x662F;&#x4EE5;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x67E5;&#x770B;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x3002;&#x5728;&#x7F16;&#x7A0B;&#x7684;&#x5927;&#x90E8;&#x5206;&#x5386;&#x53F2;&#x4E2D;&#xFF0C;&#x8BBE;&#x8BA1;&#x90FD;&#x96C6;&#x4E2D;&#x5728;&#x9879;&#x76EE;&#x7684;&#x5F00;&#x59CB;&#xFF0C;&#x5C31;&#x50CF;&#x5176;&#x4ED6;&#x5DE5;&#x7A0B;&#x5B66;&#x79D1;&#x4E00;&#x6837;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x7684;&#x6781;&#x7AEF;&#x79F0;&#x4E3A;&#x7011;&#x5E03;&#x6A21;&#x578B;&#xFF0C;&#x8BE5;&#x6A21;&#x578B;&#x5C06;&#x9879;&#x76EE;&#x5212;&#x5206;&#x4E3A;&#x79BB;&#x6563;&#x7684;&#x9636;&#x6BB5;&#xFF0C;&#x4F8B;&#x5982;&#x9700;&#x6C42;&#x5B9A;&#x4E49;&#xFF0C;&#x8BBE;&#x8BA1;&#xFF0C;&#x7F16;&#x7801;&#xFF0C;&#x6D4B;&#x8BD5;&#x548C;&#x7EF4;&#x62A4;&#x3002;&#x5728;&#x7011;&#x5E03;&#x6A21;&#x578B;&#x4E2D;&#xFF0C;&#x6BCF;&#x4E2A;&#x9636;&#x6BB5;&#x90FD;&#x5728;&#x4E0B;&#x4E00;&#x9636;&#x6BB5;&#x5F00;&#x59CB;&#x4E4B;&#x524D;&#x5B8C;&#x6210;&#xFF1B;&#x5728;&#x8BB8;&#x591A;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6BCF;&#x4E2A;&#x9636;&#x6BB5;&#x90FD;&#x7531;&#x4E0D;&#x540C;&#x7684;&#x4EBA;&#x8D1F;&#x8D23;&#x3002;&#x5728;&#x8BBE;&#x8BA1;&#x9636;&#x6BB5;&#xFF0C;&#x7ACB;&#x5373;&#x8BBE;&#x8BA1;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x3002;</p>
<p>&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x7011;&#x5E03;&#x6A21;&#x578B;&#x5F88;&#x5C11;&#x9002;&#x7528;&#x4E8E;&#x8F6F;&#x4EF6;&#x3002;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x672C;&#x8D28;&#x4E0A;&#x6BD4;&#x7269;&#x7406;&#x7CFB;&#x7EDF;&#x590D;&#x6742;&#x3002;&#x5728;&#x6784;&#x5EFA;&#x4EFB;&#x4F55;&#x4E1C;&#x897F;&#x4E4B;&#x524D;&#xFF0C;&#x4E0D;&#x53EF;&#x80FD;&#x5145;&#x5206;&#x53EF;&#x89C6;&#x5316;&#x5927;&#x578B;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x4EE5;&#x4E86;&#x89E3;&#x5176;&#x6240;&#x6709;&#x542B;&#x4E49;&#x3002;&#x7ED3;&#x679C;&#xFF0C;&#x521D;&#x59CB;&#x8BBE;&#x8BA1;&#x5C06;&#x6709;&#x8BB8;&#x591A;&#x95EE;&#x9898;&#x3002;&#x5728;&#x5B9E;&#x65BD;&#x826F;&#x597D;&#x4E4B;&#x524D;&#xFF0C;&#x95EE;&#x9898;&#x4E0D;&#x4F1A;&#x53D8;&#x5F97;&#x660E;&#x663E;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x7011;&#x5E03;&#x6A21;&#x578B;&#x7684;&#x7ED3;&#x6784;&#x6B64;&#x65F6;&#x65E0;&#x6CD5;&#x9002;&#x5E94;&#x4E3B;&#x8981;&#x7684;&#x8BBE;&#x8BA1;&#x66F4;&#x6539;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x8BBE;&#x8BA1;&#x5E08;&#x53EF;&#x80FD;&#x5DF2;&#x8F6C;&#x79FB;&#x5230;&#x5176;&#x4ED6;&#x9879;&#x76EE;&#xFF09;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5C1D;&#x8BD5;&#x5728;&#x4E0D;&#x6539;&#x53D8;&#x6574;&#x4F53;&#x8BBE;&#x8BA1;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x3002;&#x8FD9;&#x5BFC;&#x81F4;&#x590D;&#x6742;&#x6027;&#x7684;&#x7206;&#x70B8;&#x5F0F;&#x589E;&#x957F;&#x3002;</p>
<p>&#x7531;&#x4E8E;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x5F53;&#x4ECA;&#x5927;&#x591A;&#x6570;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x9879;&#x76EE;&#x90FD;&#x4F7F;&#x7528;&#x8BF8;&#x5982;&#x654F;&#x6377;&#x5F00;&#x53D1;&#x4E4B;&#x7C7B;&#x7684;&#x589E;&#x91CF;&#x65B9;&#x6CD5;&#xFF0C;&#x5176;&#x4E2D;&#x521D;&#x59CB;&#x8BBE;&#x8BA1;&#x7740;&#x91CD;&#x4E8E;&#x6574;&#x4F53;&#x529F;&#x80FD;&#x7684;&#x4E00;&#x5C0F;&#x90E8;&#x5206;&#x3002;&#x8BBE;&#x8BA1;&#xFF0C;&#x5B9E;&#x65BD;&#x548C;&#x8BC4;&#x4F30;&#x6B64;&#x5B50;&#x96C6;&#x3002;&#x53D1;&#x73B0;&#x548C;&#x7EA0;&#x6B63;&#x539F;&#x59CB;&#x8BBE;&#x8BA1;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x7136;&#x540E;&#x8BBE;&#x8BA1;&#xFF0C;&#x5B9E;&#x65BD;&#x548C;&#x8BC4;&#x4F30;&#x66F4;&#x591A;&#x529F;&#x80FD;&#x3002;&#x6BCF;&#x6B21;&#x8FED;&#x4EE3;&#x90FD;&#x4F1A;&#x66B4;&#x9732;&#x73B0;&#x6709;&#x8BBE;&#x8BA1;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x5728;&#x8BBE;&#x8BA1;&#x4E0B;&#x4E00;&#x7EC4;&#x529F;&#x80FD;&#x4E4B;&#x524D;&#x5C31;&#x5DF2;&#x5F97;&#x5230;&#x89E3;&#x51B3;&#x3002;&#x901A;&#x8FC7;&#x4EE5;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x6269;&#x5C55;&#x8BBE;&#x8BA1;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x7CFB;&#x7EDF;&#x4ECD;&#x7136;&#x5F88;&#x5C0F;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x89E3;&#x51B3;&#x521D;&#x59CB;&#x8BBE;&#x8BA1;&#x7684;&#x95EE;&#x9898;&#x3002;&#x8F83;&#x65B0;&#x7684;&#x529F;&#x80FD;&#x53D7;&#x76CA;&#x4E8E;&#x8F83;&#x65E9;&#x529F;&#x80FD;&#x7684;&#x5B9E;&#x65BD;&#x8FC7;&#x7A0B;&#x4E2D;&#x83B7;&#x5F97;&#x7684;&#x7ECF;&#x9A8C;&#xFF0C;&#x56E0;&#x6B64;&#x95EE;&#x9898;&#x8F83;&#x5C11;&#x3002;</p>
<p>&#x589E;&#x91CF;&#x65B9;&#x6CD5;&#x9002;&#x7528;&#x4E8E;&#x8F6F;&#x4EF6;&#xFF0C;&#x56E0;&#x4E3A;&#x8F6F;&#x4EF6;&#x5177;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x5EF6;&#x5C55;&#x6027;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x5B9E;&#x65BD;&#x8FC7;&#x7A0B;&#x4E2D;&#x8FDB;&#x884C;&#x91CD;&#x5927;&#x7684;&#x8BBE;&#x8BA1;&#x66F4;&#x6539;&#x3002;&#x76F8;&#x6BD4;&#x4E4B;&#x4E0B;&#xFF0C;&#x5BF9;&#x7269;&#x7406;&#x7CFB;&#x7EDF;&#x800C;&#x8A00;&#xFF0C;&#x4E3B;&#x8981;&#x7684;&#x8BBE;&#x8BA1;&#x66F4;&#x6539;&#x66F4;&#x5177;&#x6311;&#x6218;&#x6027;&#xFF1A;&#x4F8B;&#x5982;&#xFF0C;&#x5728;&#x5EFA;&#x7B51;&#x8FC7;&#x7A0B;&#x4E2D;&#x66F4;&#x6539;&#x652F;&#x6491;&#x6865;&#x6881;&#x7684;&#x5854;&#x67B6;&#x6570;&#x91CF;&#x4E0D;&#x5207;&#x5B9E;&#x9645;&#x3002;</p>
<p>&#x589E;&#x91CF;&#x5F00;&#x53D1;&#x610F;&#x5473;&#x7740;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x5B8C;&#x6210;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x3002;&#x8BBE;&#x8BA1;&#x5728;&#x7CFB;&#x7EDF;&#x7684;&#x6574;&#x4E2A;&#x751F;&#x547D;&#x5468;&#x671F;&#x4E2D;&#x4E0D;&#x65AD;&#x53D1;&#x751F;&#xFF1A;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5E94;&#x59CB;&#x7EC8;&#x5728;&#x601D;&#x8003;&#x8BBE;&#x8BA1;&#x95EE;&#x9898;&#x3002;&#x589E;&#x91CF;&#x5F00;&#x53D1;&#x8FD8;&#x610F;&#x5473;&#x7740;&#x4E0D;&#x65AD;&#x7684;&#x91CD;&#x65B0;&#x8BBE;&#x8BA1;&#x3002;&#x7CFB;&#x7EDF;&#x6216;&#x7EC4;&#x4EF6;&#x7684;&#x521D;&#x59CB;&#x8BBE;&#x8BA1;&#x51E0;&#x4E4E;&#x4ECE;&#x6765;&#x90FD;&#x4E0D;&#x662F;&#x6700;&#x597D;&#x7684;&#x3002;&#x7ECF;&#x9A8C;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#x5730;&#x663E;&#x793A;&#x51FA;&#x66F4;&#x597D;&#x7684;&#x505A;&#x4E8B;&#x65B9;&#x5F0F;&#x3002;&#x4F5C;&#x4E3A;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#xFF0C;&#x60A8;&#x5E94;&#x8BE5;&#x59CB;&#x7EC8;&#x5728;&#x5BFB;&#x627E;&#x673A;&#x4F1A;&#x6765;&#x6539;&#x8FDB;&#x6B63;&#x5728;&#x5F00;&#x53D1;&#x7684;&#x7CFB;&#x7EDF;&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x5E76;&#x4E14;&#x5E94;&#x8BE5;&#x8BA1;&#x5212;&#x5C06;&#x90E8;&#x5206;&#x65F6;&#x95F4;&#x82B1;&#x8D39;&#x5728;&#x8BBE;&#x8BA1;&#x6539;&#x8FDB;&#x4E0A;&#x3002;</p>
<p>&#x5982;&#x679C;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5E94;&#x59CB;&#x7EC8;&#x8003;&#x8651;&#x8BBE;&#x8BA1;&#x95EE;&#x9898;&#xFF0C;&#x800C;&#x964D;&#x4F4E;&#x590D;&#x6742;&#x6027;&#x662F;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x4E2D;&#x6700;&#x91CD;&#x8981;&#x7684;&#x8981;&#x7D20;&#xFF0C;&#x5219;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5E94;&#x59CB;&#x7EC8;&#x8003;&#x8651;&#x590D;&#x6742;&#x6027;&#x3002;<strong>&#x8FD9;&#x672C;&#x4E66;&#x662F;&#x5173;&#x4E8E;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x590D;&#x6742;&#x6027;&#x6765;&#x6307;&#x5BFC;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x7684;&#x6574;&#x4E2A;&#x751F;&#x547D;&#x5468;&#x671F;&#x3002;</strong></p>
<p>&#x8FD9;&#x672C;&#x4E66;&#x6709;&#x4E24;&#x4E2A;&#x603B;&#x4F53;&#x76EE;&#x6807;&#x3002;<strong>&#x9996;&#x5148;&#x662F;&#x63CF;&#x8FF0;&#x8F6F;&#x4EF6;&#x590D;&#x6742;&#x6027;&#x7684;&#x6027;&#x8D28;&#xFF1A;&#x201C;&#x590D;&#x6742;&#x6027;&#x201D;&#x662F;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x91CD;&#x8981;&#xFF0C;&#x4EE5;&#x53CA;&#x5F53;&#x7A0B;&#x5E8F;&#x5177;&#x6709;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x590D;&#x6742;&#x6027;&#x65F6;&#x5982;&#x4F55;&#x8BC6;&#x522B;&#xFF1F;&#x672C;&#x4E66;&#x7684;&#x7B2C;&#x4E8C;&#x4E2A;&#x4E5F;&#x662F;&#x66F4;&#x5177;&#x6311;&#x6218;&#x6027;&#x7684;&#x76EE;&#x6807;&#x662F;&#x4ECB;&#x7ECD;&#x53EF;&#x5728;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#x4F7F;&#x7528;&#x7684;&#x6280;&#x672F;&#xFF0C;&#x4EE5;&#x6700;&#x5927;&#x7A0B;&#x5EA6;&#x5730;&#x51CF;&#x5C11;&#x590D;&#x6742;&#x6027;&#x3002;</strong>&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x6CA1;&#x6709;&#x7B80;&#x5355;&#x7684;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x4FDD;&#x8BC1;&#x51FA;&#x8272;&#x7684;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x3002;&#x53D6;&#x800C;&#x4EE3;&#x4E4B;&#x7684;&#x662F;&#xFF0C;&#x6211;&#x5C06;&#x63D0;&#x51FA;&#x4E00;&#x4E9B;&#x4E0E;&#x54F2;&#x5B66;&#x7D27;&#x5BC6;&#x76F8;&#x5173;&#x7684;&#x9AD8;&#x7EA7;&#x6982;&#x5FF5;&#xFF0C;&#x4F8B;&#x5982;&#x201C;&#x7C7B;&#x5E94;&#x8BE5;&#x5F88;&#x6DF1;&#x201D;&#x6216;&#x201C;&#x5B9A;&#x4E49;&#x4E0D;&#x5B58;&#x5728;&#x7684;&#x9519;&#x8BEF;&#x201D;&#x3002;&#x8FD9;&#x4E9B;&#x6982;&#x5FF5;&#x53EF;&#x80FD;&#x4E0D;&#x4F1A;&#x7ACB;&#x5373;&#x786E;&#x5B9A;&#x6700;&#x4F73;&#x8BBE;&#x8BA1;&#xFF0C;&#x4F46;&#x60A8;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5B83;&#x4EEC;&#x6765;&#x6BD4;&#x8F83;&#x8BBE;&#x8BA1;&#x5907;&#x9009;&#x65B9;&#x6848;&#x5E76;&#x6307;&#x5BFC;&#x60A8;&#x63A2;&#x7D22;&#x8BBE;&#x8BA1;&#x7A7A;&#x95F4;&#x3002;</p>
<h2 id="11-&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x8FD9;&#x672C;&#x4E66;">1.1 &#x5982;&#x4F55;&#x4F7F;&#x7528;&#x8FD9;&#x672C;&#x4E66;</h2>
<p>&#x8FD9;&#x91CC;&#x63CF;&#x8FF0;&#x7684;&#x8BB8;&#x591A;&#x8BBE;&#x8BA1;&#x539F;&#x5219;&#x6709;&#x4E9B;&#x62BD;&#x8C61;&#xFF0C;&#x56E0;&#x6B64;&#x5982;&#x679C;&#x4E0D;&#x770B;&#x5B9E;&#x9645;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x53EF;&#x80FD;&#x5F88;&#x96BE;&#x7406;&#x89E3;&#x5B83;&#x4EEC;&#x3002;&#x627E;&#x5230;&#x8DB3;&#x591F;&#x5C0F;&#x7684;&#x793A;&#x4F8B;&#x4EE5;&#x5305;&#x542B;&#x5728;&#x4E66;&#x4E2D;&#xFF0C;&#x4F46;&#x662F;&#x53C8;&#x8DB3;&#x591F;&#x5927;&#x4EE5;&#x8BF4;&#x660E;&#x771F;&#x5B9E;&#x7CFB;&#x7EDF;&#x7684;&#x95EE;&#x9898;&#x662F;&#x4E00;&#x4E2A;&#x6311;&#x6218;&#xFF08;&#x5982;&#x679C;&#x9047;&#x5230;&#x597D;&#x7684;&#x793A;&#x4F8B;&#xFF0C;&#x8BF7;&#x53D1;&#x7ED9;&#x6211;&#xFF09;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x8FD9;&#x672C;&#x4E66;&#x53EF;&#x80FD;&#x4E0D;&#x8DB3;&#x4EE5;&#x8BA9;&#x60A8;&#x5B66;&#x4E60;&#x5982;&#x4F55;&#x5E94;&#x7528;&#x8FD9;&#x4E9B;&#x539F;&#x7406;&#x3002;</p>
<p>&#x4F7F;&#x7528;&#x672C;&#x4E66;&#x7684;&#x6700;&#x4F73;&#x65B9;&#x6CD5;&#x662F;&#x4E0E;&#x4EE3;&#x7801;&#x5BA1;&#x67E5;&#x7ED3;&#x5408;&#x4F7F;&#x7528;&#x3002;&#x9605;&#x8BFB;&#x5176;&#x4ED6;&#x4EBA;&#x7684;&#x4EE3;&#x7801;&#x65F6;&#xFF0C;&#x8BF7;&#x8003;&#x8651;&#x5B83;&#x662F;&#x5426;&#x7B26;&#x5408;&#x6B64;&#x5904;&#x8BA8;&#x8BBA;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x4EE5;&#x53CA;&#x5B83;&#x4E0E;&#x4EE3;&#x7801;&#x7684;&#x590D;&#x6742;&#x6027;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x3002;&#x5728;&#x522B;&#x4EBA;&#x7684;&#x4EE3;&#x7801;&#x4E2D;&#x6BD4;&#x5728;&#x60A8;&#x7684;&#x4EE3;&#x7801;&#x4E2D;&#x66F4;&#x5BB9;&#x6613;&#x770B;&#x5230;&#x8BBE;&#x8BA1;&#x95EE;&#x9898;&#x3002;&#x60A8;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x6B64;&#x5904;&#x63CF;&#x8FF0;&#x7684;&#x7EA2;&#x8272;&#x6807;&#x8BB0;&#x6765;&#x53D1;&#x73B0;&#x95EE;&#x9898;&#x5E76;&#x63D0;&#x51FA;&#x6539;&#x8FDB;&#x5EFA;&#x8BAE;&#x3002;&#x67E5;&#x770B;&#x4EE3;&#x7801;&#x8FD8;&#x5C06;&#x4F7F;&#x60A8;&#x63A5;&#x89E6;&#x5230;&#x65B0;&#x7684;&#x8BBE;&#x8BA1;&#x65B9;&#x6CD5;&#x548C;&#x7F16;&#x7A0B;&#x6280;&#x672F;&#x3002;</p>
<p>&#x6539;&#x5584;&#x8BBE;&#x8BA1;&#x6280;&#x80FD;&#x7684;&#x6700;&#x597D;&#x65B9;&#x6CD5;&#x4E4B;&#x4E00;&#x5C31;&#x662F;&#x5B66;&#x4F1A;&#x8BC6;&#x522B;&#x5371;&#x9669;&#x4FE1;&#x53F7;&#xFF1A;&#x4FE1;&#x53F7;&#x8868;&#x660E;&#x4E00;&#x6BB5;&#x4EE3;&#x7801;&#x53EF;&#x80FD;&#x6BD4;&#x9700;&#x8981;&#x7684;&#x590D;&#x6742;&#x3002;&#x5728;&#x672C;&#x4E66;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x5C06;&#x6307;&#x51FA;&#x4E00;&#x4E9B;&#x5371;&#x9669;&#x4FE1;&#x53F7;&#xFF0C;&#x8FD9;&#x4E9B;&#x5371;&#x9669;&#x4FE1;&#x53F7;&#x6307;&#x793A;&#x4E0E;&#x6BCF;&#x4E2A;&#x4E3B;&#x8981;&#x8BBE;&#x8BA1;&#x95EE;&#x9898;&#x6709;&#x5173;&#x7684;&#x95EE;&#x9898;&#xFF1B;&#x6700;&#x91CD;&#x8981;&#x7684;&#x5185;&#x5BB9;&#x603B;&#x7ED3;&#x5728;&#x4E66;&#x7684;&#x540E;&#x9762;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x5728;&#x7F16;&#x7801;&#x65F6;&#x4F7F;&#x7528;&#x5B83;&#x4EEC;&#xFF1A;&#x5F53;&#x770B;&#x5230;&#x7EA2;&#x8272;&#x6807;&#x8BB0;&#x65F6;&#xFF0C;&#x505C;&#x4E0B;&#x6765;&#x5BFB;&#x627E;&#x53EF;&#x6D88;&#x9664;&#x95EE;&#x9898;&#x7684;&#x66FF;&#x4EE3;&#x8BBE;&#x8BA1;&#x3002;&#x5F53;&#x60A8;&#x7B2C;&#x4E00;&#x6B21;&#x5C1D;&#x8BD5;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x65F6;&#xFF0C;&#x60A8;&#x53EF;&#x80FD;&#x5FC5;&#x987B;&#x5C1D;&#x8BD5;&#x51E0;&#x79CD;&#x8BBE;&#x8BA1;&#x66FF;&#x4EE3;&#x65B9;&#x6848;&#xFF0C;&#x7136;&#x540E;&#x624D;&#x80FD;&#x627E;&#x5230;&#x6D88;&#x9664;&#x5371;&#x9669;&#x4FE1;&#x53F7;&#x7684;&#x65B9;&#x6848;&#x3002;&#x4E0D;&#x8981;&#x8F7B;&#x6613;&#x653E;&#x5F03;&#xFF1A;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x4E4B;&#x524D;&#x5C1D;&#x8BD5;&#x7684;&#x66FF;&#x4EE3;&#x65B9;&#x6CD5;&#x8D8A;&#x591A;&#xFF0C;&#x60A8;&#x5C31;&#x4F1A;&#x5B66;&#x5230;&#x66F4;&#x591A;&#x3002;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x6D41;&#x901D;&#xFF0C;&#x60A8;&#x4F1A;&#x53D1;&#x73B0;&#x4EE3;&#x7801;&#x4E2D;&#x7684;&#x5371;&#x9669;&#x4FE1;&#x53F7;&#x8D8A;&#x6765;&#x8D8A;&#x5C11;&#xFF0C;&#x5E76;&#x4E14;&#x60A8;&#x7684;&#x8BBE;&#x8BA1;&#x8D8A;&#x6765;&#x8D8A;&#x6E05;&#x6670;&#x3002;</p>
<p>&#x5728;&#x5E94;&#x7528;&#x672C;&#x4E66;&#x4E2D;&#x7684;&#x601D;&#x60F3;&#x65F6;&#xFF0C;&#x52A1;&#x5FC5;&#x8981;&#x8282;&#x5236;&#x548C;&#x8C28;&#x614E;&#x3002;&#x6BCF;&#x6761;&#x89C4;&#x5219;&#x90FD;&#x6709;&#x4F8B;&#x5916;&#xFF0C;&#x6BCF;&#x6761;&#x539F;&#x5219;&#x90FD;&#x6709;&#x5176;&#x5C40;&#x9650;&#x6027;&#x3002;&#x5982;&#x679C;&#x60A8;&#x5C06;&#x4EFB;&#x4F55;&#x8BBE;&#x8BA1;&#x521B;&#x610F;&#x90FD;&#x53D1;&#x6325;&#x5230;&#x6781;&#x81F4;&#xFF0C;&#x90A3;&#x4E48;&#x60A8;&#x53EF;&#x80FD;&#x4F1A;&#x9677;&#x5165;&#x56F0;&#x5883;&#x3002;&#x7CBE;&#x7F8E;&#x7684;&#x8BBE;&#x8BA1;&#x53CD;&#x6620;&#x4E86;&#x76F8;&#x4E92;&#x7ADE;&#x4E89;&#x7684;&#x601D;&#x60F3;&#x548C;&#x65B9;&#x6CD5;&#x4E4B;&#x95F4;&#x7684;&#x5E73;&#x8861;&#x3002;&#x6709;&#x51E0;&#x7AE0;&#x7684;&#x6807;&#x9898;&#x4E3A;&#x201C;&#x592A;&#x8FC7;&#x5206;&#x201D;&#xFF0C;&#x5B83;&#x4EEC;&#x63CF;&#x8FF0;&#x4E86;&#x5982;&#x4F55;&#x5728;&#x505A;&#x5F97;&#x8FC7;&#x5927;&#x7684;&#x4E8B;&#x60C5;&#x4E0A;&#x8BC6;&#x522B;&#x81EA;&#x5DF1;&#x3002;</p>
<p>&#x672C;&#x4E66;&#x4E2D;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x793A;&#x4F8B;&#x90FD;&#x662F;&#x4F7F;&#x7528; Java &#x6216; C ++&#x7F16;&#x5199;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x5927;&#x90E8;&#x5206;&#x8BA8;&#x8BBA;&#x90FD;&#x662F;&#x9488;&#x5BF9;&#x4EE5;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x8BED;&#x8A00;&#x8BBE;&#x8BA1;&#x7C7B;&#x7684;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x8FD9;&#x4E9B;&#x60F3;&#x6CD5;&#x4E5F;&#x9002;&#x7528;&#x4E8E;&#x5176;&#x4ED6;&#x9886;&#x57DF;&#x3002;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x4E0E;&#x65B9;&#x6CD5;&#x6709;&#x5173;&#x7684;&#x601D;&#x60F3;&#x4E5F;&#x53EF;&#x4EE5;&#x5E94;&#x7528;&#x4E8E;&#x6CA1;&#x6709;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x529F;&#x80FD;&#x7684;&#x8BED;&#x8A00;&#x4E2D;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x4F8B;&#x5982; C&#x3002;&#x8BBE;&#x8BA1;&#x601D;&#x60F3;&#x8FD8;&#x9002;&#x7528;&#x4E8E;&#x9664;&#x7C7B;&#x4E4B;&#x5916;&#x7684;&#x6A21;&#x5757;&#xFF0C;&#x4F8B;&#x5982;&#x5B50;&#x7CFB;&#x7EDF;&#x6216;&#x7F51;&#x7EDC;&#x670D;&#x52A1;&#x3002;</p>
<p>&#x5728;&#x8FD9;&#x79CD;&#x80CC;&#x666F;&#x4E0B;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x8BE6;&#x7EC6;&#x8BA8;&#x8BBA;&#x5BFC;&#x81F4;&#x590D;&#x6742;&#x6027;&#x7684;&#x539F;&#x56E0;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x7B80;&#x5316;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="preface" class="navigation navigation-prev " aria-label="Previous page: 前言">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="ch2.html" class="navigation navigation-next " aria-label="Next page: 第二章：复杂性的本质">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第一章：介绍","level":"1.4","depth":1,"next":{"title":"第二章：复杂性的本质","level":"1.5","depth":1,"path":"docs/ch2.md","ref":"./docs/ch2.md","articles":[]},"previous":{"title":"前言","level":"1.3","depth":1,"path":"docs/preface","ref":"./docs/preface","articles":[]},"dir":"ltr"},"config":{"plugins":["back-to-top-button","expandable-chapters-small","page-toc-button","livereload"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"livereload":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"page-toc-button":{},"back-to-top-button":{},"expandable-chapters-small":{},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"John Ousterhout","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"软件设计哲学","language":"zh-hans","gitbook":"*","description":"书中讨论了软件设计的主题：如何将复杂的软件系统分解成可以相对独立实现的模块(如类和方法)"},"file":{"path":"docs/ch1.md","mtime":"2020-08-06T16:26:19.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-02-06T04:55:41.669Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-page-toc-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

