
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第十章: 定义不存在的错误 · 软件设计哲学</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="John Ousterhout">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-page-toc-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="ch11.html" />
    
    
    <link rel="prev" href="ch9.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    首页
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="preface">
            
                <span>
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="ch1.html">
            
                <a href="ch1.html">
            
                    
                    第一章：介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="ch2.html">
            
                <a href="ch2.html">
            
                    
                    第二章：复杂性的本质
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="ch3.html">
            
                <a href="ch3.html">
            
                    
                    第三章：工作代码是不够的（战略与战术编程）
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="ch4.html">
            
                <a href="ch4.html">
            
                    
                    第四章：模块应该是深的
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="ch5.html">
            
                <a href="ch5.html">
            
                    
                    第五章：信息隐藏(和泄露)
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="ch6.html">
            
                <a href="ch6.html">
            
                    
                    第六章：通用模块更深入
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="ch7.html">
            
                <a href="ch7.html">
            
                    
                    第七章: 不同的层，不同的抽象
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="ch8.html">
            
                <a href="ch8.html">
            
                    
                    第八章: 降低复杂性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="ch9.html">
            
                <a href="ch9.html">
            
                    
                    第九章: 在一起更好还是分开更好？
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.13" data-path="ch10.html">
            
                <a href="ch10.html">
            
                    
                    第十章: 定义不存在的错误
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="ch11.html">
            
                <a href="ch11.html">
            
                    
                    第十一章: 设计它两次
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="ch12.html">
            
                <a href="ch12.html">
            
                    
                    第十二章: 为什么写注释？四个理由
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="ch13.html">
            
                <a href="ch13.html">
            
                    
                    第十三章: 注释应该描述代码中不明显的内容
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="ch14.html">
            
                <a href="ch14.html">
            
                    
                    第十四章: 选择的名字
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="ch15.html">
            
                <a href="ch15.html">
            
                    
                    第十五章: 先写注释
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="ch16.html">
            
                <a href="ch16.html">
            
                    
                    第十六章: 修改现有的代码
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.20" data-path="ch17.html">
            
                <a href="ch17.html">
            
                    
                    第十七章: 一致性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.21" data-path="ch18.html">
            
                <a href="ch18.html">
            
                    
                    第十八章: 代码应该是显而易见的
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.22" data-path="ch19.html">
            
                <a href="ch19.html">
            
                    
                    第十九章: 软件发展趋势
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.23" data-path="ch20.html">
            
                <a href="ch20.html">
            
                    
                    第二十章: 设计性能
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.24" data-path="ch21.html">
            
                <a href="ch21.html">
            
                    
                    第二十一章: 结论
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.25" data-path="summary.html">
            
                <a href="summary.html">
            
                    
                    总结
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >第十章: 定义不存在的错误</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7B2C;-10-&#x7AE0;-&#x5B9A;&#x4E49;&#x4E0D;&#x5B58;&#x5728;&#x7684;&#x9519;&#x8BEF;">&#x7B2C; 10 &#x7AE0; &#x5B9A;&#x4E49;&#x4E0D;&#x5B58;&#x5728;&#x7684;&#x9519;&#x8BEF;</h1>
<blockquote>
<p>Chapter 10 Define Errors Out Of Existence</p>
</blockquote>
<p>Exception handling is one of the worst sources of complexity in software systems. Code that deals with special conditions is inherently harder to write than code that deals with normal cases, and developers often define exceptions without considering how they will be handled. This chapter discusses why exceptions contribute disproportionately to complexity, then it shows how to simplify exception handling. The key overall lesson from this chapter is to reduce the number of places where exceptions must be handled; in many cases the semantics of operations can be modified so that the normal behavior handles all situations and there is no exceptional condition to report (hence the title of this chapter).</p>
<blockquote>
<p>&#x5F02;&#x5E38;&#x5904;&#x7406;&#x662F;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E2D;&#x6700;&#x7CDF;&#x7CD5;&#x7684;&#x590D;&#x6742;&#x6027;&#x6765;&#x6E90;&#x4E4B;&#x4E00;&#x3002;&#x5904;&#x7406;&#x7279;&#x6B8A;&#x60C5;&#x51B5;&#x7684;&#x4EE3;&#x7801;&#x5728;&#x672C;&#x8D28;&#x4E0A;&#x6BD4;&#x5904;&#x7406;&#x6B63;&#x5E38;&#x60C5;&#x51B5;&#x7684;&#x4EE3;&#x7801;&#x66F4;&#x96BE;&#x7F16;&#x5199;&#xFF0C;&#x5E76;&#x4E14;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x7ECF;&#x5E38;&#x5728;&#x5B9A;&#x4E49;&#x5F02;&#x5E38;&#x65F6;&#x4E0D;&#x8003;&#x8651;&#x5F02;&#x5E38;&#x7684;&#x5904;&#x7406;&#x65B9;&#x5F0F;&#x3002;&#x672C;&#x7AE0;&#x8BA8;&#x8BBA;&#x4E86;&#x4E3A;&#x4EC0;&#x4E48;&#x5F02;&#x5E38;&#x5BF9;&#x590D;&#x6742;&#x6027;&#x7684;&#x8D21;&#x732E;&#x4E0D;&#x6210;&#x6BD4;&#x4F8B;&#xFF0C;&#x7136;&#x540E;&#x8BF4;&#x660E;&#x4E86;&#x5982;&#x4F55;&#x7B80;&#x5316;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x3002;&#x672C;&#x7AE0;&#x603B;&#x7684;&#x4E3B;&#x8981;&#x6559;&#x8BAD;&#x662F;&#x51CF;&#x5C11;&#x5FC5;&#x987B;&#x5904;&#x7406;&#x5F02;&#x5E38;&#x7684;&#x5730;&#x65B9;&#x7684;&#x6570;&#x91CF;&#x3002;&#x5728;&#x8BB8;&#x591A;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x53EF;&#x4EE5;&#x4FEE;&#x6539;&#x64CD;&#x4F5C;&#x7684;&#x8BED;&#x4E49;&#xFF0C;&#x4EE5;&#x4FBF;&#x6B63;&#x5E38;&#x884C;&#x4E3A;&#x53EF;&#x4EE5;&#x5904;&#x7406;&#x6240;&#x6709;&#x60C5;&#x51B5;&#xFF0C;&#x5E76;&#x4E14;&#x6CA1;&#x6709;&#x8981;&#x62A5;&#x544A;&#x7684;&#x7279;&#x6B8A;&#x6761;&#x4EF6;&#xFF08;&#x56E0;&#x6B64;&#xFF0C;&#x672C;&#x7AE0;&#x6807;&#x9898;&#xFF09;&#x3002;</p>
</blockquote>
<h2 id="101-why-exceptions-add-complexity-&#x4E3A;&#x4EC0;&#x4E48;&#x5F02;&#x5E38;&#x4F1A;&#x589E;&#x52A0;&#x590D;&#x6742;&#x6027;">10.1 Why exceptions add complexity &#x4E3A;&#x4EC0;&#x4E48;&#x5F02;&#x5E38;&#x4F1A;&#x589E;&#x52A0;&#x590D;&#x6742;&#x6027;</h2>
<p>I use the term exception to refer to any uncommon condition that alters the normal flow of control in a program. Many programming languages include a formal exception mechanism that allows exceptions to be thrown by lower-level code and caught by enclosing code. However, exceptions can occur even without using a formal exception reporting mechanism, such as when a method returns a special value indicating that it didn&#x2019;t complete its normal behavior. All of these forms of exceptions contribute to complexity.</p>
<blockquote>
<p>&#x6211;&#x4F7F;&#x7528;&#x201C;&#x5F02;&#x5E38;&#x201D;&#x4E00;&#x8BCD;&#x6765;&#x6307;&#x4EE3;&#x4EFB;&#x4F55;&#x4F1A;&#x6539;&#x53D8;&#x7A0B;&#x5E8F;&#x4E2D;&#x6B63;&#x5E38;&#x63A7;&#x5236;&#x6D41;&#x7A0B;&#x7684;&#x4E0D;&#x5E38;&#x89C1;&#x6761;&#x4EF6;&#x3002;&#x8BB8;&#x591A;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x90FD;&#x5305;&#x542B;&#x4E00;&#x79CD;&#x6B63;&#x5F0F;&#x7684;&#x5F02;&#x5E38;&#x673A;&#x5236;&#xFF0C;&#x8BE5;&#x673A;&#x5236;&#x5141;&#x8BB8;&#x5F02;&#x5E38;&#x7531;&#x4F4E;&#x7EA7;&#x4EE3;&#x7801;&#x5F15;&#x53D1;&#x5E76;&#x7531;&#x5C01;&#x95ED;&#x4EE3;&#x7801;&#x6355;&#x83B7;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5373;&#x4F7F;&#x4E0D;&#x4F7F;&#x7528;&#x6B63;&#x5F0F;&#x7684;&#x5F02;&#x5E38;&#x62A5;&#x544A;&#x673A;&#x5236;&#xFF0C;&#x5F02;&#x5E38;&#x4E5F;&#x53EF;&#x80FD;&#x53D1;&#x751F;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x5F53;&#x67D0;&#x4E2A;&#x65B9;&#x6CD5;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x7279;&#x6B8A;&#x503C;&#x6307;&#x793A;&#x5176;&#x672A;&#x5B8C;&#x6210;&#x5176;&#x6B63;&#x5E38;&#x884C;&#x4E3A;&#x65F6;&#x3002;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x5F62;&#x5F0F;&#x7684;&#x5F02;&#x5E38;&#x90FD;&#x4F1A;&#x589E;&#x52A0;&#x590D;&#x6742;&#x6027;&#x3002;</p>
</blockquote>
<p>A particular piece of code may encounter exceptions in several different ways:</p>
<blockquote>
<p>&#x4E00;&#x6BB5;&#x7279;&#x5B9A;&#x7684;&#x4EE3;&#x7801;&#x53EF;&#x80FD;&#x4F1A;&#x4EE5;&#x51E0;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x65B9;&#x5F0F;&#x9047;&#x5230;&#x5F02;&#x5E38;&#xFF1A;</p>
</blockquote>
<ul>
<li>A caller may provide bad arguments or configuration information.</li>
<li>An invoked method may not be able to complete a requested operation. For example, an I/O operation may fail, or a required resource may not be available.</li>
<li>In a distributed system, network packets may be lost or delayed, servers may not respond in a timely fashion, or peers may communicate in unexpected ways.</li>
<li>The code may detect bugs, internal inconsistencies, or situations it is not prepared to handle.</li>
</ul>
<hr>
<blockquote>
<ul>
<li>&#x8C03;&#x7528;&#x65B9;&#x53EF;&#x80FD;&#x4F1A;&#x63D0;&#x4F9B;&#x9519;&#x8BEF;&#x7684;&#x53C2;&#x6570;&#x6216;&#x914D;&#x7F6E;&#x4FE1;&#x606F;&#x3002;</li>
<li>&#x8C03;&#x7528;&#x7684;&#x65B9;&#x6CD5;&#x53EF;&#x80FD;&#x65E0;&#x6CD5;&#x5B8C;&#x6210;&#x8BF7;&#x6C42;&#x7684;&#x64CD;&#x4F5C;&#x3002;&#x4F8B;&#x5982;&#xFF0C;I/O &#x64CD;&#x4F5C;&#x53EF;&#x80FD;&#x5931;&#x8D25;&#xFF0C;&#x6216;&#x8005;&#x6240;&#x9700;&#x7684;&#x8D44;&#x6E90;&#x53EF;&#x80FD;&#x4E0D;&#x53EF;&#x7528;&#x3002;</li>
<li>&#x5728;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x7F51;&#x7EDC;&#x6570;&#x636E;&#x5305;&#x53EF;&#x80FD;&#x4F1A;&#x4E22;&#x5931;&#x6216;&#x5EF6;&#x8FDF;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x53EF;&#x80FD;&#x65E0;&#x6CD5;&#x53CA;&#x65F6;&#x54CD;&#x5E94;&#xFF0C;&#x6216;&#x8005;&#x5BF9;&#x7B49;&#x65B9;&#x53EF;&#x80FD;&#x4F1A;&#x4EE5;&#x610F;&#x60F3;&#x4E0D;&#x5230;&#x7684;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x901A;&#x4FE1;&#x3002;</li>
<li>&#x8BE5;&#x4EE3;&#x7801;&#x53EF;&#x80FD;&#x4F1A;&#x68C0;&#x6D4B;&#x5230;&#x9519;&#x8BEF;&#xFF0C;&#x5185;&#x90E8;&#x4E0D;&#x4E00;&#x81F4;&#x6216;&#x672A;&#x51C6;&#x5907;&#x5904;&#x7406;&#x7684;&#x60C5;&#x51B5;&#x3002;</li>
</ul>
</blockquote>
<p>Large systems have to deal with many exceptional conditions, particularly if they are distributed or need to be fault-tolerant. Exception handling can account for a significant fraction of all the code in a system.</p>
<blockquote>
<p>&#x5927;&#x578B;&#x7CFB;&#x7EDF;&#x5FC5;&#x987B;&#x5E94;&#x5BF9;&#x8BB8;&#x591A;&#x7279;&#x6B8A;&#x60C5;&#x51B5;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5728;&#x5B83;&#x4EEC;&#x662F;&#x5206;&#x5E03;&#x5F0F;&#x7684;&#x6216;&#x9700;&#x8981;&#x5BB9;&#x9519;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x3002;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x53EF;&#x4EE5;&#x5360;&#x7CFB;&#x7EDF;&#x4E2D;&#x6240;&#x6709;&#x4EE3;&#x7801;&#x7684;&#x5F88;&#x5927;&#x4E00;&#x90E8;&#x5206;&#x3002;</p>
</blockquote>
<p>Exception handling code is inherently more difficult to write than normal-case code. An exception disrupts the normal flow of the code; it usually means that something didn&#x2019;t work as expected. When an exception occurs, the programmer can deal with it in two ways, each of which can be complicated. The first approach is to move forward and complete the work in progress in spite of the exception. For example, if a network packet is lost, it can be resent; if data is corrupted, perhaps it can be recovered from a redundant copy. The second approach is to abort the operation in progress and report the exception upwards. However, aborting can be complicated because the exception may have occurred at a point where system state is inconsistent (a data structure might have been partially initialized); the exception handling code must restore consistency, such as by unwinding any changes made before the exception occurred.</p>
<blockquote>
<p>&#x5F02;&#x5E38;&#x5904;&#x7406;&#x4EE3;&#x7801;&#x5929;&#x751F;&#x5C31;&#x6BD4;&#x6B63;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#x7684;&#x4EE3;&#x7801;&#x66F4;&#x96BE;&#x5199;&#x3002;&#x5F02;&#x5E38;&#x4E2D;&#x65AD;&#x4E86;&#x6B63;&#x5E38;&#x7684;&#x4EE3;&#x7801;&#x6D41;;&#x5B83;&#x901A;&#x5E38;&#x610F;&#x5473;&#x7740;&#x67D0;&#x4E8B;&#x6CA1;&#x6709;&#x50CF;&#x9884;&#x671F;&#x7684;&#x90A3;&#x6837;&#x5DE5;&#x4F5C;&#x3002;&#x5F53;&#x5F02;&#x5E38;&#x53D1;&#x751F;&#x65F6;&#xFF0C;&#x7A0B;&#x5E8F;&#x5458;&#x53EF;&#x4EE5;&#x7528;&#x4E24;&#x79CD;&#x65B9;&#x6CD5;&#x5904;&#x7406;&#x5B83;&#xFF0C;&#x6BCF;&#x79CD;&#x65B9;&#x6CD5;&#x90FD;&#x5F88;&#x590D;&#x6742;&#x3002;&#x7B2C;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x5411;&#x524D;&#x63A8;&#x8FDB;&#x5E76;&#x5B8C;&#x6210;&#x6B63;&#x5728;&#x8FDB;&#x884C;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x5C3D;&#x7BA1;&#x5B58;&#x5728;&#x4F8B;&#x5916;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x7F51;&#x7EDC;&#x6570;&#x636E;&#x5305;&#x4E22;&#x5931;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x88AB;&#x91CD;&#x53D1;;&#x5982;&#x679C;&#x6570;&#x636E;&#x635F;&#x574F;&#x4E86;&#xFF0C;&#x4E5F;&#x8BB8;&#x53EF;&#x4EE5;&#x4ECE;&#x5197;&#x4F59;&#x526F;&#x672C;&#x4E2D;&#x6062;&#x590D;&#x6570;&#x636E;&#x3002;&#x7B2C;&#x4E8C;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x4E2D;&#x6B62;&#x6B63;&#x5728;&#x8FDB;&#x884C;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x5411;&#x4E0A;&#x62A5;&#x544A;&#x5F02;&#x5E38;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x4E2D;&#x6B62;&#x53EF;&#x80FD;&#x5F88;&#x590D;&#x6742;&#xFF0C;&#x56E0;&#x4E3A;&#x5F02;&#x5E38;&#x53EF;&#x80FD;&#x53D1;&#x751F;&#x5728;&#x7CFB;&#x7EDF;&#x72B6;&#x6001;&#x4E0D;&#x4E00;&#x81F4;&#x7684;&#x5730;&#x65B9;(&#x6570;&#x636E;&#x7ED3;&#x6784;&#x53EF;&#x80FD;&#x5DF2;&#x7ECF;&#x90E8;&#x5206;&#x521D;&#x59CB;&#x5316;);&#x5F02;&#x5E38;&#x5904;&#x7406;&#x4EE3;&#x7801;&#x5FC5;&#x987B;&#x6062;&#x590D;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x4F8B;&#x5982;&#x901A;&#x8FC7;&#x64A4;&#x9500;&#x53D1;&#x751F;&#x5F02;&#x5E38;&#x4E4B;&#x524D;&#x6240;&#x505A;&#x7684;&#x4EFB;&#x4F55;&#x66F4;&#x6539;&#x3002;</p>
</blockquote>
<p>Furthermore, exception handling code creates opportunities for more exceptions. Consider the case of resending a lost network packet. Perhaps the packet wasn&#x2019;t actually lost, but was simply delayed. In this case, resending the packet will result in duplicate packets arriving at the peer; this introduces a new exceptional condition that the peer must handle. Or, consider the case of recovering lost data from a redundant copy: what if the redundant copy has also been lost? Secondary exceptions occurring during recovery are often more subtle and complex than the primary exceptions. If an exception is handled by aborting the operation in progress, then this must be reported to the caller as another exception. To prevent an unending cascade of exceptions, the developer must eventually find a way to handle exceptions without introducing more exceptions.</p>
<blockquote>
<p>&#x6B64;&#x5916;&#xFF0C;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x4EE3;&#x7801;&#x4E3A;&#x66F4;&#x591A;&#x5F02;&#x5E38;&#x521B;&#x9020;&#x4E86;&#x673A;&#x4F1A;&#x3002;&#x8003;&#x8651;&#x91CD;&#x65B0;&#x53D1;&#x9001;&#x4E22;&#x5931;&#x7684;&#x7F51;&#x7EDC;&#x6570;&#x636E;&#x5305;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x4E5F;&#x8BB8;&#x8BE5;&#x6570;&#x636E;&#x5305;&#x5B9E;&#x9645;&#x4E0A;&#x5E76;&#x6CA1;&#x6709;&#x4E22;&#x5931;&#xFF0C;&#x4F46;&#x662F;&#x53EA;&#x662F;&#x88AB;&#x5EF6;&#x8FDF;&#x4E86;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x91CD;&#x65B0;&#x53D1;&#x9001;&#x6570;&#x636E;&#x5305;&#x5C06;&#x5BFC;&#x81F4;&#x91CD;&#x590D;&#x7684;&#x6570;&#x636E;&#x5305;&#x5230;&#x8FBE;&#x5BF9;&#x7B49;&#x65B9;&#xFF1B;&#x8FD9;&#x5F15;&#x5165;&#x4E86;&#x5BF9;&#x7B49;&#x65B9;&#x5FC5;&#x987B;&#x5904;&#x7406;&#x7684;&#x65B0;&#x7684;&#x4F8B;&#x5916;&#x6761;&#x4EF6;&#x3002;&#x6216;&#x8005;&#xFF0C;&#x8003;&#x8651;&#x4ECE;&#x5197;&#x4F59;&#x526F;&#x672C;&#x6062;&#x590D;&#x4E22;&#x5931;&#x7684;&#x6570;&#x636E;&#x7684;&#x60C5;&#x51B5;&#xFF1A;&#x5982;&#x679C;&#x5197;&#x4F59;&#x526F;&#x672C;&#x4E5F;&#x4E22;&#x5931;&#x4E86;&#x600E;&#x4E48;&#x529E;&#xFF1F;&#x5728;&#x6062;&#x590D;&#x671F;&#x95F4;&#x53D1;&#x751F;&#x7684;&#x6B21;&#x8981;&#x5F02;&#x5E38;&#x901A;&#x5E38;&#x6BD4;&#x4E3B;&#x8981;&#x5F02;&#x5E38;&#x66F4;&#x52A0;&#x5FAE;&#x5999;&#x548C;&#x590D;&#x6742;&#x3002;&#x5982;&#x679C;&#x901A;&#x8FC7;&#x4E2D;&#x6B62;&#x6B63;&#x5728;&#x8FDB;&#x884C;&#x7684;&#x64CD;&#x4F5C;&#x6765;&#x5904;&#x7406;&#x5F02;&#x5E38;&#xFF0C;&#x5219;&#x5FC5;&#x987B;&#x5C06;&#x6B64;&#x5F02;&#x5E38;&#x4F5C;&#x4E3A;&#x53E6;&#x4E00;&#x4E2A;&#x5F02;&#x5E38;&#x62A5;&#x544A;&#x7ED9;&#x8C03;&#x7528;&#x65B9;&#x3002;&#x4E3A;&#x4E86;&#x9632;&#x6B62;&#x65E0;&#x4F11;&#x6B62;&#x7684;&#x5F02;&#x5E38;&#x7EA7;&#x8054;&#xFF0C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x6700;&#x7EC8;&#x5FC5;&#x987B;&#x627E;&#x5230;&#x4E00;&#x79CD;&#x5728;&#x4E0D;&#x5F15;&#x5165;&#x66F4;&#x591A;&#x5F02;&#x5E38;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x5904;&#x7406;&#x5F02;&#x5E38;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>
</blockquote>
<p>Language support for exceptions tends to be verbose and clunky, which makes exception handling code hard to read. For example, consider the following code, which reads a collection of tweets from a file using Java&#x2019;s support for object serialization and deserialization:</p>
<blockquote>
<p>&#x8BED;&#x8A00;&#x5BF9;&#x5F02;&#x5E38;&#x7684;&#x652F;&#x6301;&#x5F80;&#x5F80;&#x662F;&#x5197;&#x957F;&#x800C;&#x7B28;&#x62D9;&#x7684;&#xFF0C;&#x8FD9;&#x4F7F;&#x5F97;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x4EE3;&#x7801;&#x96BE;&#x4EE5;&#x9605;&#x8BFB;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x8003;&#x8651;&#x4EE5;&#x4E0B;&#x4EE3;&#x7801;&#xFF0C;&#x8BE5;&#x4EE3;&#x7801;&#x4F7F;&#x7528; Java &#x5BF9;&#x5BF9;&#x8C61;&#x5E8F;&#x5217;&#x5316;&#x548C;&#x53CD;&#x5E8F;&#x5217;&#x5316;&#x7684;&#x652F;&#x6301;&#x4ECE;&#x6587;&#x4EF6;&#x4E2D;&#x8BFB;&#x53D6; tweet &#x7684;&#x96C6;&#x5408;&#xFF1A;</p>
</blockquote>
<pre><code class="lang-java"><span class="hljs-keyword">try</span> (
    FileInputStream fileStream = <span class="hljs-keyword">new</span> FileInputStream(fileName);
    BufferedInputStream bufferedStream = <span class="hljs-keyword">new</span> BufferedInputStream(fileStream);
    ObjectInputStream objectStream = <span class="hljs-keyword">new</span> ObjectInputStream(bufferedStream);
) {
    <span class="hljs-keyword">for</span> (<span class="hljs-keyword">int</span> i = <span class="hljs-number">0</span>; i &lt; tweetsPerFile; i++) {
        tweets.add((Tweet) objectStream.readObject());
    }
}
<span class="hljs-keyword">catch</span> (FileNotFoundException e) {
    ...
}
<span class="hljs-keyword">catch</span> (ClassNotFoundException e) {
    ...
}
<span class="hljs-keyword">catch</span> (EOFException e) {
    <span class="hljs-comment">// Not a problem: not all tweet files have full</span>
    <span class="hljs-comment">// set of tweets.</span>
}
<span class="hljs-keyword">catch</span> (IOException e) {
    ...
}
<span class="hljs-keyword">catch</span> (ClassCastException e) {
    ...
}
</code></pre>
<p>Just the basic try-catch boilerplate accounts for more lines of code than the code for normal-case operation, without even considering the code that actually handles the exceptions. It is hard to relate the exception handling code to the normal-case code: for example, it&#x2019;s not obvious where each exception is generated. An alternative approach is to break up the code into many distinct try blocks; in the extreme case there could be a try for each line of code that can generate an exception. This would make it clear where exceptions occur, but the try blocks themselves break up the flow of the code and make it harder to read; in addition, some exception handling code might end up duplicated in multiple try blocks.</p>
<blockquote>
<p>&#x53EA;&#x662F;&#x57FA;&#x672C;&#x7684; try-catch &#x6837;&#x677F;&#x4EE3;&#x7801;&#x6BD4;&#x6B63;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#x7684;&#x64CD;&#x4F5C;&#x4EE3;&#x7801;&#x6240;&#x5360;&#x7684;&#x4EE3;&#x7801;&#x884C;&#x66F4;&#x591A;&#xFF0C;&#x751A;&#x81F3;&#x6CA1;&#x6709;&#x8003;&#x8651;&#x5B9E;&#x9645;&#x5904;&#x7406;&#x5F02;&#x5E38;&#x7684;&#x4EE3;&#x7801;&#x3002;&#x5F88;&#x96BE;&#x5C06;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x4EE3;&#x7801;&#x4E0E;&#x666E;&#x901A;&#x60C5;&#x51B5;&#x4EE3;&#x7801;&#x76F8;&#x5173;&#x8054;&#xFF1A;&#x4F8B;&#x5982;&#xFF0C;&#x6BCF;&#x4E2A;&#x5F02;&#x5E38;&#x7684;&#x751F;&#x6210;&#x4F4D;&#x7F6E;&#x90FD;&#x4E0D;&#x660E;&#x663E;&#x3002;&#x53E6;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x5C06;&#x4EE3;&#x7801;&#x5206;&#x89E3;&#x4E3A;&#x8BB8;&#x591A;&#x4E0D;&#x540C;&#x7684; try &#x5757;&#x3002;&#x5728;&#x6781;&#x7AEF;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x5C1D;&#x8BD5;&#x5C1D;&#x8BD5;&#x6BCF;&#x884C;&#x53EF;&#x80FD;&#x4EA7;&#x751F;&#x5F02;&#x5E38;&#x7684;&#x4EE3;&#x7801;&#x3002;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x6E05;&#x695A;&#x5730;&#x8BF4;&#x660E;&#x5F02;&#x5E38;&#x53D1;&#x751F;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x4F46;&#x662F; try &#x5757;&#x672C;&#x8EAB;&#x4F1A;&#x7834;&#x574F;&#x4EE3;&#x7801;&#x6D41;&#xFF0C;&#x5E76;&#x4F7F;&#x4EE3;&#x7801;&#x96BE;&#x4EE5;&#x9605;&#x8BFB;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x67D0;&#x4E9B;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x4EE3;&#x7801;&#x53EF;&#x80FD;&#x6700;&#x7EC8;&#x4F1A;&#x5728;&#x591A;&#x4E2A; try &#x5757;&#x4E2D;&#x91CD;&#x590D;&#x3002;</p>
</blockquote>
<p>It&#x2019;s difficult to ensure that exception handling code really works. Some exceptions, such as I/O errors, can&#x2019;t easily be generated in a test environment, so it&#x2019;s hard to test the code that handles them. Exceptions don&#x2019;t occur very often in running systems, so exception handling code rarely executes. Bugs can go undetected for a long time, and when the exception handling code is finally needed, there&#x2019;s a good chance that it won&#x2019;t work (one of my favorite sayings: &#x201C;code that hasn&#x2019;t been executed doesn&#x2019;t work&#x201D;). A recent study found that more than 90% of catastrophic failures in distributed data-intensive systems were caused by incorrect error handling1. When exception handling code fails, it&#x2019;s difficult to debug the problem, since it occurs so infrequently.</p>
<blockquote>
<p>&#x786E;&#x4FDD;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x4EE3;&#x7801;&#x771F;&#x6B63;&#x8D77;&#x4F5C;&#x7528;&#x662F;&#x56F0;&#x96BE;&#x7684;&#x3002;&#x67D0;&#x4E9B;&#x5F02;&#x5E38;&#xFF08;&#x4F8B;&#x5982; I/O &#x9519;&#x8BEF;&#xFF09;&#x5728;&#x6D4B;&#x8BD5;&#x73AF;&#x5883;&#x4E2D;&#x4E0D;&#x6613;&#x751F;&#x6210;&#xFF0C;&#x56E0;&#x6B64;&#x5F88;&#x96BE;&#x6D4B;&#x8BD5;&#x5904;&#x7406;&#x5B83;&#x4EEC;&#x7684;&#x4EE3;&#x7801;&#x3002;&#x5F02;&#x5E38;&#x5728;&#x8FD0;&#x884C;&#x7684;&#x7CFB;&#x7EDF;&#x4E2D;&#x5F88;&#x5C11;&#x53D1;&#x751F;&#xFF0C;&#x56E0;&#x6B64;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x4EE3;&#x7801;&#x5F88;&#x5C11;&#x6267;&#x884C;&#x3002;&#x9519;&#x8BEF;&#x53EF;&#x80FD;&#x4F1A;&#x957F;&#x65F6;&#x95F4;&#x672A;&#x88AB;&#x53D1;&#x73B0;&#xFF0C;&#x5E76;&#x4E14;&#x5F53;&#x6700;&#x7EC8;&#x9700;&#x8981;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x4EE3;&#x7801;&#x65F6;&#xFF0C;&#x5B83;&#x5F88;&#x6709;&#x53EF;&#x80FD;&#x65E0;&#x6CD5;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#xFF08;&#x6211;&#x6700;&#x559C;&#x6B22;&#x7684;&#x4E00;&#x53E5;&#x8BDD;&#x662F;&#xFF1A;&#x201C;&#x672A;&#x6267;&#x884C;&#x7684;&#x4EE3;&#x7801;&#x65E0;&#x6548;&#x201D;&#xFF09; &#x3002;&#x6700;&#x8FD1;&#x7684;&#x4E00;&#x9879;&#x7814;&#x7A76;&#x53D1;&#x73B0;&#xFF0C;&#x5206;&#x5E03;&#x5F0F;&#x6570;&#x636E;&#x5BC6;&#x96C6;&#x578B;&#x7CFB;&#x7EDF;&#x4E2D;&#x8D85;&#x8FC7; 90&#xFF05;&#x7684;&#x707E;&#x96BE;&#x6027;&#x6545;&#x969C;&#x662F;&#x7531;&#x9519;&#x8BEF;&#x7684;&#x9519;&#x8BEF;&#x5904;&#x7406;&#x5F15;&#x8D77;&#x7684; 1&#x3002;&#x5F53;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x4EE3;&#x7801;&#x5931;&#x8D25;&#x65F6;&#xFF0C;&#x5F88;&#x96BE;&#x8C03;&#x8BD5;&#x8BE5;&#x95EE;&#x9898;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x5F88;&#x5C11;&#x53D1;&#x751F;&#x3002;</p>
</blockquote>
<h2 id="102-too-many-exceptions-&#x5F02;&#x5E38;&#x8FC7;&#x591A;">10.2 Too many exceptions &#x5F02;&#x5E38;&#x8FC7;&#x591A;</h2>
<p>Programmers exacerbate the problems related to exception handling by defining unnecessary exceptions. Most programmers are taught that it&#x2019;s important to detect and report errors; they often interpret this to mean &#x201C;the more errors detected, the better.&#x201D; This leads to an over-defensive style where anything that looks even a bit suspicious is rejected with an exception, which results in a proliferation of unnecessary exceptions that increase the complexity of the system.</p>
<blockquote>
<p>&#x7A0B;&#x5E8F;&#x5458;&#x901A;&#x8FC7;&#x5B9A;&#x4E49;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x5F02;&#x5E38;&#x52A0;&#x5267;&#x4E86;&#x4E0E;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x6709;&#x5173;&#x7684;&#x95EE;&#x9898;&#x3002;&#x544A;&#x8BC9;&#x5927;&#x591A;&#x6570;&#x7A0B;&#x5E8F;&#x5458;&#xFF0C;&#x68C0;&#x6D4B;&#x548C;&#x62A5;&#x544A;&#x9519;&#x8BEF;&#x5F88;&#x91CD;&#x8981;&#x3002;&#x4ED6;&#x4EEC;&#x901A;&#x5E38;&#x5C06;&#x5176;&#x89E3;&#x91CA;&#x4E3A;&#x201C;&#x68C0;&#x6D4B;&#x5230;&#x7684;&#x9519;&#x8BEF;&#x8D8A;&#x591A;&#x8D8A;&#x597D;&#x201D;&#x3002;&#x8FD9;&#x5BFC;&#x81F4;&#x4E86;&#x4E00;&#x79CD;&#x8FC7;&#x5206;&#x9632;&#x5FA1;&#x7684;&#x98CE;&#x683C;&#xFF0C;&#x5176;&#x4E2D;&#x4EFB;&#x4F55;&#x770B;&#x8D77;&#x6765;&#x751A;&#x81F3;&#x6709;&#x70B9;&#x53EF;&#x7591;&#x7684;&#x4E1C;&#x897F;&#x90FD;&#x88AB;&#x62D2;&#x7EDD;&#xFF0C;&#x5E76;&#x5E26;&#x6709;&#x5F02;&#x5E38;&#xFF0C;&#x8FD9;&#x5BFC;&#x81F4;&#x4E86;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x5F02;&#x5E38;&#x7684;&#x6CDB;&#x6EE5;&#xFF0C;&#x4ECE;&#x800C;&#x589E;&#x52A0;&#x4E86;&#x7CFB;&#x7EDF;&#x7684;&#x590D;&#x6742;&#x6027;&#x3002;</p>
</blockquote>
<p>I made this mistake myself in the design of the Tcl scripting language. Tcl contains an unset command that can be used to remove a variable. I defined unset so that it throws an error if the variable doesn&#x2019;t exist. At the time I thought that it must be a bug if someone tries to delete a variable that doesn&#x2019;t exist, so Tcl should report it. However, one of the most common uses of unset is to clean up temporary state created by some previous operation. It&#x2019;s often hard to predict exactly what state was created, particularly if the operation aborted partway through. Thus, the simplest thing is to delete all of the variables that might possibly have been created. The definition of unset makes this awkward: developers end up enclosing calls to unset in catch statements to catch and ignore errors thrown by unset. In retrospect, the definition of the unset command is one of the biggest mistakes I made in the design of Tcl.</p>
<blockquote>
<p>&#x5728;&#x8BBE;&#x8BA1; Tcl &#x811A;&#x672C;&#x8BED;&#x8A00;&#x65F6;&#xFF0C;&#x6211;&#x81EA;&#x5DF1;&#x5C31;&#x72AF;&#x4E86;&#x8FD9;&#x4E2A;&#x9519;&#x8BEF;&#x3002;Tcl &#x5305;&#x542B;&#x4E00;&#x4E2A;&#x672A;&#x8BBE;&#x7F6E;&#x7684;&#x547D;&#x4EE4;&#xFF0C;&#x53EF;&#x7528;&#x4E8E;&#x5220;&#x9664;&#x53D8;&#x91CF;&#x3002;&#x6211;&#x5B9A;&#x4E49;&#x4E86; unset &#x4EE5;&#x4FBF;&#x5728;&#x53D8;&#x91CF;&#x4E0D;&#x5B58;&#x5728;&#x65F6;&#x629B;&#x51FA;&#x9519;&#x8BEF;&#x3002;&#x5F53;&#x65F6;&#x6211;&#x8BA4;&#x4E3A;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x4EBA;&#x8BD5;&#x56FE;&#x5220;&#x9664;&#x4E00;&#x4E2A;&#x4E0D;&#x5B58;&#x5728;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x4E00;&#x5B9A;&#x662F;&#x4E00;&#x4E2A; bug&#xFF0C;&#x6240;&#x4EE5; Tcl &#x5E94;&#x8BE5;&#x62A5;&#x544A;&#x5B83;&#x3002;&#x7136;&#x800C;&#xFF0C;unset &#x6700;&#x5E38;&#x89C1;&#x7684;&#x7528;&#x9014;&#x4E4B;&#x4E00;&#x662F;&#x6E05;&#x7406;&#x4EE5;&#x524D;&#x64CD;&#x4F5C;&#x521B;&#x5EFA;&#x7684;&#x4E34;&#x65F6;&#x72B6;&#x6001;&#x3002;&#x901A;&#x5E38;&#x5F88;&#x96BE;&#x51C6;&#x786E;&#x5730;&#x9884;&#x6D4B;&#x521B;&#x5EFA;&#x4E86;&#x4EC0;&#x4E48;&#x72B6;&#x6001;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5728;&#x64CD;&#x4F5C;&#x4E2D;&#x9014;&#x4E2D;&#x6B62;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6700;&#x7B80;&#x5355;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x5220;&#x9664;&#x53EF;&#x80FD;&#x5DF2;&#x7ECF;&#x521B;&#x5EFA;&#x7684;&#x6240;&#x6709;&#x53D8;&#x91CF;&#x3002;unset &#x7684;&#x5B9A;&#x4E49;&#x4F7F;&#x5F97;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x5F88;&#x5C34;&#x5C2C;:&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x6700;&#x7EC8;&#x4F1A;&#x5728; catch &#x8BED;&#x53E5;&#x4E2D;&#x5C01;&#x88C5;&#x5BF9; unset &#x7684;&#x8C03;&#x7528;&#xFF0C;&#x4EE5;&#x6355;&#x83B7;&#x5E76;&#x5FFD;&#x7565; unset &#x629B;&#x51FA;&#x7684;&#x9519;&#x8BEF;&#x3002;&#x56DE;&#x987E;&#x8FC7;&#x53BB;&#xFF0C;unset &#x547D;&#x4EE4;&#x7684;&#x5B9A;&#x4E49;&#x662F;&#x6211;&#x5728; Tcl &#x8BBE;&#x8BA1;&#x4E2D;&#x72AF;&#x4E0B;&#x7684;&#x6700;&#x5927;&#x9519;&#x8BEF;&#x4E4B;&#x4E00;&#x3002;</p>
</blockquote>
<p>It&#x2019;s tempting to use exceptions to avoid dealing with difficult situations: rather than figuring out a clean way to handle it, just throw an exception and punt the problem to the caller. Some might argue that this approach empowers callers, since it allows each caller to handle the exception in a different way. However, if you are having trouble figuring out what to do for the particular situation, there&#x2019;s a good chance that the caller won&#x2019;t know what to do either. Generating an exception in a situation like this just passes the problem to someone else and adds to the system&#x2019;s complexity.</p>
<blockquote>
<p>&#x8BD5;&#x56FE;&#x4F7F;&#x7528;&#x5F02;&#x5E38;&#x6765;&#x907F;&#x514D;&#x5904;&#x7406;&#x56F0;&#x96BE;&#x7684;&#x60C5;&#x51B5;&#x5F88;&#x8BF1;&#x4EBA;&#xFF1A;&#x4E0E;&#x5176;&#x60F3;&#x51FA;&#x4E00;&#x79CD;&#x5E72;&#x51C0;&#x7684;&#x65B9;&#x6CD5;&#x6765;&#x5904;&#x7406;&#x5B83;&#xFF0C;&#x4E0D;&#x5982;&#x629B;&#x51FA;&#x4E00;&#x4E2A;&#x5F02;&#x5E38;&#x5E76;&#x5C06;&#x95EE;&#x9898;&#x5E73;&#x79FB;&#x7ED9;&#x8C03;&#x7528;&#x8005;&#x3002;&#x6709;&#x4EBA;&#x53EF;&#x80FD;&#x4F1A;&#x4E89;&#x8FA9;&#x8BF4;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x8D4B;&#x4E88;&#x8C03;&#x7528;&#x8005;&#x6743;&#x529B;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x5141;&#x8BB8;&#x6BCF;&#x4E2A;&#x8C03;&#x7528;&#x8005;&#x4EE5;&#x4E0D;&#x540C;&#x7684;&#x65B9;&#x5F0F;&#x5904;&#x7406;&#x5F02;&#x5E38;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x60A8;&#x5728;&#x786E;&#x5B9A;&#x7279;&#x5B9A;&#x60C5;&#x51B5;&#x4E0B;&#x8BE5;&#x600E;&#x4E48;&#x505A;&#x65F6;&#x9047;&#x5230;&#x56F0;&#x96BE;&#xFF0C;&#x5219;&#x547C;&#x53EB;&#x8005;&#x5F88;&#x53EF;&#x80FD;&#x90FD;&#x4E0D;&#x77E5;&#x9053;&#x8BE5;&#x600E;&#x4E48;&#x529E;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x751F;&#x6210;&#x5F02;&#x5E38;&#x53EA;&#x4F1A;&#x5C06;&#x95EE;&#x9898;&#x4F20;&#x9012;&#x7ED9;&#x5176;&#x4ED6;&#x4EBA;&#xFF0C;&#x5E76;&#x589E;&#x52A0;&#x7CFB;&#x7EDF;&#x7684;&#x590D;&#x6742;&#x6027;&#x3002;</p>
</blockquote>
<p>The exceptions thrown by a class are part of its interface; classes with lots of exceptions have complex interfaces, and they are shallower than classes with fewer exceptions. An exception is a particularly complex element of an interface. It can propagate up through several stack levels before being caught, so it affects not just the method&#x2019;s caller, but potentially also higher-level callers (and their interfaces).</p>
<blockquote>
<p>&#x7C7B;&#x629B;&#x51FA;&#x7684;&#x5F02;&#x5E38;&#x662F;&#x5176;&#x63A5;&#x53E3;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF1B;&#x5177;&#x6709;&#x5927;&#x91CF;&#x5F02;&#x5E38;&#x7684;&#x7C7B;&#x5177;&#x6709;&#x590D;&#x6742;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x5E76;&#x4E14;&#x6BD4;&#x5177;&#x6709;&#x8F83;&#x5C11;&#x5F02;&#x5E38;&#x7684;&#x7C7B;&#x6D45;&#x3002;&#x5F02;&#x5E38;&#x662F;&#x63A5;&#x53E3;&#x4E2D;&#x7279;&#x522B;&#x590D;&#x6742;&#x7684;&#x5143;&#x7D20;&#x3002;&#x5B83;&#x53EF;&#x4EE5;&#x5728;&#x88AB;&#x6355;&#x83B7;&#x4E4B;&#x524D;&#x901A;&#x8FC7;&#x591A;&#x4E2A;&#x5806;&#x6808;&#x7EA7;&#x522B;&#x5411;&#x4E0A;&#x4F20;&#x64AD;&#xFF0C;&#x56E0;&#x6B64;&#x5B83;&#x4E0D;&#x4EC5;&#x5F71;&#x54CD;&#x65B9;&#x6CD5;&#x7684;&#x8C03;&#x7528;&#x8005;&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x53EF;&#x80FD;&#x5F71;&#x54CD;&#x66F4;&#x9AD8;&#x7EA7;&#x522B;&#x7684;&#x8C03;&#x7528;&#x8005;&#xFF08;&#x53CA;&#x5176;&#x63A5;&#x53E3;&#xFF09;&#x3002;</p>
</blockquote>
<p>Throwing exceptions is easy; handling them is hard. Thus, the complexity of exceptions comes from the exception handling code. The best way to reduce the complexity damage caused by exception handling is to reduce the number of places where exceptions have to be handled. The rest of this chapter will discuss four techniques for reducing the number of exception handlers.</p>
<blockquote>
<p>&#x629B;&#x51FA;&#x5F02;&#x5E38;&#x5F88;&#x5BB9;&#x6613;&#xFF1B;&#x5904;&#x7406;&#x5B83;&#x4EEC;&#x5F88;&#x56F0;&#x96BE;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5F02;&#x5E38;&#x7684;&#x590D;&#x6742;&#x6027;&#x6765;&#x81EA;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x4EE3;&#x7801;&#x3002;&#x51CF;&#x5C11;&#x7531;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x5F15;&#x8D77;&#x7684;&#x590D;&#x6742;&#x6027;&#x7834;&#x574F;&#x7684;&#x6700;&#x4F73;&#x65B9;&#x6CD5;&#x662F;&#x51CF;&#x5C11;&#x5FC5;&#x987B;&#x5904;&#x7406;&#x5F02;&#x5E38;&#x7684;&#x4F4D;&#x7F6E;&#x7684;&#x6570;&#x91CF;&#x3002;&#x672C;&#x7AE0;&#x7684;&#x5176;&#x4F59;&#x90E8;&#x5206;&#x5C06;&#x8BA8;&#x8BBA;&#x51CF;&#x5C11;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x6570;&#x91CF;&#x7684;&#x56DB;&#x79CD;&#x6280;&#x672F;&#x3002;</p>
</blockquote>
<h2 id="103-define-errors-out-of-existence-&#x5B9A;&#x4E49;&#x9519;&#x8BEF;&#x4E0D;&#x5B58;&#x5728;">10.3 Define errors out of existence &#x5B9A;&#x4E49;&#x9519;&#x8BEF;&#x4E0D;&#x5B58;&#x5728;</h2>
<p>The best way to eliminate exception handling complexity is to define your APIs so that there are no exceptions to handle: define errors out of existence. This may seem sacrilegious, but it is very effective in practice. Consider the Tcl unset command discussed above. Rather than throwing an error when unset is asked to delete an unknown variable, it should have simply returned without doing anything. I should have changed the definition of unset slightly: rather than deleting a variable, unset should ensure that a variable no longer exists. With the first definition, unset can&#x2019;t do its job if the variable doesn&#x2019;t exist, so generating an exception makes sense. With the second definition, it is perfectly natural for unset to be invoked with the name of a variable that doesn&#x2019;t exist. In this case, its work is already done, so it can simply return. There is no longer an error case to report.</p>
<blockquote>
<p>&#x6D88;&#x9664;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x590D;&#x6742;&#x6027;&#x7684;&#x6700;&#x597D;&#x65B9;&#x6CD5;&#x662F;&#x5B9A;&#x4E49;&#x60A8;&#x7684; API&#xFF0C;&#x4EE5;&#x4FBF;&#x6CA1;&#x6709;&#x5F02;&#x5E38;&#x8981;&#x5904;&#x7406;&#xFF1A;&#x5B9A;&#x4E49;&#x9519;&#x8BEF;&#x800C;&#x5DF2;&#x3002;&#x8FD9;&#x4F3C;&#x4E4E;&#x662F;&#x727A;&#x7272;&#x54C1;&#xFF0C;&#x4F46;&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#x975E;&#x5E38;&#x6709;&#x6548;&#x3002;&#x8003;&#x8651;&#x4E0A;&#x9762;&#x8BA8;&#x8BBA;&#x7684; Tcl unset &#x547D;&#x4EE4;&#x3002;&#x800C;&#x4E0D;&#x662F;&#x5728;&#x8981;&#x6C42; unset &#x5220;&#x9664;&#x672A;&#x77E5;&#x53D8;&#x91CF;&#x65F6;&#x5F15;&#x53D1;&#x9519;&#x8BEF;&#xFF0C;&#x5B83;&#x5E94;&#x8BE5;&#x53EA;&#x662F;&#x8FD4;&#x56DE;&#x800C;&#x65E0;&#x9700;&#x6267;&#x884C;&#x4EFB;&#x4F55;&#x64CD;&#x4F5C;&#x3002;&#x6211;&#x5E94;&#x8BE5;&#x7A0D;&#x5FAE;&#x4FEE;&#x6539;&#x4E00;&#x4E0B; unset &#x7684;&#x5B9A;&#x4E49;&#xFF1A;&#x4E0E;&#x5176;&#x5220;&#x9664;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#xFF0C;&#x4E0D;&#x5E94;&#x8BE5;&#x5220;&#x9664; unset &#x6765;&#x786E;&#x4FDD;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x4E0D;&#x518D;&#x5B58;&#x5728;&#x3002;&#x6839;&#x636E;&#x7B2C;&#x4E00;&#x4E2A;&#x5B9A;&#x4E49;&#xFF0C;&#x5982;&#x679C;&#x53D8;&#x91CF;&#x4E0D;&#x5B58;&#x5728;&#xFF0C;&#x5219; unset &#x4E0D;&#x80FD;&#x6267;&#x884C;&#x5176;&#x5DE5;&#x4F5C;&#xFF0C;&#x56E0;&#x6B64;&#x751F;&#x6210;&#x5F02;&#x5E38;&#x662F;&#x6709;&#x610F;&#x4E49;&#x7684;&#x3002;&#x4F7F;&#x7528;&#x7B2C;&#x4E8C;&#x4E2A;&#x5B9A;&#x4E49;&#xFF0C;&#x4F7F;&#x7528;&#x4E0D;&#x5B58;&#x5728;&#x7684;&#x53D8;&#x91CF;&#x540D;&#x8C03;&#x7528; unset &#x662F;&#x5F88;&#x81EA;&#x7136;&#x7684;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5B83;&#x7684;&#x5DE5;&#x4F5C;&#x5DF2;&#x7ECF;&#x5B8C;&#x6210;&#xFF0C;&#x56E0;&#x6B64;&#x53EF;&#x4EE5;&#x7B80;&#x5355;&#x5730;&#x8FD4;&#x56DE;&#x3002;</p>
</blockquote>
<h2 id="104-example-file-deletion-in-windows-&#x793A;&#x4F8B;&#xFF1A;windows-&#x4E2D;&#x7684;&#x6587;&#x4EF6;&#x5220;&#x9664;">10.4 Example: file deletion in Windows &#x793A;&#x4F8B;&#xFF1A;Windows &#x4E2D;&#x7684;&#x6587;&#x4EF6;&#x5220;&#x9664;</h2>
<p>File deletion provides another example of how errors can be defined away. The Windows operating system does not permit a file to be deleted if it is open in a process. This is a continual source of frustration for developers and users. In order to delete a file that is in use, the user must search through the system to find the process that has the file open, and then kill that process. Sometimes users give up and reboot their system, just so they can delete a file.</p>
<blockquote>
<p>&#x6587;&#x4EF6;&#x5220;&#x9664;&#x63D0;&#x4F9B;&#x4E86;&#x5982;&#x4F55;&#x5B9A;&#x4E49;&#x9519;&#x8BEF;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x793A;&#x4F8B;&#x3002;Windows &#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E0D;&#x5141;&#x8BB8;&#x5220;&#x9664;&#x6587;&#x4EF6;&#xFF08;&#x5982;&#x679C;&#x5DF2;&#x5728;&#x8FDB;&#x7A0B;&#x4E2D;&#x6253;&#x5F00;&#x6587;&#x4EF6;&#xFF09;&#x3002;&#x5BF9;&#x4E8E;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x548C;&#x7528;&#x6237;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x662F;&#x4E0D;&#x65AD;&#x6CAE;&#x4E27;&#x7684;&#x6839;&#x6E90;&#x3002;&#x4E3A;&#x4E86;&#x5220;&#x9664;&#x6B63;&#x5728;&#x4F7F;&#x7528;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x7528;&#x6237;&#x5FC5;&#x987B;&#x5728;&#x7CFB;&#x7EDF;&#x4E2D;&#x641C;&#x7D22;&#x4EE5;&#x627E;&#x5230;&#x5DF2;&#x6253;&#x5F00;&#x6587;&#x4EF6;&#x7684;&#x8FDB;&#x7A0B;&#xFF0C;&#x7136;&#x540E;&#x7EC8;&#x6B62;&#x8BE5;&#x8FDB;&#x7A0B;&#x3002;&#x6709;&#x65F6;&#x7528;&#x6237;&#x653E;&#x5F03;&#x5E76;&#x91CD;&#x65B0;&#x542F;&#x52A8;&#x7CFB;&#x7EDF;&#xFF0C;&#x53EA;&#x662F;&#x4E3A;&#x4E86;&#x5220;&#x9664;&#x6587;&#x4EF6;&#x3002;</p>
</blockquote>
<p>The Unix operating system defines file deletion more elegantly. In Unix, if a file is open when it is deleted, Unix does not delete the file immediately. Instead, it marks the file for deletion, then the delete operation returns successfully. The file name has been removed from its directory, so no other processes can open the old file and a new file with the same name can be created, but the existing file data persists. Processes that already have the file open can continue to read it and write it normally. Once the file has been closed by all of the accessing processes, its data is freed.</p>
<blockquote>
<p>Unix &#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x66F4;&#x4F18;&#x96C5;&#x5730;&#x5B9A;&#x4E49;&#x4E86;&#x6587;&#x4EF6;&#x5220;&#x9664;&#x3002;&#x5728; Unix &#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x5728;&#x5220;&#x9664;&#x6587;&#x4EF6;&#x65F6;&#x6253;&#x5F00;&#x4E86;&#x6587;&#x4EF6;&#xFF0C;&#x5219; Unix &#x4E0D;&#x4F1A;&#x7ACB;&#x5373;&#x5220;&#x9664;&#x8BE5;&#x6587;&#x4EF6;&#x3002;&#x800C;&#x662F;&#x5C06;&#x6587;&#x4EF6;&#x6807;&#x8BB0;&#x4E3A;&#x5220;&#x9664;&#xFF0C;&#x7136;&#x540E;&#x5220;&#x9664;&#x64CD;&#x4F5C;&#x6210;&#x529F;&#x8FD4;&#x56DE;&#x3002;&#x8BE5;&#x6587;&#x4EF6;&#x540D;&#x5DF2;&#x4ECE;&#x5176;&#x76EE;&#x5F55;&#x4E2D;&#x5220;&#x9664;&#xFF0C;&#x56E0;&#x6B64;&#x5176;&#x4ED6;&#x8FDB;&#x7A0B;&#x65E0;&#x6CD5;&#x6253;&#x5F00;&#x8BE5;&#x65E7;&#x6587;&#x4EF6;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x5177;&#x6709;&#x76F8;&#x540C;&#x540D;&#x79F0;&#x7684;&#x65B0;&#x6587;&#x4EF6;&#xFF0C;&#x4F46;&#x73B0;&#x6709;&#x6587;&#x4EF6;&#x6570;&#x636E;&#x5C06;&#x4FDD;&#x7559;&#x3002;&#x5DF2;&#x7ECF;&#x6253;&#x5F00;&#x6587;&#x4EF6;&#x7684;&#x8FDB;&#x7A0B;&#x53EF;&#x4EE5;&#x7EE7;&#x7EED;&#x8BFB;&#x53D6;&#x548C;&#x6B63;&#x5E38;&#x5199;&#x5165;&#x6587;&#x4EF6;&#x3002;&#x4E00;&#x65E6;&#x6240;&#x6709;&#x8BBF;&#x95EE;&#x8FDB;&#x7A0B;&#x90FD;&#x5173;&#x95ED;&#x4E86;&#x6587;&#x4EF6;&#xFF0C;&#x4FBF;&#x91CA;&#x653E;&#x5176;&#x6570;&#x636E;&#x3002;</p>
</blockquote>
<p>The Unix approach defines away two different kinds of errors. First, the delete operation no longer returns an error if the file is currently in use; the delete succeeds, and the file will eventually be deleted. Second, deleting a file that&#x2019;s in use does not create exceptions for the processes using the file. One possible approach to this problem would have been to delete the file immediately and mark all of the opens of the file to disable them; any attempts by other processes to read or write the deleted file would fail. However, this approach would create new errors for those processes to handle. Instead, Unix allows them to keep accessing the file normally; delaying the file deletion defines errors out of existence.</p>
<blockquote>
<p>Unix &#x65B9;&#x6CD5;&#x5B9A;&#x4E49;&#x4E86;&#x4E24;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x9519;&#x8BEF;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x5982;&#x679C;&#x6587;&#x4EF6;&#x5F53;&#x524D;&#x6B63;&#x5728;&#x4F7F;&#x7528;&#x4E2D;&#xFF0C;&#x5219;&#x5220;&#x9664;&#x64CD;&#x4F5C;&#x4E0D;&#x518D;&#x8FD4;&#x56DE;&#x9519;&#x8BEF;&#xFF1B;&#x5220;&#x9664;&#x6210;&#x529F;&#xFF0C;&#x8BE5;&#x6587;&#x4EF6;&#x6700;&#x7EC8;&#x5C06;&#x88AB;&#x5220;&#x9664;&#x3002;&#x5176;&#x6B21;&#xFF0C;&#x5220;&#x9664;&#x6B63;&#x5728;&#x4F7F;&#x7528;&#x7684;&#x6587;&#x4EF6;&#x4E0D;&#x4F1A;&#x4E3A;&#x4F7F;&#x7528;&#x8BE5;&#x6587;&#x4EF6;&#x7684;&#x8FDB;&#x7A0B;&#x521B;&#x5EFA;&#x4F8B;&#x5916;&#x3002;&#x89E3;&#x51B3;&#x6B64;&#x95EE;&#x9898;&#x7684;&#x4E00;&#x79CD;&#x53EF;&#x80FD;&#x65B9;&#x6CD5;&#x662F;&#x7ACB;&#x5373;&#x5220;&#x9664;&#x6587;&#x4EF6;&#x5E76;&#x6807;&#x8BB0;&#x6587;&#x4EF6;&#x7684;&#x6240;&#x6709;&#x6253;&#x5F00;&#x4EE5;&#x7981;&#x7528;&#x5B83;&#x4EEC;&#x3002;&#x5176;&#x4ED6;&#x8FDB;&#x7A0B;&#x8BFB;&#x53D6;&#x6216;&#x5199;&#x5165;&#x5DF2;&#x5220;&#x9664;&#x6587;&#x4EF6;&#x7684;&#x4EFB;&#x4F55;&#x5C1D;&#x8BD5;&#x5747;&#x5C06;&#x5931;&#x8D25;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x6B64;&#x65B9;&#x6CD5;&#x5C06;&#x4E3A;&#x90A3;&#x4E9B;&#x8981;&#x5904;&#x7406;&#x7684;&#x8FC7;&#x7A0B;&#x521B;&#x5EFA;&#x65B0;&#x7684;&#x9519;&#x8BEF;&#x3002;&#x76F8;&#x53CD;&#xFF0C;Unix &#x5141;&#x8BB8;&#x4ED6;&#x4EEC;&#x7EE7;&#x7EED;&#x6B63;&#x5E38;&#x8BBF;&#x95EE;&#x6587;&#x4EF6;&#x3002;&#x5EF6;&#x8FDF;&#x6587;&#x4EF6;&#x5220;&#x9664;&#x5C06;&#x5B9A;&#x4E49;&#x9519;&#x8BEF;&#x4E0D;&#x5B58;&#x5728;&#x3002;</p>
</blockquote>
<p>It may seem strange that Unix allows a process to continue to read and write a doomed file, but I have never encountered a situation where this caused significant problems. The Unix definition of file deletion is much simpler to work with, both for developers and users, than the Windows definition.</p>
<blockquote>
<p>Unix &#x5141;&#x8BB8;&#x8FDB;&#x7A0B;&#x7EE7;&#x7EED;&#x8BFB;&#x53D6;&#x548C;&#x5199;&#x5165;&#x5DF2;&#x635F;&#x574F;&#x7684;&#x6587;&#x4EF6;&#x53EF;&#x80FD;&#x770B;&#x8D77;&#x6765;&#x5F88;&#x5947;&#x602A;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4ECE;&#x672A;&#x9047;&#x5230;&#x8FC7;&#x5F15;&#x8D77;&#x4E25;&#x91CD;&#x95EE;&#x9898;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x5BF9;&#x4E8E;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x548C;&#x7528;&#x6237;&#xFF0C;Unix &#x5220;&#x9664;&#x6587;&#x4EF6;&#x7684;&#x5B9A;&#x4E49;&#x6BD4; Windows &#x5B9A;&#x4E49;&#x8981;&#x5BB9;&#x6613;&#x5F97;&#x591A;&#x3002;</p>
</blockquote>
<h2 id="105-example-java-substring-method-&#x793A;&#x4F8B;&#xFF1A;java-&#x5B50;&#x5B57;&#x7B26;&#x4E32;&#x65B9;&#x6CD5;">10.5 Example: Java substring method &#x793A;&#x4F8B;&#xFF1A;Java &#x5B50;&#x5B57;&#x7B26;&#x4E32;&#x65B9;&#x6CD5;</h2>
<p>As a final example, consider the Java String class and its substring method. Given two indexes into a string, substring returns the substring starting at the character given by the first index and ending with the character just before the second index. However, if either index is outside the range of the string, then substring throws IndexOutOfBoundsException. This exception is unnecessary and complicates the use of this method. I often find myself in a situation where one or both of the indices may be outside the range of the string, and I would like to extract all of the characters in the string that overlap the specified range. Unfortunately, this requires me to check each of the indices and round them up to zero or down to the end of the string; a one-line method call now becomes 5&#x2013;10 lines of code.</p>
<blockquote>
<p>&#x4F5C;&#x4E3A;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x793A;&#x4F8B;&#xFF0C;&#x8BF7;&#x8003;&#x8651; Java String &#x7C7B;&#x53CA;&#x5176;&#x5B50;&#x5B57;&#x7B26;&#x4E32;&#x65B9;&#x6CD5;&#x3002;&#x7ED9;&#x5B9A;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x4E2D;&#x7684;&#x4E24;&#x4E2A;&#x7D22;&#x5F15;&#xFF0C;substring &#x8FD4;&#x56DE;&#x8BE5;&#x5B50;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x8BE5;&#x5B57;&#x7B26;&#x4E32;&#x4ECE;&#x7B2C;&#x4E00;&#x4E2A;&#x7D22;&#x5F15;&#x7ED9;&#x5B9A;&#x7684;&#x5B57;&#x7B26;&#x5F00;&#x59CB;&#xFF0C;&#x4EE5;&#x7B2C;&#x4E8C;&#x4E2A;&#x7D22;&#x5F15;&#x4E4B;&#x524D;&#x7684;&#x5B57;&#x7B26;&#x7ED3;&#x675F;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x4E24;&#x4E2A;&#x7D22;&#x5F15;&#x4E2D;&#x7684;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x90FD;&#x8D85;&#x51FA;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x8303;&#x56F4;&#xFF0C;&#x5219;&#x5B50;&#x5B57;&#x7B26;&#x4E32;&#x5C06;&#x5F15;&#x53D1; IndexOutOfBoundsException&#x3002;&#x6B64;&#x5F02;&#x5E38;&#x662F;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x4F1A;&#x4F7F;&#x6B64;&#x65B9;&#x6CD5;&#x7684;&#x4F7F;&#x7528;&#x590D;&#x6742;&#x5316;&#x3002;&#x6211;&#x7ECF;&#x5E38;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x5904;&#x4E8E;&#x4E00;&#x4E2A;&#x6216;&#x4E24;&#x4E2A;&#x7D22;&#x5F15;&#x53EF;&#x80FD;&#x4E0D;&#x5728;&#x5B57;&#x7B26;&#x4E32;&#x8303;&#x56F4;&#x5185;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x5E76;&#x4E14;&#x6211;&#x60F3;&#x63D0;&#x53D6;&#x5B57;&#x7B26;&#x4E32;&#x4E2D;&#x4E0E;&#x6307;&#x5B9A;&#x8303;&#x56F4;&#x91CD;&#x53E0;&#x7684;&#x6240;&#x6709;&#x5B57;&#x7B26;&#x3002;&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x8FD9;&#x8981;&#x6C42;&#x6211;&#x68C0;&#x67E5;&#x6BCF;&#x4E2A;&#x7D22;&#x5F15;&#x5E76;&#x5C06;&#x5B83;&#x4EEC;&#x5411;&#x4E0A;&#x820D;&#x5165;&#x4E3A;&#x96F6;&#x6216;&#x5411;&#x4E0B;&#x820D;&#x5165;&#x5230;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x672B;&#x5C3E;&#x3002;&#x73B0;&#x5728;&#xFF0C;&#x5355;&#x884C;&#x65B9;&#x6CD5;&#x8C03;&#x7528;&#x53D8;&#x6210; 5-10 &#x884C;&#x4EE3;&#x7801;&#x3002;</p>
</blockquote>
<p>The Java substring method would be easier to use if it performed this adjustment automatically, so that it implemented the following API: &#x201C;returns the characters of the string (if any) with index greater than or equal to beginIndex and less than endIndex.&#x201D; This is a simple and natural API, and it defines the IndexOutOfBoundsException exception out of existence. The method&#x2019;s behavior is now well-defined even if one or both of the indexes are negative, or if beginIndex is greater than endIndex. This approach simplifies the API for the method while increasing its functionality, so it makes the method deeper. Many other languages have taken the error-free approach; for example, Python returns an empty result for out-of-range list slices.</p>
<blockquote>
<p>&#x5982;&#x679C; Java &#x5B50;&#x5B57;&#x7B26;&#x4E32;&#x65B9;&#x6CD5;&#x81EA;&#x52A8;&#x6267;&#x884C;&#x6B64;&#x8C03;&#x6574;&#xFF0C;&#x5219;&#x5C06;&#x66F4;&#x6613;&#x4E8E;&#x4F7F;&#x7528;&#xFF0C;&#x56E0;&#x6B64;&#x5B83;&#x5B9E;&#x73B0;&#x4E86;&#x4EE5;&#x4E0B; API&#xFF1A;&#x201C;&#x8FD4;&#x56DE;&#x7D22;&#x5F15;&#x5927;&#x4E8E;&#x6216;&#x7B49;&#x4E8E; beginIndex &#x4E14;&#x5C0F;&#x4E8E; endIndex &#x7684;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x5B57;&#x7B26;&#xFF08;&#x5982;&#x679C;&#x6709;&#xFF09;&#x3002;&#x201D; &#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x81EA;&#x7136;&#x7684; API&#xFF0C;&#x5B83;&#x5B9A;&#x4E49;&#x4E86; IndexOutOfBoundsException &#x5F02;&#x5E38;&#x3002;&#x73B0;&#x5728;&#xFF0C;&#x5373;&#x4F7F;&#x4E00;&#x4E2A;&#x6216;&#x4E24;&#x4E2A;&#x7D22;&#x5F15;&#x5747;&#x4E3A;&#x8D1F;&#xFF0C;&#x6216;&#x8005; beginIndex &#x5927;&#x4E8E; endIndex&#xFF0C;&#x8BE5;&#x65B9;&#x6CD5;&#x7684;&#x884C;&#x4E3A;&#x4E5F;&#x5DF2;&#x660E;&#x786E;&#x5B9A;&#x4E49;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x7B80;&#x5316;&#x4E86;&#x65B9;&#x6CD5;&#x7684; API&#xFF0C;&#x540C;&#x65F6;&#x589E;&#x52A0;&#x4E86;&#x5176;&#x529F;&#x80FD;&#xFF0C;&#x56E0;&#x6B64;&#x4F7F;&#x65B9;&#x6CD5;&#x66F4;&#x6DF1;&#x3002;&#x8BB8;&#x591A;&#x5176;&#x4ED6;&#x8BED;&#x8A00;&#x90FD;&#x91C7;&#x7528;&#x4E86;&#x65E0;&#x9519;&#x8BEF;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x4F8B;&#x5982;&#xFF0C;Python &#x5BF9;&#x4E8E;&#x8D85;&#x51FA;&#x8303;&#x56F4;&#x7684;&#x5217;&#x8868;&#x5207;&#x7247;&#x8FD4;&#x56DE;&#x7A7A;&#x7ED3;&#x679C;&#x3002;</p>
</blockquote>
<p>When I argue for defining errors out of existence, people sometimes counter that throwing errors will catch bugs; if errors are defined out of existence, won&#x2019;t that result in buggier software? Perhaps this is why the Java developers decided that substring should throw exceptions. The error-ful approach may catch some bugs, but it also increases complexity, which results in other bugs. In the error-ful approach, developers must write additional code to avoid or ignore the errors, and this increases the likelihood of bugs; or, they may forget to write the additional code, in which case unexpected errors may be thrown at runtime. In contrast, defining errors out of existence simplifies APIs and it reduces the amount of code that must be written.</p>
<blockquote>
<p>&#x5F53;&#x6211;&#x4E3B;&#x5F20;&#x5B9A;&#x4E49;&#x9519;&#x8BEF;&#x800C;&#x4E0D;&#x518D;&#x5B58;&#x5728;&#x65F6;&#xFF0C;&#x4EBA;&#x4EEC;&#x6709;&#x65F6;&#x4F1A;&#x53CD;&#x9A73;&#x8BF4;&#x629B;&#x51FA;&#x9519;&#x8BEF;&#x4F1A;&#x6355;&#x83B7;&#x9519;&#x8BEF;&#x3002;&#x5982;&#x679C;&#x9519;&#x8BEF;&#x5B9A;&#x4E49;&#x4E0D;&#x5B58;&#x5728;&#xFF0C;&#x90A3;&#x4F1A;&#x4E0D;&#x4F1A;&#x5BFC;&#x81F4; Buggier &#x8F6F;&#x4EF6;&#x51FA;&#x73B0;&#xFF1F;&#x4E5F;&#x8BB8;&#x8FD9;&#x5C31;&#x662F; Java &#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x51B3;&#x5B9A;&#x5B50;&#x5B57;&#x7B26;&#x4E32;&#x5E94;&#x5F15;&#x53D1;&#x5F02;&#x5E38;&#x7684;&#x539F;&#x56E0;&#x3002;&#x9519;&#x8BEF;&#x7684;&#x65B9;&#x6CD5;&#x53EF;&#x80FD;&#x4F1A;&#x6355;&#x83B7;&#x4E00;&#x4E9B;&#x9519;&#x8BEF;&#xFF0C;&#x4F46;&#x4E5F;&#x4F1A;&#x589E;&#x52A0;&#x590D;&#x6742;&#x6027;&#xFF0C;&#x4ECE;&#x800C;&#x5BFC;&#x81F4;&#x5176;&#x4ED6;&#x9519;&#x8BEF;&#x3002;&#x5728;&#x9519;&#x8BEF;&#x6709;&#x6548;&#x7684;&#x65B9;&#x6CD5;&#x4E2D;&#xFF0C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5FC5;&#x987B;&#x7F16;&#x5199;&#x989D;&#x5916;&#x7684;&#x4EE3;&#x7801;&#x6765;&#x907F;&#x514D;&#x6216;&#x5FFD;&#x7565;&#x9519;&#x8BEF;&#xFF0C;&#x8FD9;&#x589E;&#x52A0;&#x4E86;&#x53D1;&#x751F;&#x9519;&#x8BEF;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x3002;&#x6216;&#x8005;&#xFF0C;&#x4ED6;&#x4EEC;&#x53EF;&#x80FD;&#x4F1A;&#x5FD8;&#x8BB0;&#x7F16;&#x5199;&#x5176;&#x4ED6;&#x4EE3;&#x7801;&#xFF0C;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8FD0;&#x884C;&#x65F6;&#x53EF;&#x80FD;&#x4F1A;&#x5F15;&#x53D1;&#x610F;&#x5916;&#x9519;&#x8BEF;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x5B9A;&#x4E49;&#x9519;&#x8BEF;&#x800C;&#x4E0D;&#x5B58;&#x5728;&#x5C06;&#x7B80;&#x5316; API&#xFF0C;&#x5E76;&#x51CF;&#x5C11;&#x5FC5;&#x987B;&#x7F16;&#x5199;&#x7684;&#x4EE3;&#x7801;&#x91CF;&#x3002;</p>
</blockquote>
<p>Overall, the best way to reduce bugs is to make software simpler.</p>
<blockquote>
<p>&#x603B;&#x4F53;&#x800C;&#x8A00;&#xFF0C;&#x51CF;&#x5C11;&#x9519;&#x8BEF;&#x7684;&#x6700;&#x597D;&#x65B9;&#x6CD5;&#x662F;&#x7B80;&#x5316;&#x8F6F;&#x4EF6;&#x3002;</p>
</blockquote>
<h2 id="106-mask-exceptions-&#x63A9;&#x7801;&#x5F02;&#x5E38;">10.6 Mask exceptions &#x63A9;&#x7801;&#x5F02;&#x5E38;</h2>
<p>The second technique for reducing the number of places where exceptions must be handled is exception masking. With this approach, an exceptional condition is detected and handled at a low level in the system, so that higher levels of software need not be aware of the condition. Exception masking is particularly common in distributed systems. For instance, in a network transport protocol such as TCP, packets can be dropped for various reasons such as corruption and congestion. TCP masks packet loss by resending lost packets within its implementation, so all data eventually gets through and clients are unaware of the dropped packets.</p>
<blockquote>
<p>&#x51CF;&#x5C11;&#x5FC5;&#x987B;&#x5904;&#x7406;&#x5F02;&#x5E38;&#x7684;&#x5730;&#x65B9;&#x6570;&#x91CF;&#x7684;&#x7B2C;&#x4E8C;&#x79CD;&#x6280;&#x672F;&#x662F;&#x5F02;&#x5E38;&#x5C4F;&#x853D;&#x3002;&#x4F7F;&#x7528;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x7CFB;&#x7EDF;&#x7684;&#x8F83;&#x4F4E;&#x7EA7;&#x522B;&#x4E0A;&#x68C0;&#x6D4B;&#x548C;&#x5904;&#x7406;&#x5F02;&#x5E38;&#x60C5;&#x51B5;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x66F4;&#x9AD8;&#x7EA7;&#x522B;&#x7684;&#x8F6F;&#x4EF6;&#x65E0;&#x9700;&#x77E5;&#x9053;&#x8BE5;&#x60C5;&#x51B5;&#x3002;&#x5F02;&#x5E38;&#x5C4F;&#x853D;&#x5728;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x4E2D;&#x5C24;&#x5176;&#x5E38;&#x89C1;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5728;&#x8BF8;&#x5982; TCP &#x7684;&#x7F51;&#x7EDC;&#x4F20;&#x8F93;&#x534F;&#x8BAE;&#x4E2D;&#xFF0C;&#x7531;&#x4E8E;&#x5404;&#x79CD;&#x539F;&#x56E0;&#xFF08;&#x4F8B;&#x5982;&#x635F;&#x574F;&#x548C;&#x62E5;&#x585E;&#xFF09;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x4E22;&#x5F03;&#x6570;&#x636E;&#x5305;&#x3002;TCP &#x901A;&#x8FC7;&#x5728;&#x5176;&#x5B9E;&#x73B0;&#x4E2D;&#x91CD;&#x65B0;&#x53D1;&#x9001;&#x4E22;&#x5931;&#x7684;&#x6570;&#x636E;&#x5305;&#x6765;&#x63A9;&#x76D6;&#x6570;&#x636E;&#x5305;&#x7684;&#x4E22;&#x5931;&#xFF0C;&#x56E0;&#x6B64;&#x6240;&#x6709;&#x6570;&#x636E;&#x6700;&#x7EC8;&#x90FD;&#x5C06;&#x901A;&#x8FC7;&#xFF0C;&#x5E76;&#x4E14;&#x5BA2;&#x6237;&#x7AEF;&#x4E0D;&#x77E5;&#x9053;&#x4E22;&#x5931;&#x7684;&#x6570;&#x636E;&#x5305;&#x3002;</p>
</blockquote>
<p>A more controversial example of masking occurs in the NFS network file system. If an NFS file server crashes or fails to respond for any reason, clients reissue their requests to the server over and over again until the problem is eventually resolved. The low-level file system code on the client does not report any exceptions to the invoking application. The operation in progress (and hence the application) just hangs until the operation can complete successfully. If the hang lasts more than a short time, the NFS client prints messages on the user&#x2019;s console of the form &#x201C;NFS server xyzzy not responding still trying.&#x201D;</p>
<blockquote>
<p>NFS &#x7F51;&#x7EDC;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E2D;&#x51FA;&#x73B0;&#x4E86;&#x4E00;&#x4E2A;&#x66F4;&#x5177;&#x4E89;&#x8BAE;&#x6027;&#x7684;&#x5C4F;&#x853D;&#x793A;&#x4F8B;&#x3002;&#x5982;&#x679C; NFS &#x6587;&#x4EF6;&#x670D;&#x52A1;&#x5668;&#x7531;&#x4E8E;&#x4EFB;&#x4F55;&#x539F;&#x56E0;&#x5D29;&#x6E83;&#x6216;&#x65E0;&#x6CD5;&#x54CD;&#x5E94;&#xFF0C;&#x5BA2;&#x6237;&#x7AEF;&#x5C06;&#x4E00;&#x904D;&#x53C8;&#x4E00;&#x904D;&#x5730;&#x5411;&#x670D;&#x52A1;&#x5668;&#x53D1;&#x51FA;&#x8BF7;&#x6C42;&#xFF0C;&#x76F4;&#x5230;&#x95EE;&#x9898;&#x6700;&#x7EC8;&#x5F97;&#x5230;&#x89E3;&#x51B3;&#x3002;&#x5BA2;&#x6237;&#x7AEF;&#x4E0A;&#x7684;&#x4F4E;&#x7EA7;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4EE3;&#x7801;&#x4E0D;&#x4F1A;&#x5411;&#x8C03;&#x7528;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x62A5;&#x544A;&#x4EFB;&#x4F55;&#x5F02;&#x5E38;&#x3002;&#x6B63;&#x5728;&#x8FDB;&#x884C;&#x7684;&#x64CD;&#x4F5C;&#xFF08;&#x4EE5;&#x53CA;&#x56E0;&#x6B64;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF09;&#x53EA;&#x662F;&#x6302;&#x8D77;&#xFF0C;&#x76F4;&#x5230;&#x64CD;&#x4F5C;&#x53EF;&#x4EE5;&#x6210;&#x529F;&#x5B8C;&#x6210;&#x3002;&#x5982;&#x679C;&#x6302;&#x8D77;&#x6301;&#x7EED;&#x7684;&#x65F6;&#x95F4;&#x4E0D;&#x8D85;&#x8FC7;&#x4E00;&#x5C0F;&#x6BB5;&#x65F6;&#x95F4;&#xFF0C;&#x5219; NFS &#x5BA2;&#x6237;&#x7AEF;&#x5C06;&#x5728;&#x7528;&#x6237;&#x63A7;&#x5236;&#x53F0;&#x4E0A;&#x4EE5;&#x201C; NFS &#x670D;&#x52A1;&#x5668; xyzzy &#x65E0;&#x6CD5;&#x54CD;&#x5E94;&#x4ECD;&#x5728;&#x5C1D;&#x8BD5;&#x54CD;&#x5E94;&#x201D;&#x7684;&#x5F62;&#x5F0F;&#x6253;&#x5370;&#x6D88;&#x606F;&#x3002;</p>
</blockquote>
<p>NFS users often complain about the fact that their applications hang while waiting for an NFS server to resume normal operation. Many people have suggested that NFS should abort operations with an exception rather than hanging. However, reporting exceptions would make things worse, not better. There&#x2019;s not much an application can do if it loses access to its files. One possibility would be for the application to retry the file operation, but this would still hang the application, and it&#x2019;s easier to perform the retry in one place in the NFS layer, rather than at every file system call in every application (a compiler shouldn&#x2019;t have to worry about this!). The other alternative is for applications to abort and return errors to their callers. It&#x2019;s unlikely that the callers would know what to do either, so they would abort as well, resulting in a collapse of the user&#x2019;s working environment. Users still wouldn&#x2019;t be able to get any work done while the file server was down, and they would have to restart all of their applications once the file server came back to life.</p>
<blockquote>
<p>NFS &#x7528;&#x6237;&#x7ECF;&#x5E38;&#x62B1;&#x6028;&#x8FD9;&#x6837;&#x7684;&#x4E8B;&#x5B9E;&#xFF0C;&#x5373;&#x4ED6;&#x4EEC;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5728;&#x7B49;&#x5F85; NFS &#x670D;&#x52A1;&#x5668;&#x6062;&#x590D;&#x6B63;&#x5E38;&#x8FD0;&#x884C;&#x65F6;&#x6302;&#x8D77;&#x3002;&#x8BB8;&#x591A;&#x4EBA;&#x5EFA;&#x8BAE; NFS &#x5E94;&#x8BE5;&#x5F02;&#x5E38;&#x7EC8;&#x6B62;&#x64CD;&#x4F5C;&#x800C;&#x4E0D;&#x662F;&#x6302;&#x8D77;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x62A5;&#x544A;&#x5F02;&#x5E38;&#x4F1A;&#x4F7F;&#x60C5;&#x51B5;&#x66F4;&#x7CDF;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x66F4;&#x597D;&#x3002;&#x5982;&#x679C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x65E0;&#x6CD5;&#x8BBF;&#x95EE;&#x5176;&#x6587;&#x4EF6;&#xFF0C;&#x5219;&#x65E0;&#x80FD;&#x4E3A;&#x529B;&#x3002;&#x4E00;&#x79CD;&#x53EF;&#x80FD;&#x6027;&#x662F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x91CD;&#x8BD5;&#x6587;&#x4EF6;&#x64CD;&#x4F5C;&#xFF0C;&#x4F46;&#x8FD9;&#x4ECD;&#x7136;&#x4F1A;&#x4F7F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6302;&#x8D77;&#xFF0C;&#x5E76;&#x4E14;&#x5728; NFS &#x5C42;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x4F4D;&#x7F6E;&#x6267;&#x884C;&#x91CD;&#x8BD5;&#x4F1A;&#x6BD4;&#x5728;&#x6BCF;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x5904;&#x6267;&#x884C;&#x91CD;&#x8BD5;&#x66F4;&#x5BB9;&#x6613;&#xFF08;&#x7F16;&#x8BD1;&#x5668;&#x5E94;&#x4E0D;&#x5FC5;&#x4E3A;&#x6B64;&#x62C5;&#x5FC3;&#xFF01;&#xFF09;&#x3002;&#x53E6;&#x4E00;&#x79CD;&#x9009;&#x62E9;&#x662F;&#x8BA9;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x6B62;&#x5E76;&#x5C06;&#x9519;&#x8BEF;&#x8FD4;&#x56DE;&#x7ED9;&#x8C03;&#x7528;&#x8005;&#x3002;&#x547C;&#x53EB;&#x8005;&#x4E0D;&#x592A;&#x53EF;&#x80FD;&#x77E5;&#x9053;&#x8BE5;&#x600E;&#x4E48;&#x505A;&#xFF0C;&#x56E0;&#x6B64;&#x4ED6;&#x4EEC;&#x4E5F;&#x5C06;&#x4E2D;&#x6B62;&#xFF0C;&#x5BFC;&#x81F4;&#x7528;&#x6237;&#x5DE5;&#x4F5C;&#x73AF;&#x5883;&#x5D29;&#x6E83;&#x3002;&#x7528;&#x6237;&#x5728;&#x6587;&#x4EF6;&#x670D;&#x52A1;&#x5668;&#x5173;&#x95ED;&#x65F6;&#x4ECD;&#x7136;&#x65E0;&#x6CD5;&#x5B8C;&#x6210;&#x4EFB;&#x4F55;&#x5DE5;&#x4F5C;&#xFF0C;&#x5E76;&#x4E14;&#x4E00;&#x65E6;&#x6587;&#x4EF6;&#x670D;&#x52A1;&#x5668;&#x6062;&#x590D;&#x5DE5;&#x4F5C;&#xFF0C;&#x4ED6;&#x4EEC;&#x5C06;&#x4E0D;&#x5F97;&#x4E0D;&#x91CD;&#x65B0;&#x542F;&#x52A8;&#x6240;&#x6709;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;</p>
</blockquote>
<p>Thus, the best alternative is for NFS to mask the errors and hang applications. With this approach, applications don&#x2019;t need any code to deal with server problems, and they can resume seamlessly once the server comes back to life. If users get tired of waiting, they can always abort applications manually.</p>
<blockquote>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x6700;&#x597D;&#x7684;&#x66FF;&#x4EE3;&#x65B9;&#x6CD5;&#x662F;&#x8BA9; NFS &#x63A9;&#x76D6;&#x9519;&#x8BEF;&#x5E76;&#x6302;&#x8D77;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;&#x901A;&#x8FC7;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E0D;&#x9700;&#x8981;&#x4EFB;&#x4F55;&#x4EE3;&#x7801;&#x6765;&#x5904;&#x7406;&#x670D;&#x52A1;&#x5668;&#x95EE;&#x9898;&#xFF0C;&#x5E76;&#x4E14;&#x4E00;&#x65E6;&#x670D;&#x52A1;&#x5668;&#x6062;&#x590D;&#x8FD0;&#x884C;&#xFF0C;&#x5B83;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x65E0;&#x7F1D;&#x6062;&#x590D;&#x3002;&#x5982;&#x679C;&#x7528;&#x6237;&#x538C;&#x5026;&#x4E86;&#x7B49;&#x5F85;&#xFF0C;&#x4ED6;&#x4EEC;&#x603B;&#x662F;&#x53EF;&#x4EE5;&#x624B;&#x52A8;&#x4E2D;&#x6B62;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;</p>
</blockquote>
<p>Exception masking doesn&#x2019;t work in all situations, but it is a powerful tool in the situations where it works. It results in deeper classes, since it reduces the class&#x2019;s interface (fewer exceptions for users to be aware of) and adds functionality in the form of the code that masks the exception. Exception masking is an example of pulling complexity downward.</p>
<blockquote>
<p>&#x5F02;&#x5E38;&#x5C4F;&#x853D;&#x5E76;&#x975E;&#x5728;&#x6240;&#x6709;&#x60C5;&#x51B5;&#x4E0B;&#x90FD;&#x6709;&#x6548;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x5B83;&#x8D77;&#x4F5C;&#x7528;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x5F3A;&#x5927;&#x7684;&#x5DE5;&#x5177;&#x3002;&#x5B83;&#x5BFC;&#x81F4;&#x4E86;&#x66F4;&#x6DF1;&#x7684;&#x7C7B;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x51CF;&#x5C11;&#x4E86;&#x7C7B;&#x7684;&#x754C;&#x9762;&#xFF08;&#x7528;&#x6237;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x5F02;&#x5E38;&#x66F4;&#x5C11;&#xFF09;&#x5E76;&#x4EE5;&#x63A9;&#x76D6;&#x5F02;&#x5E38;&#x7684;&#x4EE3;&#x7801;&#x5F62;&#x5F0F;&#x6DFB;&#x52A0;&#x4E86;&#x529F;&#x80FD;&#x3002;&#x5F02;&#x5E38;&#x5C4F;&#x853D;&#x662F;&#x964D;&#x4F4E;&#x590D;&#x6742;&#x6027;&#x7684;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x3002;</p>
</blockquote>
<h2 id="107-exception-aggregation-&#x5F02;&#x5E38;&#x805A;&#x96C6;">10.7 Exception aggregation &#x5F02;&#x5E38;&#x805A;&#x96C6;</h2>
<p>The third technique for reducing complexity related to exceptions is exception aggregation. The idea behind exception aggregation is to handle many exceptions with a single piece of code; rather than writing distinct handlers for many individual exceptions, handle them all in one place with a single handler.</p>
<blockquote>
<p>&#x51CF;&#x5C11;&#x4E0E;&#x5F02;&#x5E38;&#x76F8;&#x5173;&#x7684;&#x590D;&#x6742;&#x6027;&#x7684;&#x7B2C;&#x4E09;&#x79CD;&#x6280;&#x672F;&#x662F;&#x5F02;&#x5E38;&#x805A;&#x5408;&#x3002;&#x5F02;&#x5E38;&#x805A;&#x5408;&#x7684;&#x601D;&#x60F3;&#x662F;&#x7528;&#x4E00;&#x4E2A;&#x4EE3;&#x7801;&#x6BB5;&#x5904;&#x7406;&#x8BB8;&#x591A;&#x5F02;&#x5E38;&#x3002;&#x4E0E;&#x5176;&#x4E3A;&#x591A;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x5F02;&#x5E38;&#x7F16;&#x5199;&#x4E0D;&#x540C;&#x7684;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#xFF0C;&#x4E0D;&#x5982;&#x7528;&#x4E00;&#x4E2A;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x5C06;&#x5B83;&#x4EEC;&#x5168;&#x90E8;&#x5904;&#x7406;&#x5728;&#x4E00;&#x4E2A;&#x5730;&#x65B9;&#x3002;</p>
</blockquote>
<p>Consider how to handle missing parameters in a Web server. A Web server implements a collection of URLs. When the server receives an incoming URL, it dispatches to a URL-specific service method to process that URL and generate a response. The URL contains various parameters that are used to generate the response. Each service method will call a lower-level method (let&#x2019;s call it getParameter) to extract the parameters that it needs from the URL. If the URL does not contain the desired parameter, getParameter throws an exception.</p>
<blockquote>
<p>&#x8003;&#x8651;&#x5982;&#x4F55;&#x5904;&#x7406; Web &#x670D;&#x52A1;&#x5668;&#x4E2D;&#x7F3A;&#x5C11;&#x7684;&#x53C2;&#x6570;&#x3002;Web &#x670D;&#x52A1;&#x5668;&#x5B9E;&#x73B0; URL &#x7684;&#x96C6;&#x5408;&#x3002;&#x670D;&#x52A1;&#x5668;&#x6536;&#x5230;&#x4F20;&#x5165;&#x7684; URL &#x65F6;&#xFF0C;&#x5C06;&#x5206;&#x6D3E;&#x5230;&#x7279;&#x5B9A;&#x4E8E; URL &#x7684;&#x670D;&#x52A1;&#x65B9;&#x6CD5;&#x6765;&#x5904;&#x7406;&#x8BE5; URL &#x5E76;&#x751F;&#x6210;&#x54CD;&#x5E94;&#x3002;&#x8BE5; URL &#x5305;&#x542B;&#x7528;&#x4E8E;&#x751F;&#x6210;&#x54CD;&#x5E94;&#x7684;&#x5404;&#x79CD;&#x53C2;&#x6570;&#x3002;&#x6BCF;&#x4E2A;&#x670D;&#x52A1;&#x65B9;&#x6CD5;&#x90FD;&#x5C06;&#x8C03;&#x7528;&#x4E00;&#x4E2A;&#x8F83;&#x4F4E;&#x5C42;&#x7684;&#x65B9;&#x6CD5;&#xFF08;&#x5C06;&#x5176;&#x79F0;&#x4E3A; getParameter&#xFF09;&#x4EE5;&#x4ECE; URL &#x4E2D;&#x63D0;&#x53D6;&#x6240;&#x9700;&#x7684;&#x53C2;&#x6570;&#x3002;&#x5982;&#x679C; URL &#x4E0D;&#x5305;&#x542B;&#x6240;&#x9700;&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x5219; getParameter &#x4F1A;&#x5F15;&#x53D1;&#x5F02;&#x5E38;&#x3002;</p>
</blockquote>
<p>When students in a software design class implemented such a server, many of them wrapped each distinct call to getParameter in a separate exception handler to catch NoSuchParameter exceptions, as in Figure 10.1. This resulted in a large number of handlers, all of which did essentially the same thing (generate an error response).</p>
<blockquote>
<p>&#x5F53;&#x53C2;&#x52A0;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x8BFE;&#x7A0B;&#x7684;&#x5B66;&#x751F;&#x5B9E;&#x73B0;&#x8FD9;&#x6837;&#x7684;&#x670D;&#x52A1;&#x5668;&#x65F6;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E2D;&#x7684;&#x8BB8;&#x591A;&#x4EBA;&#x5C06;&#x5BF9; getParameter &#x7684;&#x6BCF;&#x4E2A;&#x4E0D;&#x540C;&#x8C03;&#x7528;&#x5305;&#x88C5;&#x5728;&#x5355;&#x72EC;&#x7684;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x4E2D;&#x4EE5;&#x6355;&#x83B7; NoSuchParameter &#x5F02;&#x5E38;&#xFF0C;&#x5982;&#x56FE; 10.1 &#x6240;&#x793A;&#x3002;&#x8FD9;&#x5BFC;&#x81F4;&#x5927;&#x91CF;&#x7684;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#xFF0C;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x57FA;&#x672C;&#x4E0A;&#x90FD;&#x6267;&#x884C;&#x76F8;&#x540C;&#x7684;&#x64CD;&#x4F5C;&#xFF08;&#x751F;&#x6210;&#x9519;&#x8BEF;&#x54CD;&#x5E94;&#xFF09;&#x3002;</p>
</blockquote>
<p><img src="figures/00020.jpeg" alt=""></p>
<p>Figure 10.1: The code at the top dispatches to one of several methods in a Web server, each of which handles a particular URL. Each of those methods (bottom) uses parameters from the incoming HTTP request. In this figure, there is a separate exception handler for each call to getParameter; this results in duplicated code.</p>
<blockquote>
<p>&#x56FE; 10.1&#xFF1A;&#x9876;&#x90E8;&#x7684;&#x4EE3;&#x7801;&#x5C06;&#x5206;&#x6D3E;&#x7ED9; Web &#x670D;&#x52A1;&#x5668;&#x4E2D;&#x7684;&#x51E0;&#x79CD;&#x65B9;&#x6CD5;&#x4E4B;&#x4E00;&#xFF0C;&#x6BCF;&#x79CD;&#x65B9;&#x6CD5;&#x90FD;&#x5904;&#x7406;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x7684; URL&#x3002;&#x6BCF;&#x4E2A;&#x65B9;&#x6CD5;&#xFF08;&#x5E95;&#x90E8;&#xFF09;&#x90FD;&#x4F7F;&#x7528;&#x4F20;&#x5165; HTTP &#x8BF7;&#x6C42;&#x4E2D;&#x7684;&#x53C2;&#x6570;&#x3002;&#x5728;&#x6B64;&#x56FE;&#x4E2D;&#xFF0C;&#x6BCF;&#x4E2A;&#x5BF9; getParameter &#x7684;&#x8C03;&#x7528;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x3002;&#x8FD9;&#x5BFC;&#x81F4;&#x91CD;&#x590D;&#x7684;&#x4EE3;&#x7801;&#x3002;</p>
</blockquote>
<p>A better approach is to aggregate the exceptions. Instead of catching the exceptions in the individual service methods, let them propagate up to the top-level dispatch method for the Web server, as in Figure 10.2. A single handler in this method can catch all of the exceptions and generate an appropriate error response for missing parameters.</p>
<blockquote>
<p>&#x66F4;&#x597D;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x6C47;&#x603B;&#x5F02;&#x5E38;&#x3002;&#x8BA9;&#x5B83;&#x4EEC;&#x4F20;&#x64AD;&#x5230; Web &#x670D;&#x52A1;&#x5668;&#x7684;&#x9876;&#x7EA7;&#x8C03;&#x5EA6;&#x65B9;&#x6CD5;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5728;&#x5355;&#x4E2A;&#x670D;&#x52A1;&#x65B9;&#x6CD5;&#x4E2D;&#x6355;&#x83B7;&#x5F02;&#x5E38;&#xFF0C;&#x5982;&#x56FE; 10.2 &#x6240;&#x793A;&#x3002;&#x6B64;&#x65B9;&#x6CD5;&#x4E2D;&#x7684;&#x5355;&#x4E2A;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x6355;&#x83B7;&#x6240;&#x6709;&#x5F02;&#x5E38;&#xFF0C;&#x5E76;&#x4E3A;&#x4E22;&#x5931;&#x7684;&#x53C2;&#x6570;&#x751F;&#x6210;&#x9002;&#x5F53;&#x7684;&#x9519;&#x8BEF;&#x54CD;&#x5E94;&#x3002;</p>
</blockquote>
<p>The aggregation approach can be taken even further in the Web example. There are many other errors besides missing parameters that can occur while processing a Web page; for example, a parameter might not have the right syntax (the service method expected an integer, but the value was &#x201C;xyz&#x201D;), or the user might not have permission for the requested operation. In each case, the error should result in an error response; the errors differ only in the error message to include in the response (&#x201C;parameter &apos;quantity&apos; not present in URL&#x201D; or &#x201C;bad value &apos;xyz&apos; for &apos;quantity&apos; parameter; must be positive integer&#x201D;). Thus, all conditions resulting in an error response can be handled with a single top-level exception handler. The error message can be generated at the time the exception is thrown and included as a variable in the exception record; for example, getParameter will generate the &#x201C;parameter &apos;quantity&apos; not present in URL&#x201D; message. The top-level handler extracts the message from the exception and incorporates it into the error response.</p>
<blockquote>
<p>&#x5728; Web &#x793A;&#x4F8B;&#x4E2D;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x91C7;&#x7528;&#x805A;&#x5408;&#x65B9;&#x6CD5;&#x3002;&#x5904;&#x7406;&#x7F51;&#x9875;&#x65F6;&#xFF0C;&#x9664;&#x4E86;&#x7F3A;&#x5C11;&#x53C2;&#x6570;&#x5916;&#xFF0C;&#x8FD8;&#x6709;&#x8BB8;&#x591A;&#x5176;&#x4ED6;&#x9519;&#x8BEF;&#xFF1B;&#x4F8B;&#x5982;&#xFF0C;&#x53C2;&#x6570;&#x53EF;&#x80FD;&#x6CA1;&#x6709;&#x6B63;&#x786E;&#x7684;&#x8BED;&#x6CD5;&#xFF08;&#x670D;&#x52A1;&#x65B9;&#x6CD5;&#x5E94;&#x4E3A;&#x6574;&#x6570;&#xFF0C;&#x4F46;&#x503C;&#x4E3A;&#x201C; xyz&#x201D;&#xFF09;&#xFF0C;&#x6216;&#x8005;&#x7528;&#x6237;&#x53EF;&#x80FD;&#x65E0;&#x6743;&#x6267;&#x884C;&#x6240;&#x8BF7;&#x6C42;&#x7684;&#x64CD;&#x4F5C;&#x3002;&#x5728;&#x6BCF;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x9519;&#x8BEF;&#x90FD;&#x5E94;&#x5BFC;&#x81F4;&#x9519;&#x8BEF;&#x54CD;&#x5E94;&#x3002;&#x9519;&#x8BEF;&#x4EC5;&#x5728;&#x54CD;&#x5E94;&#x4E2D;&#x5305;&#x542B;&#x7684;&#x9519;&#x8BEF;&#x6D88;&#x606F;&#x4E2D;&#x6709;&#x6240;&#x4E0D;&#x540C;&#xFF08;&#x201C; URL &#x4E2D;&#x4E0D;&#x5B58;&#x5728;&#x53C2;&#x6570;&apos;&#x6570;&#x91CF;&apos;&#x201D;&#x6216;&#x201C;&apos;&#x6570;&#x91CF;&apos;&#x53C2;&#x6570;&#x7684;&#x9519;&#x8BEF;&#x503C;&apos;xyz&apos;&#xFF1B;&#x5FC5;&#x987B;&#x4E3A;&#x6B63;&#x6574;&#x6570;&#x201D;&#xFF09;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6240;&#x6709;&#x5BFC;&#x81F4;&#x9519;&#x8BEF;&#x54CD;&#x5E94;&#x7684;&#x6761;&#x4EF6;&#x90FD;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5355;&#x4E2A;&#x9876;&#x7EA7;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x8FDB;&#x884C;&#x5904;&#x7406;&#x3002;&#x9519;&#x8BEF;&#x6D88;&#x606F;&#x53EF;&#x4EE5;&#x5728;&#x5F15;&#x53D1;&#x5F02;&#x5E38;&#x65F6;&#x751F;&#x6210;&#xFF0C;&#x5E76;&#x4F5C;&#x4E3A;&#x53D8;&#x91CF;&#x5305;&#x542B;&#x5728;&#x5F02;&#x5E38;&#x8BB0;&#x5F55;&#x4E2D;&#x3002;&#x4F8B;&#x5982;&#xFF0C;getParameter &#x5C06;&#x751F;&#x6210;&#x201C; URL &#x4E2D;&#x4E0D;&#x5B58;&#x5728;&#x7684;&#x53C2;&#x6570;&apos;&#x6570;&#x91CF;&apos;&#x201D;&#x6D88;&#x606F;&#x3002;&#x9876;&#x7EA7;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x4ECE;&#x5F02;&#x5E38;&#x4E2D;&#x63D0;&#x53D6;&#x6D88;&#x606F;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x5408;&#x5E76;&#x5230;&#x9519;&#x8BEF;&#x54CD;&#x5E94;&#x4E2D;&#x3002;</p>
</blockquote>
<p><img src="figures/00021.jpeg" alt=""></p>
<p>Figure 10.2: This code is functionally equivalent to Figure 10.1, but exception handling has been aggregated: a single exception handler in the dispatcher catches all of the NoSuchParameter exceptions from all of the URL-specific methods.</p>
<blockquote>
<p>&#x56FE; 10.2&#xFF1A;&#x6B64;&#x4EE3;&#x7801;&#x5728;&#x529F;&#x80FD;&#x4E0A;&#x7B49;&#x6548;&#x4E8E;&#x56FE; 10.1&#xFF0C;&#x4F46;&#x662F;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x5DF2;&#x805A;&#x5408;&#xFF1A;&#x5206;&#x6D3E;&#x5668;&#x4E2D;&#x7684;&#x5355;&#x4E2A;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x4ECE;&#x6240;&#x6709;&#x7279;&#x5B9A;&#x4E8E; URL &#x7684;&#x65B9;&#x6CD5;&#x4E2D;&#x6355;&#x83B7;&#x6240;&#x6709; NoSuchParameter &#x5F02;&#x5E38;&#x3002;</p>
</blockquote>
<p>The aggregation described in the preceding paragraph has good properties from the standpoint of encapsulation and information hiding. The top-level exception handler encapsulates knowledge about how to generate error responses, but it knows nothing about specific errors; it just uses the error message provided in the exception. The getParameter method encapsulates knowledge about how to extract a parameter from a URL, and it also knows how to describe extraction errors in a human-readable form. These two pieces of information are closely related, so it makes sense for them to be in the same place. However, getParameter knows nothing about the syntax of an HTTP error response. As new functionality is added to the Web server, new methods like getParameter may be created with their own errors. If the new methods throw exceptions in the same way as getParameter (by generating exceptions that inherit from the same superclass and including an error message in each exception), they can plug into the existing system with no other changes: the top-level handler will automatically generate error responses for them.</p>
<blockquote>
<p>&#x4ECE;&#x5C01;&#x88C5;&#x548C;&#x4FE1;&#x606F;&#x9690;&#x85CF;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x4E0A;&#x4E00;&#x6BB5;&#x4E2D;&#x63CF;&#x8FF0;&#x7684;&#x805A;&#x5408;&#x5177;&#x6709;&#x826F;&#x597D;&#x7684;&#x5C5E;&#x6027;&#x3002;&#x9876;&#x7EA7;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x5C01;&#x88C5;&#x4E86;&#x6709;&#x5173;&#x5982;&#x4F55;&#x751F;&#x6210;&#x9519;&#x8BEF;&#x54CD;&#x5E94;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x4F46;&#x5BF9;&#x7279;&#x5B9A;&#x9519;&#x8BEF;&#x4E00;&#x65E0;&#x6240;&#x77E5;&#x3002;&#x5B83;&#x4EC5;&#x4F7F;&#x7528;&#x5F02;&#x5E38;&#x4E2D;&#x63D0;&#x4F9B;&#x7684;&#x9519;&#x8BEF;&#x6D88;&#x606F;&#x3002;getParameter &#x65B9;&#x6CD5;&#x5C01;&#x88C5;&#x4E86;&#x6709;&#x5173;&#x5982;&#x4F55;&#x4ECE; URL &#x63D0;&#x53D6;&#x53C2;&#x6570;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x5E76;&#x4E14;&#x8FD8;&#x77E5;&#x9053;&#x5982;&#x4F55;&#x4EE5;&#x4EBA;&#x7C7B;&#x53EF;&#x8BFB;&#x7684;&#x5F62;&#x5F0F;&#x63CF;&#x8FF0;&#x63D0;&#x53D6;&#x9519;&#x8BEF;&#x3002;&#x8FD9;&#x4E24;&#x4E2A;&#x4FE1;&#x606F;&#x5BC6;&#x5207;&#x76F8;&#x5173;&#xFF0C;&#x56E0;&#x6B64;&#x5C06;&#x5B83;&#x4EEC;&#x653E;&#x5728;&#x540C;&#x4E00;&#x4F4D;&#x7F6E;&#x662F;&#x5F88;&#x6709;&#x610F;&#x4E49;&#x7684;&#x3002;&#x4F46;&#x662F;&#xFF0C;getParameter &#x5BF9; HTTP &#x9519;&#x8BEF;&#x54CD;&#x5E94;&#x7684;&#x8BED;&#x6CD5;&#x4E00;&#x65E0;&#x6240;&#x77E5;&#x3002;&#x968F;&#x7740;&#x5411; Web &#x670D;&#x52A1;&#x5668;&#x4E2D;&#x6DFB;&#x52A0;&#x4E86;&#x65B0;&#x529F;&#x80FD;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x521B;&#x5EFA;&#x5177;&#x6709;&#x7C7B;&#x4F3C;&#x81EA;&#x8EAB;&#x9519;&#x8BEF;&#x7684;&#x65B0;&#x65B9;&#x6CD5;&#xFF0C;&#x5982; getParameter&#x3002;</p>
</blockquote>
<p>This example illustrates a generally-useful design pattern for exception handling. If a system processes a series of requests, it&#x2019;s useful to define an exception that aborts the current request, cleans up the system&#x2019;s state, and continues with the next request. The exception is caught in a single place near the top of the system&#x2019;s request-handling loop. This exception can be thrown at any point in the processing of a request to abort the request; different subclasses of the exception can be defined for different conditions. Exceptions of this type should be clearly distinguished from exceptions that are fatal to the entire system.</p>
<blockquote>
<p>&#x6B64;&#x793A;&#x4F8B;&#x8BF4;&#x660E;&#x4E86;&#x7528;&#x4E8E;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x7684;&#x901A;&#x7528;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x3002;&#x5982;&#x679C;&#x7CFB;&#x7EDF;&#x5904;&#x7406;&#x4E00;&#x7CFB;&#x5217;&#x8BF7;&#x6C42;&#xFF0C;&#x5219;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x5F02;&#x5E38;&#x4EE5;&#x4E2D;&#x6B62;&#x5F53;&#x524D;&#x8BF7;&#x6C42;&#xFF0C;&#x6E05;&#x9664;&#x7CFB;&#x7EDF;&#x72B6;&#x6001;&#x5E76;&#x7EE7;&#x7EED;&#x4E0B;&#x4E00;&#x4E2A;&#x8BF7;&#x6C42;&#x975E;&#x5E38;&#x6709;&#x7528;&#x3002;&#x5F02;&#x5E38;&#x88AB;&#x6355;&#x83B7;&#x5728;&#x7CFB;&#x7EDF;&#x8BF7;&#x6C42;&#x5904;&#x7406;&#x5FAA;&#x73AF;&#x9876;&#x90E8;&#x9644;&#x8FD1;&#x7684;&#x5355;&#x4E2A;&#x4F4D;&#x7F6E;&#x3002;&#x5728;&#x5904;&#x7406;&#x4E2D;&#x6B62;&#x8BF7;&#x6C42;&#x7684;&#x4EFB;&#x4F55;&#x65F6;&#x5019;&#x90FD;&#x53EF;&#x4EE5;&#x629B;&#x51FA;&#x8BE5;&#x5F02;&#x5E38;&#x3002;&#x53EF;&#x4EE5;&#x4E3A;&#x4E0D;&#x540C;&#x7684;&#x6761;&#x4EF6;&#x5B9A;&#x4E49;&#x5F02;&#x5E38;&#x7684;&#x4E0D;&#x540C;&#x5B50;&#x7C7B;&#x3002;&#x5E94;&#x8BE5;&#x5C06;&#x8FD9;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x5F02;&#x5E38;&#x4E0E;&#x5BF9;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x81F4;&#x547D;&#x7684;&#x5F02;&#x5E38;&#x533A;&#x5206;&#x5F00;&#x6765;&#x3002;</p>
</blockquote>
<p>Exception aggregation works best if an exception propagates several levels up the stack before it is handled; this allows more exceptions from more methods to be handled in the same place. This is the opposite of exception masking: masking usually works best if an exception is handled in a low-level method. For masking, the low-level method is typically a library method used by many other methods, so allowing the exception to propagate would increase the number of places where it is handled. Masking and aggregation are similar in that both approaches position an exception handler where it can catch the most exceptions, eliminating many handlers that would otherwise need to be created.</p>
<blockquote>
<p>&#x5982;&#x679C;&#x5F02;&#x5E38;&#x5728;&#x5904;&#x7406;&#x4E4B;&#x524D;&#x5728;&#x5806;&#x6808;&#x4E2D;&#x4F20;&#x64AD;&#x4E86;&#x591A;&#x4E2A;&#x7EA7;&#x522B;&#xFF0C;&#x5219;&#x5F02;&#x5E38;&#x805A;&#x96C6;&#x6700;&#x6709;&#x6548;&#x3002;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x5728;&#x540C;&#x4E00;&#x4F4D;&#x7F6E;&#x5904;&#x7406;&#x66F4;&#x591A;&#x65B9;&#x6CD5;&#x7684;&#x66F4;&#x591A;&#x5F02;&#x5E38;&#x3002;&#x8FD9;&#x4E0E;&#x5F02;&#x5E38;&#x5C4F;&#x853D;&#x76F8;&#x53CD;&#xFF1A;&#x5982;&#x679C;&#x4F7F;&#x7528;&#x4F4E;&#x7EA7;&#x65B9;&#x6CD5;&#x5904;&#x7406;&#x5F02;&#x5E38;&#xFF0C;&#x5219;&#x5C4F;&#x853D;&#x901A;&#x5E38;&#x6548;&#x679C;&#x6700;&#x597D;&#x3002;&#x5BF9;&#x4E8E;&#x5C4F;&#x853D;&#xFF0C;&#x4F4E;&#x7EA7;&#x65B9;&#x6CD5;&#x901A;&#x5E38;&#x662F;&#x8BB8;&#x591A;&#x5176;&#x4ED6;&#x65B9;&#x6CD5;&#x4F7F;&#x7528;&#x7684;&#x5E93;&#x65B9;&#x6CD5;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x5141;&#x8BB8;&#x4F20;&#x64AD;&#x5F02;&#x5E38;&#x4F1A;&#x589E;&#x52A0;&#x5904;&#x7406;&#x8BE5;&#x5F02;&#x5E38;&#x7684;&#x4F4D;&#x7F6E;&#x6570;&#x3002;&#x63A9;&#x7801;&#x548C;&#x805A;&#x5408;&#x7684;&#x76F8;&#x4F3C;&#x4E4B;&#x5904;&#x5728;&#x4E8E;&#xFF0C;&#x8FD9;&#x4E24;&#x79CD;&#x65B9;&#x6CD5;&#x90FD;&#x5C06;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x7F6E;&#x4E8E;&#x53EF;&#x4EE5;&#x6355;&#x83B7;&#x6700;&#x591A;&#x5F02;&#x5E38;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x4ECE;&#x800C;&#x6D88;&#x9664;&#x4E86;&#x8BB8;&#x591A;&#x672C;&#x6765;&#x9700;&#x8981;&#x521B;&#x5EFA;&#x7684;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x3002;</p>
</blockquote>
<p>Another example of exception aggregation occurs in the RAMCloud storage system for crash recovery. A RAMCloud system consists of a collection of storage servers that keep multiple copies of each object, so the system can recover from a variety of failures. For example, if a server crashes and loses all of its data, RAMCloud reconstructs the lost data using copies stored on other servers. Errors can also happen on a smaller scale; for example, a server may discover that an individual object is corrupted.</p>
<blockquote>
<p>RAMCloud &#x5B58;&#x50A8;&#x7CFB;&#x7EDF;&#x4E2D;&#x53D1;&#x751F;&#x5F02;&#x5E38;&#x805A;&#x96C6;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x793A;&#x4F8B;&#x662F;&#x5D29;&#x6E83;&#x6062;&#x590D;&#x3002;RAMCloud &#x7CFB;&#x7EDF;&#x7531;&#x4E00;&#x7EC4;&#x5B58;&#x50A8;&#x670D;&#x52A1;&#x5668;&#x7EC4;&#x6210;&#xFF0C;&#x8FD9;&#x4E9B;&#x5B58;&#x50A8;&#x670D;&#x52A1;&#x5668;&#x4FDD;&#x7559;&#x6BCF;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x591A;&#x4E2A;&#x526F;&#x672C;&#xFF0C;&#x56E0;&#x6B64;&#x7CFB;&#x7EDF;&#x53EF;&#x4EE5;&#x4ECE;&#x5404;&#x79CD;&#x6545;&#x969C;&#x4E2D;&#x6062;&#x590D;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x670D;&#x52A1;&#x5668;&#x5D29;&#x6E83;&#x5E76;&#x4E22;&#x5931;&#x5176;&#x6240;&#x6709;&#x6570;&#x636E;&#xFF0C;RAMCloud &#x4F1A;&#x4F7F;&#x7528;&#x5B58;&#x50A8;&#x5728;&#x5176;&#x4ED6;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x7684;&#x526F;&#x672C;&#x6765;&#x91CD;&#x5EFA;&#x4E22;&#x5931;&#x7684;&#x6570;&#x636E;&#x3002;&#x9519;&#x8BEF;&#x4E5F;&#x53EF;&#x80FD;&#x5728;&#x8F83;&#x5C0F;&#x7684;&#x8303;&#x56F4;&#x5185;&#x53D1;&#x751F;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x53EF;&#x80FD;&#x53D1;&#x73B0;&#x5355;&#x4E2A;&#x5BF9;&#x8C61;&#x5DF2;&#x635F;&#x574F;&#x3002;</p>
</blockquote>
<p>RAMCloud does not have separate recovery mechanisms for each different kind of error. Instead, RAMCloud &#x201C;promotes&#x201D; many smaller errors into larger ones. RAMCloud could, in principle, handle a corrupted object by restoring that one object from a backup copy. However, it doesn&#x2019;t do this. Instead, if it discovers a corrupted object it crashes the server containing the object. RAMCloud uses this approach because crash recovery is quite complex and this approach minimized the number of different recovery mechanisms that had to be created. Creating a recovery mechanism for crashed servers was unavoidable, so RAMCloud uses the same mechanism for other kinds of recovery as well. This reduced the amount of code that had to be written, and it also meant that server crash recovery gets invoked more often. As a result, bugs in recovery are more likely to be discovered and fixed.</p>
<blockquote>
<p>&#x5BF9;&#x4E8E;&#x6BCF;&#x79CD;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x9519;&#x8BEF;&#xFF0C;RAMCloud &#x6CA1;&#x6709;&#x5355;&#x72EC;&#x7684;&#x6062;&#x590D;&#x673A;&#x5236;&#x3002;&#x76F8;&#x53CD;&#xFF0C;RAMCloud &#x5C06;&#x8BB8;&#x591A;&#x8F83;&#x5C0F;&#x7684;&#x9519;&#x8BEF;&#x201C;&#x63D0;&#x5347;&#x201D;&#x4E3A;&#x8F83;&#x5927;&#x7684;&#x9519;&#x8BEF;&#x3002;&#x539F;&#x5219;&#x4E0A;&#xFF0C;RAMCloud &#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4ECE;&#x5907;&#x4EFD;&#x526F;&#x672C;&#x4E2D;&#x6062;&#x590D;&#x4E00;&#x4E2A;&#x635F;&#x574F;&#x7684;&#x5BF9;&#x8C61;&#x6765;&#x5904;&#x7406;&#x8FD9;&#x4E2A;&#x635F;&#x574F;&#x7684;&#x5BF9;&#x8C61;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5B83;&#x5E76;&#x4E0D;&#x8FD9;&#x6837;&#x505A;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x5982;&#x679C;&#x5B83;&#x53D1;&#x73B0;&#x4E00;&#x4E2A;&#x635F;&#x574F;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x5B83;&#x4F1A;&#x4F7F;&#x5305;&#x542B;&#x8BE5;&#x5BF9;&#x8C61;&#x7684;&#x670D;&#x52A1;&#x5668;&#x5D29;&#x6E83;&#x3002;RAMCloud &#x4F7F;&#x7528;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x56E0;&#x4E3A;&#x5D29;&#x6E83;&#x6062;&#x590D;&#x975E;&#x5E38;&#x590D;&#x6742;&#xFF0C;&#x800C;&#x4E14;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x6700;&#x5C0F;&#x5316;&#x4E86;&#x5FC5;&#x987B;&#x521B;&#x5EFA;&#x7684;&#x4E0D;&#x540C;&#x6062;&#x590D;&#x673A;&#x5236;&#x7684;&#x6570;&#x91CF;&#x3002;&#x4E3A;&#x5D29;&#x6E83;&#x7684;&#x670D;&#x52A1;&#x5668;&#x521B;&#x5EFA;&#x6062;&#x590D;&#x673A;&#x5236;&#x662F;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#x7684;&#xFF0C;&#x56E0;&#x6B64; RAMCloud &#x5BF9;&#x5176;&#x4ED6;&#x7C7B;&#x578B;&#x7684;&#x6062;&#x590D;&#x4E5F;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x7684;&#x673A;&#x5236;&#x3002;&#x8FD9;&#x51CF;&#x5C11;&#x4E86;&#x5FC5;&#x987B;&#x7F16;&#x5199;&#x7684;&#x4EE3;&#x7801;&#x91CF;&#xFF0C;&#x800C;&#x4E14;&#x8FD9;&#x8FD8;&#x610F;&#x5473;&#x7740;&#x670D;&#x52A1;&#x5668;&#x5D29;&#x6E83;&#x6062;&#x590D;&#x5C06;&#x66F4;&#x9891;&#x7E41;&#x5730;&#x88AB;&#x8C03;&#x7528;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6062;&#x590D;&#x4E2D;&#x7684; bug &#x66F4;&#x6709;&#x53EF;&#x80FD;&#x88AB;&#x53D1;&#x73B0;&#x548C;&#x4FEE;&#x590D;&#x3002;</p>
</blockquote>
<p>One disadvantage of promoting a corrupted object into a server crash is that it increases the cost of recovery considerably. This is not a problem in RAMCloud, since object corruption is quite rare. However, error promotion may not make sense for errors that happen frequently. As one example, it would not be practical to crash a server anytime one of its network packets is lost.</p>
<blockquote>
<p>&#x5C06;&#x635F;&#x574F;&#x7684;&#x5BF9;&#x8C61;&#x5347;&#x7EA7;&#x4E3A;&#x670D;&#x52A1;&#x5668;&#x5D29;&#x6E83;&#x7684;&#x4E00;&#x4E2A;&#x7F3A;&#x70B9;&#x662F;&#xFF0C;&#x5B83;&#x5927;&#x5927;&#x589E;&#x52A0;&#x4E86;&#x6062;&#x590D;&#x6210;&#x672C;&#x3002;&#x8FD9;&#x5728; RAMCloud &#x4E2D;&#x4E0D;&#x662F;&#x95EE;&#x9898;&#xFF0C;&#x56E0;&#x4E3A;&#x5BF9;&#x8C61;&#x635F;&#x574F;&#x975E;&#x5E38;&#x7F55;&#x89C1;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x9519;&#x8BEF;&#x5347;&#x7EA7;&#x5BF9;&#x4E8E;&#x7ECF;&#x5E38;&#x53D1;&#x751F;&#x7684;&#x9519;&#x8BEF;&#x53EF;&#x80FD;&#x6CA1;&#x6709;&#x610F;&#x4E49;&#x3002;&#x4E3E;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x5728;&#x670D;&#x52A1;&#x5668;&#x7684;&#x4EFB;&#x4F55;&#x7F51;&#x7EDC;&#x6570;&#x636E;&#x5305;&#x4E22;&#x5931;&#x65F6;&#x4F7F;&#x670D;&#x52A1;&#x5668;&#x5D29;&#x6E83;&#x662F;&#x4E0D;&#x5207;&#x5B9E;&#x9645;&#x7684;&#x3002;</p>
</blockquote>
<p>One way of thinking about exception aggregation is that it replaces several special-purpose mechanisms, each tailored for a particular situation, with a single general-purpose mechanism that can handle multiple situations. This provides another illustration of the benefits of general-purpose mechanisms.</p>
<blockquote>
<p>&#x8003;&#x8651;&#x5F02;&#x5E38;&#x805A;&#x5408;&#x7684;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#xFF0C;&#x5B83;&#x7528;&#x53EF;&#x4EE5;&#x5904;&#x7406;&#x591A;&#x79CD;&#x60C5;&#x51B5;&#x7684;&#x5355;&#x4E2A;&#x901A;&#x7528;&#x673A;&#x5236;&#x66FF;&#x6362;&#x4E86;&#x51E0;&#x79CD;&#x9488;&#x5BF9;&#x7279;&#x5B9A;&#x60C5;&#x51B5;&#x800C;&#x91CF;&#x8EAB;&#x5B9A;&#x5236;&#x7684;&#x7279;&#x6B8A;&#x7528;&#x9014;&#x7684;&#x673A;&#x5236;&#x3002;&#x8FD9;&#x518D;&#x6B21;&#x8BF4;&#x660E;&#x4E86;&#x901A;&#x7528;&#x673A;&#x5236;&#x7684;&#x597D;&#x5904;&#x3002;</p>
</blockquote>
<h2 id="108-just-crash-&#x5D29;&#x6E83;&#x4E86;&#x5417;&#xFF1F;">10.8 Just crash? &#x5D29;&#x6E83;&#x4E86;&#x5417;&#xFF1F;</h2>
<p>The fourth technique for reducing complexity related to exception handling is to crash the application. In most applications there will be certain errors that it&#x2019;s not worth trying to handle. Typically, these errors are difficult or impossible to handle and don&#x2019;t occur very often. The simplest thing to do in response to these errors is to print diagnostic information and then abort the application.</p>
<blockquote>
<p>&#x51CF;&#x5C11;&#x4E0E;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x76F8;&#x5173;&#x7684;&#x590D;&#x6742;&#x6027;&#x7684;&#x7B2C;&#x56DB;&#x79CD;&#x6280;&#x672F;&#x662F;&#x4F7F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5D29;&#x6E83;&#x3002;&#x5728;&#x5927;&#x591A;&#x6570;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#xFF0C;&#x6709;&#x4E9B;&#x9519;&#x8BEF;&#x662F;&#x4E0D;&#x503C;&#x5F97;&#x5C1D;&#x8BD5;&#x7684;&#x3002;&#x901A;&#x5E38;&#xFF0C;&#x8FD9;&#x4E9B;&#x9519;&#x8BEF;&#x5F88;&#x96BE;&#x6216;&#x4E0D;&#x53EF;&#x80FD;&#x5904;&#x7406;&#xFF0C;&#x800C;&#x4E14;&#x5F88;&#x5C11;&#x53D1;&#x751F;&#x3002;&#x9488;&#x5BF9;&#x8FD9;&#x4E9B;&#x9519;&#x8BEF;&#x7684;&#x6700;&#x7B80;&#x5355;&#x7684;&#x64CD;&#x4F5C;&#x662F;&#x6253;&#x5370;&#x8BCA;&#x65AD;&#x4FE1;&#x606F;&#xFF0C;&#x7136;&#x540E;&#x4E2D;&#x6B62;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;</p>
</blockquote>
<p>One example is &#x201C;out of memory&#x201D; errors that occur during storage allocation. Consider the malloc function in C, which returns NULL if it cannot allocate the desired block of memory. This is an unfortunate behavior, because it assumes that every single caller of malloc will check the return value and take appropriate action if there is no memory. Applications contain numerous calls to malloc, so checking the result after each call would add significant complexity. If a programmer forgets the check (which is fairly likely), then the application will dereference a null pointer if memory runs out, resulting in a crash that camouflages the real problem.</p>
<blockquote>
<p>&#x4E00;&#x4E2A;&#x793A;&#x4F8B;&#x662F;&#x5728;&#x5B58;&#x50A8;&#x5206;&#x914D;&#x671F;&#x95F4;&#x53D1;&#x751F;&#x7684;&#x201C;&#x5185;&#x5B58;&#x4E0D;&#x8DB3;&#x201D;&#x9519;&#x8BEF;&#x3002;&#x8003;&#x8651;&#x4E00;&#x4E0B; C &#x8BED;&#x8A00;&#x4E2D;&#x7684; malloc &#x51FD;&#x6570;&#xFF0C;&#x5982;&#x679C;&#x5B83;&#x65E0;&#x6CD5;&#x5206;&#x914D;&#x6240;&#x9700;&#x7684;&#x5185;&#x5B58;&#x5757;&#xFF0C;&#x5219;&#x8BE5;&#x51FD;&#x6570;&#x5C06;&#x8FD4;&#x56DE; NULL&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x4E0D;&#x5E78;&#x7684;&#x884C;&#x4E3A;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x5047;&#x5B9A; malloc &#x7684;&#x6BCF;&#x4E2A;&#x8C03;&#x7528;&#x8005;&#x90FD;&#x5C06;&#x68C0;&#x67E5;&#x8FD4;&#x56DE;&#x503C;&#x5E76;&#x5728;&#x6CA1;&#x6709;&#x5185;&#x5B58;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x91C7;&#x53D6;&#x9002;&#x5F53;&#x7684;&#x63AA;&#x65BD;&#x3002;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5305;&#x542B;&#x8BB8;&#x591A;&#x5BF9; malloc &#x7684;&#x8C03;&#x7528;&#xFF0C;&#x56E0;&#x6B64;&#x5728;&#x6BCF;&#x6B21;&#x8C03;&#x7528;&#x540E;&#x68C0;&#x67E5;&#x7ED3;&#x679C;&#x5C06;&#x589E;&#x52A0;&#x76F8;&#x5F53;&#x5927;&#x7684;&#x590D;&#x6742;&#x6027;&#x3002;&#x5982;&#x679C;&#x7A0B;&#x5E8F;&#x5458;&#x5FD8;&#x8BB0;&#x4E86;&#x68C0;&#x67E5;&#xFF08;&#x8FD9;&#x5F88;&#x6709;&#x53EF;&#x80FD;&#xFF09;&#xFF0C;&#x90A3;&#x4E48;&#x5982;&#x679C;&#x5185;&#x5B58;&#x7528;&#x5B8C;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5C06;&#x53D6;&#x6D88;&#x5F15;&#x7528;&#x7A7A;&#x6307;&#x9488;&#xFF0C;&#x4ECE;&#x800C;&#x5BFC;&#x81F4;&#x5D29;&#x6E83;&#xFF0C;&#x4ECE;&#x800C;&#x63A9;&#x76D6;&#x4E86;&#x5B9E;&#x9645;&#x95EE;&#x9898;&#x3002;</p>
</blockquote>
<p>Furthermore, there isn&#x2019;t much an application can do when it discovers that memory is exhausted. In principle the application could look for unneeded memory to free, but if the application had unneeded memory it could already have freed it, which would have prevented the out-of-memory error in the first place. Today&#x2019;s systems have so much memory that memory almost never runs out; if it does, it usually indicates a bug in the application. Thus, it rarely make sense to try to handle out-of-memory errors; this creates too much complexity for too little benefit.</p>
<blockquote>
<p>&#x6B64;&#x5916;&#xFF0C;&#x5F53;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53D1;&#x73B0;&#x5185;&#x5B58;&#x5DF2;&#x7528;&#x5B8C;&#x65F6;&#xFF0C;&#x5B83;&#x65E0;&#x80FD;&#x4E3A;&#x529B;&#x3002;&#x539F;&#x5219;&#x4E0A;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x5BFB;&#x627E;&#x4E0D;&#x9700;&#x8981;&#x7684;&#x5185;&#x5B58;&#x4EE5;&#x91CA;&#x653E;&#x5B83;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6709;&#x4E0D;&#x9700;&#x8981;&#x7684;&#x5185;&#x5B58;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x5DF2;&#x7ECF;&#x91CA;&#x653E;&#x5B83;&#xFF0C;&#x8FD9;&#x9996;&#x5148;&#x53EF;&#x4EE5;&#x9632;&#x6B62;&#x5185;&#x5B58;&#x4E0D;&#x8DB3;&#x9519;&#x8BEF;&#x3002;&#x5F53;&#x4ECA;&#x7684;&#x7CFB;&#x7EDF;&#x5177;&#x6709;&#x5982;&#x6B64;&#x5927;&#x7684;&#x5185;&#x5B58;&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;&#x5185;&#x5B58;&#x51E0;&#x4E4E;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x8017;&#x5C3D;&#x3002;&#x5982;&#x679C;&#x662F;&#x8FD9;&#x6837;&#xFF0C;&#x901A;&#x5E38;&#x8868;&#x660E;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x5B58;&#x5728;&#x9519;&#x8BEF;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5C1D;&#x8BD5;&#x5904;&#x7406;&#x5185;&#x5B58;&#x4E0D;&#x8DB3;&#x9519;&#x8BEF;&#x51E0;&#x4E4E;&#x6CA1;&#x6709;&#x9053;&#x7406;&#x3002;&#x8FD9;&#x4F1A;&#x5E26;&#x6765;&#x592A;&#x591A;&#x7684;&#x590D;&#x6742;&#x6027;&#xFF0C;&#x800C;&#x5E26;&#x6765;&#x7684;&#x6536;&#x76CA;&#x5374;&#x592A;&#x5C11;&#x3002;</p>
</blockquote>
<p>A better approach is to define a new method ckalloc, which calls malloc, checks the result, and aborts the application with an error message if memory is exhausted. The application never invokes malloc directly; it always invokes ckalloc.</p>
<blockquote>
<p>&#x66F4;&#x597D;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x65B0;&#x7684; ckalloc &#x65B9;&#x6CD5;&#xFF0C;&#x8BE5;&#x65B9;&#x6CD5;&#x8C03;&#x7528; malloc&#xFF0C;&#x68C0;&#x67E5;&#x7ED3;&#x679C;&#xFF0C;&#x5E76;&#x5728;&#x5185;&#x5B58;&#x8017;&#x5C3D;&#x65F6;&#x901A;&#x8FC7;&#x9519;&#x8BEF;&#x6D88;&#x606F;&#x4E2D;&#x6B62;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;&#x8BE5;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4ECE;&#x4E0D;&#x76F4;&#x63A5;&#x8C03;&#x7528; malloc&#x3002;&#x5B83;&#x603B;&#x662F;&#x8C03;&#x7528; ckalloc&#x3002;</p>
</blockquote>
<p>In newer languages such as C++ and Java, the new operator throws an exception if memory is exhausted. There&#x2019;s not much point in catching this exception, since there&#x2019;s a good chance that the exception handler will also try to allocate memory, which will also fail. Dynamically allocated memory is such a fundamental element of any modern application that it doesn&#x2019;t make sense for the application to continue if memory is exhausted; it&#x2019;s better to crash as soon as the error is detected.</p>
<blockquote>
<p>&#x5728;&#x8F83;&#x65B0;&#x7684;&#x8BED;&#x8A00;&#xFF08;&#x4F8B;&#x5982; C ++&#x548C; Java&#xFF09;&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x5185;&#x5B58;&#x8017;&#x5C3D;&#xFF0C;&#x5219; new &#x8FD0;&#x7B97;&#x7B26;&#x5C06;&#x5F15;&#x53D1;&#x5F02;&#x5E38;&#x3002;&#x6355;&#x83B7;&#x6B64;&#x5F02;&#x5E38;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x610F;&#x4E49;&#xFF0C;&#x56E0;&#x4E3A;&#x5F02;&#x5E38;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x5F88;&#x6709;&#x53EF;&#x80FD;&#x8FD8;&#x4F1A;&#x5C1D;&#x8BD5;&#x5206;&#x914D;&#x5185;&#x5B58;&#xFF0C;&#x8FD9;&#x4E5F;&#x4F1A;&#x5931;&#x8D25;&#x3002;&#x52A8;&#x6001;&#x5206;&#x914D;&#x7684;&#x5185;&#x5B58;&#x662F;&#x4EFB;&#x4F55;&#x73B0;&#x4EE3;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;&#x57FA;&#x672C;&#x5143;&#x7D20;&#xFF0C;&#x5982;&#x679C;&#x5185;&#x5B58;&#x8017;&#x5C3D;&#xFF0C;&#x5219;&#x7EE7;&#x7EED;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x662F;&#x6CA1;&#x6709;&#x610F;&#x4E49;&#x7684;&#x3002;&#x6700;&#x597D;&#x5728;&#x68C0;&#x6D4B;&#x5230;&#x9519;&#x8BEF;&#x540E;&#x7ACB;&#x5373;&#x5D29;&#x6E83;&#x3002;</p>
</blockquote>
<p>There are many other examples of errors where crashing the application makes sense. For most programs, if an I/O error occurs while reading or writing an open file (such as a disk hard error), or if a network socket cannot be opened, there&#x2019;s not much the application can do to recover, so aborting with a clear error message is a sensible approach. These errors are infrequent, so they are unlikely to affect the overall usability of the application. Aborting with an error message is also appropriate if an application encounters an internal error such as an inconsistent data structure. Conditions like this probably indicate bugs in the program.</p>
<blockquote>
<p>&#x8FD8;&#x6709;&#x8BB8;&#x591A;&#x5176;&#x4ED6;&#x9519;&#x8BEF;&#x793A;&#x4F8B;&#xFF0C;&#x8FD9;&#x4E9B;&#x9519;&#x8BEF;&#x4F1A;&#x4F7F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5D29;&#x6E83;&#x5F88;&#x6709;&#x610F;&#x4E49;&#x3002;&#x5BF9;&#x4E8E;&#x5927;&#x591A;&#x6570;&#x7A0B;&#x5E8F;&#xFF0C;&#x5982;&#x679C;&#x5728;&#x8BFB;&#x53D6;&#x6216;&#x5199;&#x5165;&#x6253;&#x5F00;&#x7684;&#x6587;&#x4EF6;&#x65F6;&#x53D1;&#x751F; I/O &#x9519;&#x8BEF;&#xFF08;&#x4F8B;&#x5982;&#x78C1;&#x76D8;&#x786C;&#x9519;&#x8BEF;&#xFF09;&#xFF0C;&#x6216;&#x8005;&#x65E0;&#x6CD5;&#x6253;&#x5F00;&#x7F51;&#x7EDC;&#x5957;&#x63A5;&#x5B57;&#xFF0C;&#x5219;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x65E0;&#x6D4E;&#x4E8E;&#x4E8B;&#xFF0C;&#x56E0;&#x6B64;&#x4E2D;&#x6B62;&#x4E86;&#x64CD;&#x4F5C;&#x3002;&#x6E05;&#x9664;&#x9519;&#x8BEF;&#x6D88;&#x606F;&#x662F;&#x4E00;&#x79CD;&#x660E;&#x667A;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x8FD9;&#x4E9B;&#x9519;&#x8BEF;&#x5F88;&#x5C11;&#x53D1;&#x751F;&#xFF0C;&#x56E0;&#x6B64;&#x5B83;&#x4EEC;&#x4E0D;&#x592A;&#x53EF;&#x80FD;&#x5F71;&#x54CD;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x6574;&#x4F53;&#x53EF;&#x7528;&#x6027;&#x3002;&#x5982;&#x679C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x9047;&#x5230;&#x5185;&#x90E8;&#x9519;&#x8BEF;&#xFF08;&#x5982;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4E0D;&#x4E00;&#x81F4;&#xFF09;&#xFF0C;&#x5219;&#x9519;&#x8BEF;&#x6D88;&#x606F;&#x4E2D;&#x6B62;&#x4E5F;&#x662F;&#x5408;&#x9002;&#x7684;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x6761;&#x4EF6;&#x53EF;&#x80FD;&#x8868;&#x660E;&#x7A0B;&#x5E8F;&#x4E2D;&#x5B58;&#x5728;&#x9519;&#x8BEF;&#x3002;</p>
</blockquote>
<p>Whether or not it is acceptable to crash on a particular error depends on the application. For a replicated storage system, it isn&#x2019;t appropriate to abort on an I/O error. Instead, the system must use replicated data to recover any information that was lost. The recovery mechanisms will add considerable complexity to the program, but recovering lost data is an essential part of the value the system provides to its users.</p>
<blockquote>
<p>&#x5728;&#x7279;&#x5B9A;&#x9519;&#x8BEF;&#x4E0A;&#x5D29;&#x6E83;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x63A5;&#x53D7;&#x53D6;&#x51B3;&#x4E8E;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;&#x5BF9;&#x4E8E;&#x590D;&#x5236;&#x7684;&#x5B58;&#x50A8;&#x7CFB;&#x7EDF;&#xFF0C;&#x4E0D;&#x9002;&#x5408;&#x56E0; I/O &#x9519;&#x8BEF;&#x800C;&#x4E2D;&#x6B62;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x7CFB;&#x7EDF;&#x5FC5;&#x987B;&#x4F7F;&#x7528;&#x590D;&#x5236;&#x7684;&#x6570;&#x636E;&#x6765;&#x6062;&#x590D;&#x4E22;&#x5931;&#x7684;&#x4EFB;&#x4F55;&#x4FE1;&#x606F;&#x3002;&#x6062;&#x590D;&#x673A;&#x5236;&#x5C06;&#x7ED9;&#x7A0B;&#x5E8F;&#x589E;&#x52A0;&#x76F8;&#x5F53;&#x5927;&#x7684;&#x590D;&#x6742;&#x6027;&#xFF0C;&#x4F46;&#x662F;&#x6062;&#x590D;&#x4E22;&#x5931;&#x7684;&#x6570;&#x636E;&#x662F;&#x7CFB;&#x7EDF;&#x4E3A;&#x7528;&#x6237;&#x63D0;&#x4F9B;&#x7684;&#x4EF7;&#x503C;&#x7684;&#x91CD;&#x8981;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#x3002;</p>
</blockquote>
<h2 id="109-design-special-cases-out-of-existence-&#x8BBE;&#x8BA1;&#x7279;&#x6B8A;&#x60C5;&#x51B5;&#x4E0D;&#x5B58;&#x5728;">10.9 Design special cases out of existence &#x8BBE;&#x8BA1;&#x7279;&#x6B8A;&#x60C5;&#x51B5;&#x4E0D;&#x5B58;&#x5728;</h2>
<p>For the same reason that it makes sense to define errors out of existence, it also makes sense to define other special cases out of existence. Special cases can result in code that is riddled with if statements, which make the code hard to understand and lead to bugs. Thus, special cases should be eliminated wherever possible. The best way to do this is by designing the normal case in a way that automatically handles the special cases without any extra code.</p>
<blockquote>
<p>&#x51FA;&#x4E8E;&#x540C;&#x6837;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x5B9A;&#x4E49;&#x4E0D;&#x5B58;&#x5728;&#x7684;&#x9519;&#x8BEF;&#x662F;&#x6709;&#x610F;&#x4E49;&#x7684;&#xFF0C;&#x800C;&#x5B9A;&#x4E49;&#x5176;&#x4ED6;&#x4E0D;&#x5B58;&#x5728;&#x7684;&#x7279;&#x6B8A;&#x60C5;&#x51B5;&#x4E5F;&#x662F;&#x6709;&#x610F;&#x4E49;&#x7684;&#x3002;&#x7279;&#x6B8A;&#x60C5;&#x51B5;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x4EE3;&#x7801;&#x4E2D;&#x6DF7;&#x5165; if &#x8BED;&#x53E5;&#xFF0C;&#x8FD9;&#x4F7F;&#x4EE3;&#x7801;&#x96BE;&#x4EE5;&#x7406;&#x89E3;&#x5E76;&#x5BFC;&#x81F4;&#x9519;&#x8BEF;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5E94;&#x5C3D;&#x53EF;&#x80FD;&#x6D88;&#x9664;&#x7279;&#x6B8A;&#x60C5;&#x51B5;&#x3002;&#x505A;&#x5230;&#x8FD9;&#x4E00;&#x70B9;&#x7684;&#x6700;&#x4F73;&#x65B9;&#x6CD5;&#x662F;&#x8BBE;&#x8BA1;&#x4E00;&#x79CD;&#x666E;&#x901A;&#x60C5;&#x51B5;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x53EF;&#x4EE5;&#x81EA;&#x52A8;&#x5904;&#x7406;&#x7279;&#x6B8A;&#x60C5;&#x51B5;&#x800C;&#x65E0;&#x9700;&#x4EFB;&#x4F55;&#x989D;&#x5916;&#x7684;&#x4EE3;&#x7801;&#x3002;</p>
</blockquote>
<p>In the text editor project described in Chapter 6, students had to implement a mechanism for selecting text and copying or deleting the selection. Most students introduced a state variable in their selection implementation to indicate whether or not the selection exists. They probably chose this approach because there are times when no selection is visible on the screen, so it seemed natural to represent this notion in the implementation. However, this approach resulted in numerous checks to detect the &#x201C;no selection&#x201D; condition and handle it specially.</p>
<blockquote>
<p>&#x5728;&#x7B2C; 6 &#x7AE0;&#x4E2D;&#x63CF;&#x8FF0;&#x7684;&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;&#x9879;&#x76EE;&#x4E2D;&#xFF0C;&#x5B66;&#x751F;&#x5FC5;&#x987B;&#x5B9E;&#x73B0;&#x4E00;&#x79CD;&#x9009;&#x62E9;&#x6587;&#x672C;&#x4EE5;&#x53CA;&#x590D;&#x5236;&#x6216;&#x5220;&#x9664;&#x6240;&#x9009;&#x5185;&#x5BB9;&#x7684;&#x673A;&#x5236;&#x3002;&#x5927;&#x591A;&#x6570;&#x5B66;&#x751F;&#x5728;&#x4ED6;&#x4EEC;&#x7684;&#x9009;&#x62E9;&#x5B9E;&#x73B0;&#x4E2D;&#x5F15;&#x5165;&#x4E86;&#x72B6;&#x6001;&#x53D8;&#x91CF;&#xFF0C;&#x4EE5;&#x8868;&#x660E;&#x9009;&#x62E9;&#x662F;&#x5426;&#x5B58;&#x5728;&#x3002;&#x4ED6;&#x4EEC;&#x4E4B;&#x6240;&#x4EE5;&#x9009;&#x62E9;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x6709;&#x65F6;&#x5C4F;&#x5E55;&#x4E0A;&#x770B;&#x4E0D;&#x5230;&#x4EFB;&#x4F55;&#x9009;&#x62E9;&#xFF0C;&#x56E0;&#x6B64;&#x5728;&#x5B9E;&#x73B0;&#x4E2D;&#x4F3C;&#x4E4E;&#x5F88;&#x81EA;&#x7136;&#x5730;&#x4EE3;&#x8868;&#x4E86;&#x8FD9;&#x4E00;&#x6982;&#x5FF5;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x5BFC;&#x81F4;&#x5927;&#x91CF;&#x68C0;&#x67E5;&#x4EE5;&#x68C0;&#x6D4B;&#x201C;&#x65E0;&#x9009;&#x62E9;&#x201D;&#x6761;&#x4EF6;&#x5E76;&#x8FDB;&#x884C;&#x7279;&#x6B8A;&#x5904;&#x7406;&#x3002;</p>
</blockquote>
<p>The selection handling code can be simplified by eliminating the &#x201C;no selection&#x201D; special case, so that the selection always exists. When there is no selection visible on the screen, it can be represented internally with an empty selection, whose starting and ending positions are the same. With this approach, the selection management code can be written without any checks for &#x201C;no selection&#x201D;. When copying the selection, if the selection is empty then 0 bytes will be inserted at the new location (if implemented correctly, there will be no need to check for 0 bytes as a special case). Similarly, it should be possible to design the code for deleting the selection so that the empty case is handled without any special-case checks. Consider a selection all on a single line. To delete the selection, extract the portion of the line preceding the selection and concatenate it with the portion of the line following the selection to form the new line. If the selection is empty, this approach will regenerate the original line.</p>
<blockquote>
<p>&#x901A;&#x8FC7;&#x6D88;&#x9664;&#x201C;&#x4E0D;&#x9009;&#x62E9;&#x201D;&#x7684;&#x7279;&#x6B8A;&#x60C5;&#x51B5;&#xFF0C;&#x53EF;&#x4EE5;&#x7B80;&#x5316;&#x9009;&#x62E9;&#x5904;&#x7406;&#x4EE3;&#x7801;&#xFF0C;&#x4ECE;&#x800C;&#x4F7F;&#x9009;&#x62E9;&#x59CB;&#x7EC8;&#x5B58;&#x5728;&#x3002;&#x5F53;&#x5C4F;&#x5E55;&#x4E0A;&#x6CA1;&#x6709;&#x53EF;&#x89C1;&#x7684;&#x9009;&#x62E9;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x5185;&#x90E8;&#x7528;&#x7A7A;&#x7684;&#x9009;&#x62E9;&#x8868;&#x793A;&#xFF0C;&#x5176;&#x5F00;&#x59CB;&#x548C;&#x7ED3;&#x675F;&#x4F4D;&#x7F6E;&#x76F8;&#x540C;&#x3002;&#x4F7F;&#x7528;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#xFF0C;&#x53EF;&#x4EE5;&#x7F16;&#x5199;&#x9009;&#x62E9;&#x7BA1;&#x7406;&#x4EE3;&#x7801;&#xFF0C;&#x800C;&#x65E0;&#x9700;&#x5BF9;&#x201C;&#x4E0D;&#x9009;&#x62E9;&#x201D;&#x8FDB;&#x884C;&#x4EFB;&#x4F55;&#x68C0;&#x67E5;&#x3002;&#x590D;&#x5236;&#x6240;&#x9009;&#x5185;&#x5BB9;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x6240;&#x9009;&#x5185;&#x5BB9;&#x4E3A;&#x7A7A;&#xFF0C;&#x5219;&#x5C06;&#x5728;&#x65B0;&#x4F4D;&#x7F6E;&#x63D2;&#x5165; 0 &#x5B57;&#x8282;&#xFF08;&#x5982;&#x679C;&#x6B63;&#x786E;&#x5B9E;&#x73B0;&#xFF0C;&#x5219;&#x5728;&#x7279;&#x6B8A;&#x60C5;&#x51B5;&#x4E0B;&#x65E0;&#x9700;&#x68C0;&#x67E5; 0 &#x5B57;&#x8282;&#xFF09;&#x3002;&#x540C;&#x6837;&#xFF0C;&#x5E94;&#x8BE5;&#x6709;&#x53EF;&#x80FD;&#x8BBE;&#x8BA1;&#x7528;&#x4E8E;&#x5220;&#x9664;&#x9009;&#x62E9;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x4EE5;&#x4FBF;&#x65E0;&#x9700;&#x4EFB;&#x4F55;&#x7279;&#x6B8A;&#x60C5;&#x51B5;&#x68C0;&#x67E5;&#x5C31;&#x53EF;&#x4EE5;&#x5904;&#x7406;&#x7A7A;&#x60C5;&#x51B5;&#x3002;&#x5728;&#x4E00;&#x884C;&#x4E0A;&#x8003;&#x8651;&#x6240;&#x6709;&#x9009;&#x62E9;&#x3002;&#x8981;&#x5220;&#x9664;&#x9009;&#x62E9;&#xFF0C;&#x63D0;&#x53D6;&#x9009;&#x62E9;&#x4E4B;&#x524D;&#x7684;&#x884C;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x4E0E;&#x9009;&#x62E9;&#x4E4B;&#x540E;&#x7684;&#x884C;&#x7684;&#x90E8;&#x5206;&#x8FDE;&#x63A5;&#x8D77;&#x6765;&#x4EE5;&#x5F62;&#x6210;&#x65B0;&#x884C;&#x3002;&#x5982;&#x679C;&#x9009;&#x62E9;&#x4E3A;&#x7A7A;&#xFF0C;&#x5219;&#x6B64;&#x65B9;&#x6CD5;&#x5C06;&#x91CD;&#x65B0;&#x751F;&#x6210;&#x539F;&#x59CB;&#x884C;&#x3002;</p>
</blockquote>
<p>This example also illustrates the &#x201C;different layer, different abstraction&#x201D; idea from Chapter 7. The notion of &#x201C;no selection&#x201D; makes sense in terms of how the user thinks about the application&#x2019;s interface, but that doesn&#x2019;t mean it has to be represented explicitly inside the application. Having a selection that always exists, but is sometimes empty and thus invisible, results in a simpler implementation.</p>
<blockquote>
<p>&#x6B64;&#x793A;&#x4F8B;&#x8FD8;&#x8BF4;&#x660E;&#x4E86;&#x7B2C; 7 &#x7AE0;&#x4E2D;&#x7684;&#x201C;&#x4E0D;&#x540C;&#x7684;&#x5C42;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x62BD;&#x8C61;&#x201D;&#x6982;&#x5FF5;&#x3002;&#x201C;&#x65E0;&#x9009;&#x62E9;&#x201D;&#x7684;&#x6982;&#x5FF5;&#x5728;&#x7528;&#x6237;&#x5BF9;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x754C;&#x9762;&#x7684;&#x770B;&#x6CD5;&#x65B9;&#x9762;&#x5F88;&#x6709;&#x610F;&#x4E49;&#xFF0C;&#x4F46;&#x8FD9;&#x5E76;&#x4E0D;&#x610F;&#x5473;&#x7740;&#x5FC5;&#x987B;&#x660E;&#x786E;&#x8868;&#x793A;&#x5B83;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5185;&#x90E8;&#x3002;&#x9009;&#x62E9;&#x603B;&#x662F;&#x5B58;&#x5728;&#x7684;&#xFF0C;&#x4F46;&#x6709;&#x65F6;&#x662F;&#x7A7A;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x662F;&#x4E0D;&#x53EF;&#x89C1;&#x7684;&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x7B80;&#x5316;&#x5B9E;&#x73B0;&#x3002;</p>
</blockquote>
<h2 id="1010-taking-it-too-far-&#x8D70;&#x5F97;&#x592A;&#x8FDC;">10.10 Taking it too far &#x8D70;&#x5F97;&#x592A;&#x8FDC;</h2>
<p>Defining away exceptions, or masking them inside a module, only makes sense if the exception information isn&#x2019;t needed outside the module. This was true for the examples in this chapter, such the Tcl unset command and the Java substring method; in the rare situations where a caller cares about the special cases detected by the exceptions, there are other ways for it to get this information.</p>
<blockquote>
<p>&#x5B9A;&#x4E49;&#x5F02;&#x5E38;&#x6216;&#x5C06;&#x5176;&#x5C4F;&#x853D;&#x5728;&#x6A21;&#x5757;&#x5185;&#x90E8;&#xFF0C;&#x4EC5;&#x5728;&#x6A21;&#x5757;&#x5916;&#x90E8;&#x4E0D;&#x9700;&#x8981;&#x5F02;&#x5E38;&#x4FE1;&#x606F;&#x65F6;&#x624D;&#x6709;&#x610F;&#x4E49;&#x3002;&#x5BF9;&#x4E8E;&#x672C;&#x7AE0;&#x4E2D;&#x7684;&#x793A;&#x4F8B;&#xFF0C;&#x4F8B;&#x5982; Tcl unset &#x547D;&#x4EE4;&#x548C; Java &#x5B50;&#x5B57;&#x7B26;&#x4E32;&#x65B9;&#x6CD5;&#xFF0C;&#x90FD;&#x662F;&#x5982;&#x6B64;&#x3002;&#x5728;&#x6781;&#x5C11;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x547C;&#x53EB;&#x8005;&#x5173;&#x5FC3;&#x5F02;&#x5E38;&#x68C0;&#x6D4B;&#x5230;&#x7684;&#x7279;&#x6B8A;&#x60C5;&#x51B5;&#xFF0C;&#x8FD8;&#x6709;&#x5176;&#x4ED6;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x83B7;&#x53D6;&#x6B64;&#x4FE1;&#x606F;&#x3002;</p>
</blockquote>
<p>However, it is possible to take this idea too far. In a module for network communication, a student team masked all network exceptions: if a network error occurred, the module caught it, discarded it, and continued as if there were no problem. This meant that applications using the module had no way to find out if messages were lost or a peer server failed; without this information, it was impossible to build robust applications. In this case, it is essential for the module to expose the exceptions, even though they add complexity to the module&#x2019;s interface.</p>
<blockquote>
<p>&#x4F46;&#x662F;&#xFF0C;&#x6709;&#x53EF;&#x80FD;&#x4F7F;&#x8FD9;&#x4E2A;&#x60F3;&#x6CD5;&#x592A;&#x8FC7;&#x5206;&#x3002;&#x5728;&#x7528;&#x4E8E;&#x7F51;&#x7EDC;&#x901A;&#x4FE1;&#x7684;&#x6A21;&#x5757;&#x4E2D;&#xFF0C;&#x4E00;&#x4E2A;&#x5B66;&#x751F;&#x56E2;&#x961F;&#x63A9;&#x76D6;&#x4E86;&#x6240;&#x6709;&#x7F51;&#x7EDC;&#x5F02;&#x5E38;&#xFF1A;&#x5982;&#x679C;&#x53D1;&#x751F;&#x7F51;&#x7EDC;&#x9519;&#x8BEF;&#xFF0C;&#x5219;&#x6A21;&#x5757;&#x5C06;&#x5176;&#x6355;&#x83B7;&#xFF0C;&#x4E22;&#x5F03;&#x5E76;&#x7EE7;&#x7EED;&#x8FDB;&#x884C;&#xFF0C;&#x5C31;&#x597D;&#x50CF;&#x6CA1;&#x6709;&#x95EE;&#x9898;&#x4E00;&#x6837;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x4F7F;&#x7528;&#x8BE5;&#x6A21;&#x5757;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x65E0;&#x6CD5;&#x786E;&#x5B9A;&#x6D88;&#x606F;&#x662F;&#x5426;&#x4E22;&#x5931;&#x6216;&#x5BF9;&#x7B49;&#x670D;&#x52A1;&#x5668;&#x662F;&#x5426;&#x53D1;&#x751F;&#x6545;&#x969C;&#xFF1B;&#x6CA1;&#x6709;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#xFF0C;&#x5C31;&#x4E0D;&#x53EF;&#x80FD;&#x6784;&#x5EFA;&#x5065;&#x58EE;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6A21;&#x5757;&#x5FC5;&#x987B;&#x516C;&#x5F00;&#x5F02;&#x5E38;&#xFF0C;&#x5373;&#x4F7F;&#x5B83;&#x4EEC;&#x589E;&#x52A0;&#x4E86;&#x6A21;&#x5757;&#x63A5;&#x53E3;&#x7684;&#x590D;&#x6742;&#x6027;&#x3002;</p>
</blockquote>
<p>With exceptions, as with many other areas in software design, you must determine what is important and what is not important. Things that are not important should be hidden, and the more of them the better. But when something is important, it must be exposed.</p>
<blockquote>
<p>&#x4E0E;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x4E2D;&#x7684;&#x8BB8;&#x591A;&#x5176;&#x4ED6;&#x9886;&#x57DF;&#x4E00;&#x6837;&#xFF0C;&#x60A8;&#x5FC5;&#x987B;&#x786E;&#x5B9A;&#x54EA;&#x4E9B;&#x662F;&#x91CD;&#x8981;&#x7684;&#xFF0C;&#x54EA;&#x4E9B;&#x662F;&#x4E0D;&#x91CD;&#x8981;&#x7684;&#x3002;&#x4E0D;&#x91CD;&#x8981;&#x7684;&#x4E8B;&#x7269;&#x5E94;&#x8BE5;&#x88AB;&#x9690;&#x85CF;&#x8D77;&#x6765;&#xFF0C;&#x5B83;&#x4EEC;&#x8D8A;&#x591A;&#x8D8A;&#x597D;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5F53;&#x67D0;&#x4EF6;&#x4E8B;&#x5F88;&#x91CD;&#x8981;&#x65F6;&#xFF0C;&#x5FC5;&#x987B;&#x5C06;&#x5176;&#x66B4;&#x9732;&#x51FA;&#x6765;&#x3002;</p>
</blockquote>
<h2 id="1011-conclusion-&#x7ED3;&#x8BBA;">10.11 Conclusion &#x7ED3;&#x8BBA;</h2>
<p>Special cases of any form make code harder to understand and increase the likelihood of bugs. This chapter focused on exceptions, which are one of the most significant sources of special-case code, and discussed how to reduce the number of places where exceptions must be handled. The best way to do this is by redefining semantics to eliminate error conditions. For exceptions that can&#x2019;t be defined away, you should look for opportunities to mask them at a low level, so their impact is limited, or aggregate several special-case handlers into a single more generic handler. Together, these techniques can have a significant impact on overall system complexity.</p>
<blockquote>
<p>&#x4EFB;&#x4F55;&#x5F62;&#x5F0F;&#x7684;&#x7279;&#x6B8A;&#x60C5;&#x51B5;&#x90FD;&#x4F7F;&#x4EE3;&#x7801;&#x66F4;&#x96BE;&#x4EE5;&#x7406;&#x89E3;&#xFF0C;&#x5E76;&#x589E;&#x52A0;&#x4E86;&#x53D1;&#x751F;&#x9519;&#x8BEF;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x3002;&#x672C;&#x7AE0;&#x91CD;&#x70B9;&#x8BA8;&#x8BBA;&#x5F02;&#x5E38;&#xFF0C;&#x5F02;&#x5E38;&#x662F;&#x7279;&#x6B8A;&#x60C5;&#x51B5;&#x4EE3;&#x7801;&#x7684;&#x6700;&#x91CD;&#x8981;&#x6765;&#x6E90;&#x4E4B;&#x4E00;&#xFF0C;&#x5E76;&#x8BA8;&#x8BBA;&#x4E86;&#x5982;&#x4F55;&#x51CF;&#x5C11;&#x5FC5;&#x987B;&#x5904;&#x7406;&#x5F02;&#x5E38;&#x7684;&#x5730;&#x65B9;&#x7684;&#x6570;&#x91CF;&#x3002;&#x505A;&#x5230;&#x8FD9;&#x4E00;&#x70B9;&#x7684;&#x6700;&#x4F73;&#x65B9;&#x6CD5;&#x662F;&#x91CD;&#x65B0;&#x5B9A;&#x4E49;&#x8BED;&#x4E49;&#x4EE5;&#x6D88;&#x9664;&#x9519;&#x8BEF;&#x6761;&#x4EF6;&#x3002;&#x5BF9;&#x4E8E;&#x65E0;&#x6CD5;&#x5B9A;&#x4E49;&#x7684;&#x5F02;&#x5E38;&#xFF0C;&#x60A8;&#x5E94;&#x8BE5;&#x5BFB;&#x627E;&#x673A;&#x4F1A;&#x5C06;&#x5B83;&#x4EEC;&#x63A9;&#x76D6;&#x5230;&#x8F83;&#x4F4E;&#x7684;&#x6C34;&#x5E73;&#xFF0C;&#x4EE5;&#x514D;&#x5F71;&#x54CD;&#x6709;&#x9650;&#xFF0C;&#x6216;&#x8005;&#x5C06;&#x591A;&#x4E2A;&#x7279;&#x6B8A;&#x60C5;&#x51B5;&#x7684;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x805A;&#x5408;&#x5230;&#x4E00;&#x4E2A;&#x66F4;&#x901A;&#x7528;&#x7684;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x4E2D;&#x3002;&#x603B;&#x4E4B;&#xFF0C;&#x8FD9;&#x4E9B;&#x6280;&#x672F;&#x53EF;&#x80FD;&#x4F1A;&#x5BF9;&#x6574;&#x4F53;&#x7CFB;&#x7EDF;&#x590D;&#x6742;&#x6027;&#x4EA7;&#x751F;&#x91CD;&#x5927;&#x5F71;&#x54CD;&#x3002;</p>
</blockquote>
<p>1Ding Yuan et. al., &#x201C;Simple Testing Can Prevent Most Critical Failures: An Analysis of Production Failures in Distributed Data-Intensive Systems,&#x201D; 2014 USENIX Conference on Operating System Design and Implementation.</p>
<blockquote>
<p>1 &#x4E01;&#x5143;&#x7B49; &#x7B49;&#x4EBA;&#xFF0C;&#x201C;&#x7B80;&#x5355;&#x7684;&#x6D4B;&#x8BD5;&#x53EF;&#x4EE5;&#x9632;&#x6B62;&#x6700;&#x5173;&#x952E;&#x7684;&#x6545;&#x969C;&#xFF1A;&#x5BF9;&#x5206;&#x5E03;&#x5F0F;&#x6570;&#x636E;&#x5BC6;&#x96C6;&#x578B;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x751F;&#x4EA7;&#x6545;&#x969C;&#x7684;&#x5206;&#x6790;&#x201D;&#xFF0C;2014 USENIX &#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;&#x548C;&#x5B9E;&#x65BD;&#x5927;&#x4F1A;&#x3002;</p>
</blockquote>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="ch9.html" class="navigation navigation-prev " aria-label="Previous page: 第九章: 在一起更好还是分开更好？">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="ch11.html" class="navigation navigation-next " aria-label="Next page: 第十一章: 设计它两次">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第十章: 定义不存在的错误","level":"1.13","depth":1,"next":{"title":"第十一章: 设计它两次","level":"1.14","depth":1,"path":"docs/ch11.md","ref":"./docs/ch11.md","articles":[]},"previous":{"title":"第九章: 在一起更好还是分开更好？","level":"1.12","depth":1,"path":"docs/ch9.md","ref":"./docs/ch9.md","articles":[]},"dir":"ltr"},"config":{"plugins":["back-to-top-button","expandable-chapters-small","page-toc-button","livereload"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"livereload":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"page-toc-button":{},"back-to-top-button":{},"expandable-chapters-small":{},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"John Ousterhout","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"软件设计哲学","language":"zh-hans","gitbook":"*","description":"书中讨论了软件设计的主题：如何将复杂的软件系统分解成可以相对独立实现的模块(如类和方法)"},"file":{"path":"docs/ch10.md","mtime":"2020-08-06T16:26:19.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-02-06T04:55:41.669Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-page-toc-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

