
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第十一章: 设计它两次 · 软件设计哲学</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="John Ousterhout">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-page-toc-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="ch12.html" />
    
    
    <link rel="prev" href="ch10.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    首页
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="preface">
            
                <span>
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="ch1.html">
            
                <a href="ch1.html">
            
                    
                    第一章：介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="ch2.html">
            
                <a href="ch2.html">
            
                    
                    第二章：复杂性的本质
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="ch3.html">
            
                <a href="ch3.html">
            
                    
                    第三章：工作代码是不够的（战略与战术编程）
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="ch4.html">
            
                <a href="ch4.html">
            
                    
                    第四章：模块应该是深的
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="ch5.html">
            
                <a href="ch5.html">
            
                    
                    第五章：信息隐藏(和泄露)
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="ch6.html">
            
                <a href="ch6.html">
            
                    
                    第六章：通用模块更深入
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="ch7.html">
            
                <a href="ch7.html">
            
                    
                    第七章: 不同的层，不同的抽象
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="ch8.html">
            
                <a href="ch8.html">
            
                    
                    第八章: 降低复杂性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="ch9.html">
            
                <a href="ch9.html">
            
                    
                    第九章: 在一起更好还是分开更好？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="ch10.html">
            
                <a href="ch10.html">
            
                    
                    第十章: 定义不存在的错误
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.14" data-path="ch11.html">
            
                <a href="ch11.html">
            
                    
                    第十一章: 设计它两次
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="ch12.html">
            
                <a href="ch12.html">
            
                    
                    第十二章: 为什么写注释？四个理由
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="ch13.html">
            
                <a href="ch13.html">
            
                    
                    第十三章: 注释应该描述代码中不明显的内容
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="ch14.html">
            
                <a href="ch14.html">
            
                    
                    第十四章: 选择的名字
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="ch15.html">
            
                <a href="ch15.html">
            
                    
                    第十五章: 先写注释
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="ch16.html">
            
                <a href="ch16.html">
            
                    
                    第十六章: 修改现有的代码
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.20" data-path="ch17.html">
            
                <a href="ch17.html">
            
                    
                    第十七章: 一致性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.21" data-path="ch18.html">
            
                <a href="ch18.html">
            
                    
                    第十八章: 代码应该是显而易见的
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.22" data-path="ch19.html">
            
                <a href="ch19.html">
            
                    
                    第十九章: 软件发展趋势
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.23" data-path="ch20.html">
            
                <a href="ch20.html">
            
                    
                    第二十章: 设计性能
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.24" data-path="ch21.html">
            
                <a href="ch21.html">
            
                    
                    第二十一章: 结论
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.25" data-path="summary.html">
            
                <a href="summary.html">
            
                    
                    总结
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >第十一章: 设计它两次</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7B2C;-11-&#x7AE0;-&#x8BBE;&#x8BA1;&#x5B83;&#x4E24;&#x6B21;">&#x7B2C; 11 &#x7AE0; &#x8BBE;&#x8BA1;&#x5B83;&#x4E24;&#x6B21;</h1>
<blockquote>
<p>Chapter 11 Design it Twice</p>
</blockquote>
<p>Designing software is hard, so it&#x2019;s unlikely that your first thoughts about how to structure a module or system will produce the best design. You&#x2019;ll end up with a much better result if you consider multiple options for each major design decision: design it twice.</p>
<blockquote>
<p>&#x8BBE;&#x8BA1;&#x8F6F;&#x4EF6;&#x975E;&#x5E38;&#x56F0;&#x96BE;&#xFF0C;&#x56E0;&#x6B64;&#x60A8;&#x5BF9;&#x5982;&#x4F55;&#x6784;&#x9020;&#x6A21;&#x5757;&#x6216;&#x7CFB;&#x7EDF;&#x7684;&#x521D;&#x6B65;&#x601D;&#x8003;&#x4E0D;&#x592A;&#x53EF;&#x80FD;&#x4F1A;&#x4EA7;&#x751F;&#x6700;&#x4F73;&#x7684;&#x8BBE;&#x8BA1;&#x3002;&#x5982;&#x679C;&#x4E3A;&#x6BCF;&#x4E2A;&#x4E3B;&#x8981;&#x8BBE;&#x8BA1;&#x51B3;&#x7B56;&#x8003;&#x8651;&#x591A;&#x4E2A;&#x9009;&#x9879;&#xFF0C;&#x6700;&#x7EC8;&#x5C06;&#x83B7;&#x5F97;&#x66F4;&#x597D;&#x7684;&#x7ED3;&#x679C;&#xFF1A;&#x8BBE;&#x8BA1;&#x4E24;&#x6B21;&#x3002;</p>
</blockquote>
<p>Suppose you are designing the class that will manage the text of a file for a GUI text editor. The first step is to define the interface that the class will present to the rest of the editor; rather than picking the first idea that comes to mind, consider several possibilities. One choice is a line-oriented interface, with operations to insert, modify, and delete whole lines of text. Another option is an interface based on individual character insertions and deletions. A third choice is a string-oriented interface, which operates on arbitrary ranges of characters that may cross line boundaries. You don&#x2019;t need to pin down every feature of each alternative; it&#x2019;s sufficient at this point to sketch out a few of the most important methods.</p>
<blockquote>
<p>&#x5047;&#x8BBE;&#x60A8;&#x6B63;&#x5728;&#x8BBE;&#x8BA1;&#x7528;&#x4E8E;&#x7BA1;&#x7406; GUI &#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;&#x6587;&#x4EF6;&#x6587;&#x672C;&#x7684;&#x7C7B;&#x3002;&#x7B2C;&#x4E00;&#x6B65;&#x662F;&#x5B9A;&#x4E49;&#x8BE5;&#x7C7B;&#x5C06;&#x5448;&#x73B0;&#x7ED9;&#x7F16;&#x8F91;&#x5668;&#x5176;&#x4F59;&#x90E8;&#x5206;&#x7684;&#x63A5;&#x53E3;&#x3002;&#x4E0E;&#x5176;&#x9009;&#x62E9;&#x60F3;&#x5230;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x60F3;&#x6CD5;&#xFF0C;&#x4E0D;&#x5982;&#x8003;&#x8651;&#x51E0;&#x79CD;&#x53EF;&#x80FD;&#x6027;&#x3002;&#x4E00;&#x79CD;&#x9009;&#x62E9;&#x662F;&#x9762;&#x5411;&#x884C;&#x7684;&#x754C;&#x9762;&#xFF0C;&#x8BE5;&#x754C;&#x9762;&#x5177;&#x6709;&#x63D2;&#x5165;&#xFF0C;&#x4FEE;&#x6539;&#x548C;&#x5220;&#x9664;&#x6574;&#x884C;&#x6587;&#x672C;&#x7684;&#x64CD;&#x4F5C;&#x3002;&#x53E6;&#x4E00;&#x4E2A;&#x9009;&#x62E9;&#x662F;&#x57FA;&#x4E8E;&#x5355;&#x4E2A;&#x5B57;&#x7B26;&#x63D2;&#x5165;&#x548C;&#x5220;&#x9664;&#x7684;&#x63A5;&#x53E3;&#x3002;&#x7B2C;&#x4E09;&#x79CD;&#x9009;&#x62E9;&#x662F;&#x9762;&#x5411;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x8BE5;&#x63A5;&#x53E3;&#x53EF;&#x5BF9;&#x53EF;&#x80FD;&#x8DE8;&#x8D8A;&#x7EBF;&#x8FB9;&#x754C;&#x7684;&#x4EFB;&#x610F;&#x8303;&#x56F4;&#x7684;&#x5B57;&#x7B26;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#x3002;&#x60A8;&#x65E0;&#x9700;&#x786E;&#x5B9A;&#x6BCF;&#x4E2A;&#x66FF;&#x4EE3;&#x65B9;&#x6848;&#x7684;&#x6BCF;&#x4E2A;&#x529F;&#x80FD;&#xFF1B;&#x5728;&#x8FD9;&#x4E00;&#x70B9;&#x4E0A;&#xFF0C;&#x52FE;&#x52D2;&#x51FA;&#x4E00;&#x4E9B;&#x6700;&#x91CD;&#x8981;&#x7684;&#x65B9;&#x6CD5;&#x5C31;&#x8DB3;&#x591F;&#x4E86;&#x3002;</p>
</blockquote>
<p>Try to pick approaches that are radically different from each other; you&#x2019;ll learn more that way. Even if you are certain that there is only one reasonable approach, consider a second design anyway, no matter how bad you think it will be. It will be instructive to think about the weaknesses of that design and contrast them with the features of other designs.</p>
<blockquote>
<p>&#x5C1D;&#x8BD5;&#x9009;&#x62E9;&#x5F7C;&#x6B64;&#x6839;&#x672C;&#x4E0D;&#x540C;&#x7684;&#x65B9;&#x6CD5;&#xFF1B;&#x8FD9;&#x6837;&#x60A8;&#x5C06;&#x5B66;&#x5230;&#x66F4;&#x591A;&#x3002;&#x5373;&#x4F7F;&#x60A8;&#x786E;&#x5B9A;&#x53EA;&#x6709;&#x4E00;&#x79CD;&#x5408;&#x7406;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x65E0;&#x8BBA;&#x60A8;&#x8BA4;&#x4E3A;&#x6709;&#x591A;&#x7CDF;&#x7CD5;&#xFF0C;&#x90FD;&#x5E94;&#x8BE5;&#x8003;&#x8651;&#x7B2C;&#x4E8C;&#x79CD;&#x8BBE;&#x8BA1;&#x3002;&#x8003;&#x8651;&#x8BE5;&#x8BBE;&#x8BA1;&#x7684;&#x5F31;&#x70B9;&#x5E76;&#x5C06;&#x5B83;&#x4EEC;&#x4E0E;&#x5176;&#x4ED6;&#x8BBE;&#x8BA1;&#x7684;&#x7279;&#x5F81;&#x8FDB;&#x884C;&#x5BF9;&#x6BD4;&#x5C06;&#x5F88;&#x6709;&#x542F;&#x53D1;&#x6027;&#x3002;</p>
</blockquote>
<p>After you have roughed out the designs for the alternatives, make a list of the pros and cons of each one. The most important consideration for an interface is ease of use for higher level software. In the example above, both the line-oriented interface and the character-oriented interface will require extra work in software that uses the text class. The line-oriented interface will require higher level software to split and join lines during partial-line and multi-line operations such as cutting and pasting the selection. The character-oriented interface will require loops to implement operations that modify more than a single character. It is also worth considering other factors:</p>
<blockquote>
<p>&#x5728;&#x5BF9;&#x5907;&#x9009;&#x65B9;&#x6848;&#x8FDB;&#x884C;&#x7C97;&#x7565;&#x8BBE;&#x8BA1;&#x4E4B;&#x540E;&#xFF0C;&#x5217;&#x51FA;&#x6BCF;&#x4E2A;&#x65B9;&#x6848;&#x7684;&#x4F18;&#x7F3A;&#x70B9;&#x3002;&#x63A5;&#x53E3;&#x6700;&#x91CD;&#x8981;&#x7684;&#x8003;&#x8651;&#x56E0;&#x7D20;&#x662F;&#x9AD8;&#x7EA7;&#x8F6F;&#x4EF6;&#x7684;&#x6613;&#x7528;&#x6027;&#x3002;&#x5728;&#x4E0A;&#x9762;&#x7684;&#x793A;&#x4F8B;&#x4E2D;&#xFF0C;&#x9762;&#x5411;&#x884C;&#x7684;&#x754C;&#x9762;&#x548C;&#x9762;&#x5411;&#x5B57;&#x7B26;&#x7684;&#x754C;&#x9762;&#x90FD;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x6587;&#x672C;&#x7C7B;&#x7684;&#x8F6F;&#x4EF6;&#x4E2D;&#x7684;&#x989D;&#x5916;&#x5DE5;&#x4F5C;&#x3002;&#x9762;&#x5411;&#x884C;&#x7684;&#x754C;&#x9762;&#x5C06;&#x9700;&#x8981;&#x66F4;&#x9AD8;&#x7EA7;&#x522B;&#x7684;&#x8F6F;&#x4EF6;&#x6765;&#x5728;&#x90E8;&#x5206;&#x884C;&#x548C;&#x591A;&#x884C;&#x64CD;&#x4F5C;&#xFF08;&#x4F8B;&#x5982;&#x526A;&#x5207;&#x548C;&#x7C98;&#x8D34;&#x6240;&#x9009;&#x5185;&#x5BB9;&#xFF09;&#x671F;&#x95F4;&#x62C6;&#x5206;&#x548C;&#x5408;&#x5E76;&#x884C;&#x3002;&#x9762;&#x5411;&#x5B57;&#x7B26;&#x7684;&#x63A5;&#x53E3;&#x5C06;&#x9700;&#x8981;&#x5FAA;&#x73AF;&#x6765;&#x5B9E;&#x73B0;&#x4FEE;&#x6539;&#x591A;&#x4E2A;&#x5B57;&#x7B26;&#x7684;&#x64CD;&#x4F5C;&#x3002;&#x8FD8;&#x503C;&#x5F97;&#x8003;&#x8651;&#x5176;&#x4ED6;&#x56E0;&#x7D20;&#xFF1A;</p>
</blockquote>
<ul>
<li>Does one alternative have a simpler interface than another? In the text example, all of the text interfaces are relatively simple.</li>
<li>Is one interface more general-purpose than another?</li>
<li>Does one interface enable a more efficient implementation than another? In the text example, the character-oriented approach is likely to be significantly slower than the others, because it requires a separate call into the text module for each character.</li>
</ul>
<hr>
<blockquote>
<ul>
<li>&#x4E00;&#x79CD;&#x9009;&#x62E9;&#x662F;&#x5426;&#x5177;&#x6709;&#x6BD4;&#x53E6;&#x4E00;&#x79CD;&#x66F4;&#x7B80;&#x5355;&#x7684;&#x754C;&#x9762;&#xFF1F;&#x5728;&#x6587;&#x672C;&#x793A;&#x4F8B;&#x4E2D;&#xFF0C;&#x6240;&#x6709;&#x6587;&#x672C;&#x754C;&#x9762;&#x90FD;&#x76F8;&#x5BF9;&#x7B80;&#x5355;&#x3002;</li>
<li>&#x4E00;&#x4E2A;&#x63A5;&#x53E3;&#x6BD4;&#x53E6;&#x4E00;&#x4E2A;&#x63A5;&#x53E3;&#x66F4;&#x901A;&#x7528;&#x5417;&#xFF1F;</li>
<li>&#x4E00;&#x4E2A;&#x63A5;&#x53E3;&#x662F;&#x5426;&#x6BD4;&#x53E6;&#x4E00;&#x4E2A;&#x63A5;&#x53E3;&#x66F4;&#x6709;&#x6548;&#x5730;&#x5B9E;&#x73B0;&#xFF1F;&#x5728;&#x6587;&#x672C;&#x793A;&#x4F8B;&#x4E2D;&#xFF0C;&#x9762;&#x5411;&#x5B57;&#x7B26;&#x7684;&#x65B9;&#x6CD5;&#x53EF;&#x80FD;&#x6BD4;&#x5176;&#x4ED6;&#x65B9;&#x6CD5;&#x6162;&#x5F97;&#x591A;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x9700;&#x8981;&#x4E3A;&#x6BCF;&#x4E2A;&#x5B57;&#x7B26;&#x5355;&#x72EC;&#x8C03;&#x7528;&#x6587;&#x672C;&#x6A21;&#x5757;&#x3002;</li>
</ul>
</blockquote>
<p>Once you have compared alternative designs, you will be in a better position to identify the best design. The best choice may be one of the alternatives, or you may discover that you can combine features of multiple alternatives into a new design that is better than any of the original choices.</p>
<blockquote>
<p>&#x6BD4;&#x8F83;&#x4E86;&#x5907;&#x9009;&#x8BBE;&#x8BA1;&#x4E4B;&#x540E;&#xFF0C;&#x60A8;&#x5C06;&#x53EF;&#x4EE5;&#x66F4;&#x597D;&#x5730;&#x786E;&#x5B9A;&#x6700;&#x4F73;&#x8BBE;&#x8BA1;&#x3002;&#x6700;&#x4F73;&#x9009;&#x62E9;&#x53EF;&#x80FD;&#x662F;&#x8FD9;&#x4E9B;&#x9009;&#x62E9;&#x4E4B;&#x4E00;&#xFF0C;&#x6216;&#x8005;&#x60A8;&#x53EF;&#x80FD;&#x53D1;&#x73B0;&#x53EF;&#x4EE5;&#x5C06;&#x591A;&#x4E2A;&#x9009;&#x62E9;&#x7684;&#x529F;&#x80FD;&#x7EC4;&#x5408;&#x5230;&#x4E00;&#x4E2A;&#x6BD4;&#x4EFB;&#x4F55;&#x539F;&#x59CB;&#x9009;&#x62E9;&#x90FD;&#x8981;&#x597D;&#x7684;&#x65B0;&#x8BBE;&#x8BA1;&#x4E2D;&#x3002;</p>
</blockquote>
<p>Sometimes none of the alternatives is particularly attractive; when this happens, see if you can come up with additional schemes. Use the problems you identified with the original alternatives to drive the new design(s). If you were designing the text class and considered only the line-oriented and character-oriented approaches, you might notice that each of the alternatives is awkward because it requires higher level software to perform additional text manipulations. That&#x2019;s a red flag: if there&#x2019;s going to be a text class, it should handle all of the text manipulation. In order to eliminate the additional text manipulations, the text interface needs to match more closely the operations happening in higher level software. These operations don&#x2019;t always correspond to single characters or single lines. This line of reasoning should lead you to a range-oriented API for text, which eliminates the problem with the earlier designs.</p>
<blockquote>
<p>&#x6709;&#x65F6;&#xFF0C;&#x6CA1;&#x6709;&#x5176;&#x4ED6;&#x9009;&#x62E9;&#x7279;&#x522B;&#x6709;&#x5438;&#x5F15;&#x529B;&#x3002;&#x53D1;&#x751F;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x65F6;&#xFF0C;&#x8BF7;&#x67E5;&#x770B;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x63D0;&#x51FA;&#x5176;&#x4ED6;&#x65B9;&#x6848;&#x3002;&#x4F7F;&#x7528;&#x60A8;&#x5728;&#x539F;&#x59CB;&#x66FF;&#x4EE3;&#x65B9;&#x6848;&#x4E2D;&#x53D1;&#x73B0;&#x7684;&#x95EE;&#x9898;&#x6765;&#x63A8;&#x52A8;&#x65B0;&#x8BBE;&#x8BA1;&#x3002;&#x5982;&#x679C;&#x60A8;&#x5728;&#x8BBE;&#x8BA1;&#x6587;&#x672C;&#x7C7B;&#x5E76;&#x4E14;&#x4EC5;&#x8003;&#x8651;&#x9762;&#x5411;&#x884C;&#x548C;&#x9762;&#x5411;&#x5B57;&#x7B26;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5219;&#x53EF;&#x80FD;&#x4F1A;&#x6CE8;&#x610F;&#x5230;&#x6BCF;&#x4E2A;&#x66FF;&#x4EE3;&#x65B9;&#x6848;&#x90FD;&#x6BD4;&#x8F83;&#x7B28;&#x62D9;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x9700;&#x8981;&#x66F4;&#x9AD8;&#x7EA7;&#x522B;&#x7684;&#x8F6F;&#x4EF6;&#x6765;&#x6267;&#x884C;&#x5176;&#x4ED6;&#x6587;&#x672C;&#x64CD;&#x4F5C;&#x3002;&#x90A3;&#x662F;&#x4E00;&#x4E2A;&#x5371;&#x9669;&#x4FE1;&#x53F7;&#xFF1A;&#x5982;&#x679C;&#x8981;&#x6709;&#x4E00;&#x4E2A;&#x6587;&#x672C;&#x7C7B;&#xFF0C;&#x5B83;&#x5E94;&#x8BE5;&#x5904;&#x7406;&#x6240;&#x6709;&#x6587;&#x672C;&#x64CD;&#x4F5C;&#x3002;&#x4E3A;&#x4E86;&#x6D88;&#x9664;&#x5176;&#x4ED6;&#x6587;&#x672C;&#x64CD;&#x4F5C;&#xFF0C;&#x6587;&#x672C;&#x754C;&#x9762;&#x9700;&#x8981;&#x66F4;&#x7D27;&#x5BC6;&#x5730;&#x5339;&#x914D;&#x9AD8;&#x7EA7;&#x8F6F;&#x4EF6;&#x4E2D;&#x53D1;&#x751F;&#x7684;&#x64CD;&#x4F5C;&#x3002;&#x8FD9;&#x4E9B;&#x64CD;&#x4F5C;&#x5E76;&#x4E0D;&#x603B;&#x662F;&#x5BF9;&#x5E94;&#x4E8E;&#x5355;&#x4E2A;&#x5B57;&#x7B26;&#x6216;&#x4E00;&#x884C;&#x3002;</p>
</blockquote>
<p>The design-it-twice principle can be applied at many levels in a system. For a module, you can use this approach first to pick the interface, as described above. Then you can apply it again when you are designing the implementation: for the text class, you might consider implementations such as a linked list of lines, fixed-size blocks of characters, or a &#x201C;gap buffer.&#x201D; The goals will be different for the implementation than for the interface: for the implementation, the most important things are simplicity and performance. It&#x2019;s also useful to explore multiple designs at higher levels in the system, such as when choosing features for a user interface, or when decomposing a system into major modules. In each case, it&#x2019;s easier to identify the best approach if you can compare a few alternatives.</p>
<blockquote>
<p>&#x4E24;&#x6B21;&#x8BBE;&#x8BA1;&#x539F;&#x5219;&#x53EF;&#x4EE5;&#x5728;&#x7CFB;&#x7EDF;&#x7684;&#x8BB8;&#x591A;&#x7EA7;&#x522B;&#x4E0A;&#x5E94;&#x7528;&#x3002;&#x5BF9;&#x4E8E;&#x6A21;&#x5757;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x9996;&#x5148;&#x4F7F;&#x7528;&#x6B64;&#x65B9;&#x6CD5;&#x6765;&#x9009;&#x62E9;&#x63A5;&#x53E3;&#xFF0C;&#x5982;&#x4E0A;&#x6240;&#x8FF0;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x5728;&#x8BBE;&#x8BA1;&#x5B9E;&#x73B0;&#x65F6;&#x518D;&#x6B21;&#x5E94;&#x7528;&#x5B83;&#xFF1A;&#x5BF9;&#x4E8E;&#x6587;&#x672C;&#x7C7B;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x5B9E;&#x73B0;&#x8FD9;&#x4E9B;&#x5B9E;&#x73B0;&#xFF0C;&#x4F8B;&#x5982;&#x884C;&#x7684;&#x94FE;&#x63A5;&#x5217;&#x8868;&#xFF0C;&#x56FA;&#x5B9A;&#x5927;&#x5C0F;&#x7684;&#x5B57;&#x7B26;&#x5757;&#x6216;&#x201C;&#x95F4;&#x9699;&#x7F13;&#x51B2;&#x533A;&#x201D;&#x3002;&#x5B9E;&#x73B0;&#x7684;&#x76EE;&#x6807;&#x4E0E;&#x63A5;&#x53E3;&#x7684;&#x76EE;&#x6807;&#x662F;&#x4E0D;&#x540C;&#x7684;&#xFF1A;&#x5BF9;&#x4E8E;&#x5B9E;&#x73B0;&#xFF0C;&#x6700;&#x91CD;&#x8981;&#x7684;&#x662F;&#x7B80;&#x5355;&#x6027;&#x548C;&#x6027;&#x80FD;&#x3002;&#x5728;&#x7CFB;&#x7EDF;&#x7684;&#x66F4;&#x9AD8;&#x5C42;&#x6B21;&#x4E0A;&#x63A2;&#x7D22;&#x591A;&#x79CD;&#x8BBE;&#x8BA1;&#x4E5F;&#x5F88;&#x6709;&#x7528;&#xFF0C;&#x4F8B;&#x5982;&#x5728;&#x4E3A;&#x7528;&#x6237;&#x754C;&#x9762;&#x9009;&#x62E9;&#x529F;&#x80FD;&#x6216;&#x5C06;&#x7CFB;&#x7EDF;&#x5206;&#x89E3;&#x4E3A;&#x4E3B;&#x8981;&#x6A21;&#x5757;&#x65F6;&#x3002;&#x5728;&#x6BCF;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5982;&#x679C;&#x60A8;&#x53EF;&#x4EE5;&#x6BD4;&#x8F83;&#x51E0;&#x79CD;&#x9009;&#x62E9;&#xFF0C;&#x5219;&#x66F4;&#x5BB9;&#x6613;&#x786E;&#x5B9A;&#x6700;&#x4F73;&#x65B9;&#x6CD5;&#x3002;</p>
</blockquote>
<p>Designing it twice does not need to take a lot of extra time. For a smaller module such as a class, you may not need more than an hour or two to consider alternatives. This is a small amount of time compared to the days or weeks you will spend implementing the class. The initial design experiments will probably result in a significantly better design, which will more than pay for the time spent designing it twice. For larger modules you&#x2019;ll spend more time in the initial design explorations, but the implementation will also take longer, and the benefits of a better design will also be higher.</p>
<blockquote>
<p>&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x4E24;&#x6B21;&#x8BBE;&#x8BA1;&#x4E0D;&#x9700;&#x8981;&#x82B1;&#x8D39;&#x5F88;&#x591A;&#x989D;&#x5916;&#x7684;&#x65F6;&#x95F4;&#x3002;&#x5BF9;&#x4E8E;&#x8F83;&#x5C0F;&#x7684;&#x6A21;&#x5757;&#xFF08;&#x5982;&#x8BFE;&#x7A0B;&#xFF09;&#xFF0C;&#x60A8;&#x53EF;&#x80FD;&#x4E0D;&#x9700;&#x8981;&#x4E00;&#x4E24;&#x4E2A;&#x5C0F;&#x65F6;&#x5C31;&#x80FD;&#x8003;&#x8651;&#x66FF;&#x4EE3;&#x65B9;&#x6CD5;&#x3002;&#x4E0E;&#x60A8;&#x5C06;&#x82B1;&#x8D39;&#x6570;&#x5929;&#x6216;&#x6570;&#x5468;&#x65F6;&#x95F4;&#x6765;&#x5B9E;&#x65BD;&#x8BE5;&#x8BFE;&#x7A0B;&#x76F8;&#x6BD4;&#xFF0C;&#x8FD9;&#x662F;&#x5F88;&#x5C11;&#x7684;&#x65F6;&#x95F4;&#x3002;&#x6700;&#x521D;&#x7684;&#x8BBE;&#x8BA1;&#x5B9E;&#x9A8C;&#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x660E;&#x663E;&#x66F4;&#x597D;&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x8FD9;&#x5C06;&#x6BD4;&#x82B1;&#x4E24;&#x6B21;&#x8BBE;&#x8BA1;&#x65F6;&#x95F4;&#x6240;&#x82B1;&#x7684;&#x65F6;&#x95F4;&#x591A;&#x3002;&#x5BF9;&#x4E8E;&#x8F83;&#x5927;&#x7684;&#x6A21;&#x5757;&#xFF0C;&#x60A8;&#x5C06;&#x82B1;&#x8D39;&#x66F4;&#x591A;&#x7684;&#x65F6;&#x95F4;&#x8FDB;&#x884C;&#x521D;&#x59CB;&#x8BBE;&#x8BA1;&#x63A2;&#x7D22;&#xFF0C;&#x4F46;&#x662F;&#x5B9E;&#x73B0;&#x4E5F;&#x5C06;&#x82B1;&#x8D39;&#x66F4;&#x957F;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x5E76;&#x4E14;&#x66F4;&#x597D;&#x7684;&#x8BBE;&#x8BA1;&#x6240;&#x5E26;&#x6765;&#x7684;&#x597D;&#x5904;&#x4E5F;&#x4F1A;&#x66F4;&#x9AD8;&#x3002;</p>
</blockquote>
<p>I have noticed that the design-it-twice principle is sometimes hard for really smart people to embrace. When they are growing up, smart people discover that their first quick idea about any problem is sufficient for a good grade; there is no need to consider a second or third possibility. This makes it easy to develop bad work habits. However, as these people get older, they get promoted into environments with harder and harder problems. Eventually, everyone reaches a point where your first ideas are no longer good enough; if you want to get really great results, you have to consider a second possibility, or perhaps a third, no matter how smart you are. The design of large software systems falls in this category: no-one is good enough to get it right with their first try.</p>
<blockquote>
<p>&#x6211;&#x5DF2;&#x7ECF;&#x6CE8;&#x610F;&#x5230;&#xFF0C;&#x771F;&#x6B63;&#x806A;&#x660E;&#x7684;&#x4EBA;&#x6709;&#x65F6;&#x5F88;&#x96BE;&#x63A5;&#x53D7;&#x4E24;&#x6B21;&#x8BBE;&#x8BA1;&#x539F;&#x5219;&#x3002;&#x5F53;&#x4ED6;&#x4EEC;&#x957F;&#x5927;&#x540E;&#xFF0C;&#x806A;&#x660E;&#x7684;&#x4EBA;&#x4F1A;&#x53D1;&#x73B0;&#xFF0C;&#x4ED6;&#x4EEC;&#x5BF9;&#x4EFB;&#x4F55;&#x95EE;&#x9898;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x5FEB;&#x901F;&#x6784;&#x60F3;&#x5C31;&#x8DB3;&#x4EE5;&#x53D6;&#x5F97;&#x826F;&#x597D;&#x7684;&#x6210;&#x7EE9;&#x3002;&#x65E0;&#x9700;&#x8003;&#x8651;&#x7B2C;&#x4E8C;&#x79CD;&#x6216;&#x7B2C;&#x4E09;&#x79CD;&#x53EF;&#x80FD;&#x6027;&#x3002;&#x8FD9;&#x4F7F;&#x5F97;&#x5BB9;&#x6613;&#x517B;&#x6210;&#x4E0D;&#x826F;&#x7684;&#x5DE5;&#x4F5C;&#x4E60;&#x60EF;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x968F;&#x7740;&#x8FD9;&#x4E9B;&#x4EBA;&#x53D8;&#x8001;&#xFF0C;&#x4ED6;&#x4EEC;&#x5C06;&#x88AB;&#x63D0;&#x5347;&#x5230;&#x8D8A;&#x6765;&#x8D8A;&#x56F0;&#x96BE;&#x7684;&#x73AF;&#x5883;&#x4E2D;&#x3002;&#x6700;&#x7EC8;&#xFF0C;&#x6BCF;&#x4E2A;&#x4EBA; &#x200B;&#x200B; &#x90FD;&#x8FBE;&#x5230;&#x4E86;&#x60A8;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x60F3;&#x6CD5;&#x4E0D;&#x518D;&#x8DB3;&#x591F;&#x597D;&#x7684;&#x5730;&#x6B65;&#x3002;&#x5982;&#x679C;&#x60A8;&#x60F3;&#x83B7;&#x5F97;&#x975E;&#x5E38;&#x597D;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x90A3;&#x4E48;&#x65E0;&#x8BBA;&#x60A8;&#x591A;&#x4E48;&#x806A;&#x660E;&#xFF0C;&#x90FD;&#x5FC5;&#x987B;&#x8003;&#x8651;&#x7B2C;&#x4E8C;&#x79CD;&#x53EF;&#x80FD;&#x6027;&#xFF0C;&#x6216;&#x8005;&#x7B2C;&#x4E09;&#x79CD;&#x53EF;&#x80FD;&#x6027;&#x3002;&#x5927;&#x578B;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x8BBE;&#x8BA1;&#x5C5E;&#x4E8E;&#x6B64;&#x7C7B;&#xFF1A;&#x6CA1;&#x6709;&#x4EBA;&#x80FD;&#x5F88;&#x597D;&#x5730;&#x5728;&#x9996;&#x6B21;&#x5C1D;&#x8BD5;&#x65F6;&#x5C31;&#x5C06;&#x5176;&#x6B63;&#x786E;&#x3002;</p>
</blockquote>
<p>Unfortunately, I often see smart people who insist on implementing the first idea that comes to mind, and this causes them to underperform their true potential (it also makes them frustrating to work with). Perhaps they subconsciously believe that &#x201C;smart people get it right the first time,&#x201D; so if they try multiple designs it would mean they are not smart after all. This is not the case. It isn&#x2019;t that you aren&#x2019;t smart; it&#x2019;s that the problems are really hard! Furthermore, that&#x2019;s a good thing: it&#x2019;s much more fun to work on a difficult problem where you have to think carefully, rather than an easy problem where you don&#x2019;t have to think at all.</p>
<blockquote>
<p>&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x6211;&#x7ECF;&#x5E38;&#x770B;&#x5230;&#x806A;&#x660E;&#x7684;&#x4EBA;&#x575A;&#x6301;&#x8981;&#x5B9E;&#x73B0;&#x7B2C;&#x4E00;&#x4E2A;&#x60F3;&#x5230;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x8FD9;&#x4F1A;&#x4F7F;&#x4ED6;&#x4EEC;&#x65E0;&#x6CD5;&#x53D1;&#x6325;&#x5176;&#x771F;&#x6B63;&#x7684;&#x6F5C;&#x529B;&#xFF08;&#x8FD9;&#x4E5F;&#x4F7F;&#x4ED6;&#x4EEC;&#x6CAE;&#x4E27;&#x5730;&#x5DE5;&#x4F5C;&#xFF09;&#x3002;&#x4E5F;&#x8BB8;&#x4ED6;&#x4EEC;&#x4E0B;&#x610F;&#x8BC6;&#x5730;&#x76F8;&#x4FE1;&#x201C;&#x806A;&#x660E;&#x7684;&#x4EBA;&#x7B2C;&#x4E00;&#x6B21;&#x5C31;&#x80FD;&#x505A;&#x5230;&#x201D;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x5982;&#x679C;&#x4ED6;&#x4EEC;&#x5C1D;&#x8BD5;&#x591A;&#x79CD;&#x8BBE;&#x8BA1;&#xFF0C;&#x90A3;&#x5C06;&#x610F;&#x5473;&#x7740;&#x4ED6;&#x4EEC;&#x6BD5;&#x7ADF;&#x5E76;&#x4E0D;&#x806A;&#x660E;&#x3002;&#x4E0D;&#x662F;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x3002;&#x4E0D;&#x662F;&#x8BF4;&#x4F60;&#x4E0D;&#x806A;&#x660E;&#xFF1B;&#x95EE;&#x9898;&#x771F;&#x7684;&#x5F88;&#x96BE;&#x89E3;&#x51B3;&#xFF01;&#x6B64;&#x5916;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4EF6;&#x597D;&#x4E8B;&#xFF1A;&#x5904;&#x7406;&#x4E00;&#x4E2A;&#x5FC5;&#x987B;&#x8BA4;&#x771F;&#x601D;&#x8003;&#x7684;&#x96BE;&#x9898;&#x6BD4;&#x5904;&#x7406;&#x4E00;&#x4E2A;&#x6839;&#x672C;&#x4E0D;&#x9700;&#x8981;&#x601D;&#x8003;&#x7684;&#x96BE;&#x9898;&#x66F4;&#x6709;&#x8DA3;&#x3002;</p>
</blockquote>
<p>The design-it-twice approach not only improves your designs, but it also improves your design skills. The process of devising and comparing multiple approaches will teach you about the factors that make designs better or worse. Over time, this will make it easier for you to rule out bad designs and hone in on really great ones.</p>
<blockquote>
<p>&#x201C;&#x4E24;&#x6B21;&#x8BBE;&#x8BA1;&#x201D;&#x65B9;&#x6CD5;&#x4E0D;&#x4EC5;&#x53EF;&#x4EE5;&#x6539;&#x5584;&#x60A8;&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x800C;&#x4E14;&#x53EF;&#x4EE5;&#x63D0;&#x9AD8;&#x60A8;&#x7684;&#x8BBE;&#x8BA1;&#x6280;&#x80FD;&#x3002;&#x8BBE;&#x8BA1;&#x548C;&#x6BD4;&#x8F83;&#x591A;&#x79CD;&#x65B9;&#x6CD5;&#x7684;&#x8FC7;&#x7A0B;&#x5C06;&#x6559;&#x60A8;&#x4F7F;&#x8BBE;&#x8BA1;&#x66F4;&#x597D;&#x6216;&#x66F4;&#x574F;&#x7684;&#x56E0;&#x7D20;&#x3002;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x6D41;&#x901D;&#xFF0C;&#x8FD9;&#x5C06;&#x4F7F;&#x60A8;&#x66F4;&#x5BB9;&#x6613;&#x6392;&#x9664;&#x4E0D;&#x826F;&#x7684;&#x8BBE;&#x8BA1;&#x5E76;&#x78E8;&#x7EC3;&#x771F;&#x6B63;&#x7684;&#x51FA;&#x8272;&#x8BBE;&#x8BA1;&#x3002;</p>
</blockquote>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="ch10.html" class="navigation navigation-prev " aria-label="Previous page: 第十章: 定义不存在的错误">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="ch12.html" class="navigation navigation-next " aria-label="Next page: 第十二章: 为什么写注释？四个理由">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第十一章: 设计它两次","level":"1.14","depth":1,"next":{"title":"第十二章: 为什么写注释？四个理由","level":"1.15","depth":1,"path":"docs/ch12.md","ref":"./docs/ch12.md","articles":[]},"previous":{"title":"第十章: 定义不存在的错误","level":"1.13","depth":1,"path":"docs/ch10.md","ref":"./docs/ch10.md","articles":[]},"dir":"ltr"},"config":{"plugins":["back-to-top-button","expandable-chapters-small","page-toc-button","livereload"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"livereload":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"page-toc-button":{},"back-to-top-button":{},"expandable-chapters-small":{},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"John Ousterhout","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"软件设计哲学","language":"zh-hans","gitbook":"*","description":"书中讨论了软件设计的主题：如何将复杂的软件系统分解成可以相对独立实现的模块(如类和方法)"},"file":{"path":"docs/ch11.md","mtime":"2020-08-06T16:26:19.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-02-06T04:55:41.669Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-page-toc-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

