
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第十二章: 为什么写注释？四个理由 · 软件设计哲学</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="John Ousterhout">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-page-toc-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="ch13.html" />
    
    
    <link rel="prev" href="ch11.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    首页
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="preface">
            
                <span>
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="ch1.html">
            
                <a href="ch1.html">
            
                    
                    第一章：介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="ch2.html">
            
                <a href="ch2.html">
            
                    
                    第二章：复杂性的本质
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="ch3.html">
            
                <a href="ch3.html">
            
                    
                    第三章：工作代码是不够的（战略与战术编程）
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="ch4.html">
            
                <a href="ch4.html">
            
                    
                    第四章：模块应该是深的
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="ch5.html">
            
                <a href="ch5.html">
            
                    
                    第五章：信息隐藏(和泄露)
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="ch6.html">
            
                <a href="ch6.html">
            
                    
                    第六章：通用模块更深入
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="ch7.html">
            
                <a href="ch7.html">
            
                    
                    第七章: 不同的层，不同的抽象
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="ch8.html">
            
                <a href="ch8.html">
            
                    
                    第八章: 降低复杂性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="ch9.html">
            
                <a href="ch9.html">
            
                    
                    第九章: 在一起更好还是分开更好？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="ch10.html">
            
                <a href="ch10.html">
            
                    
                    第十章: 定义不存在的错误
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="ch11.html">
            
                <a href="ch11.html">
            
                    
                    第十一章: 设计它两次
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.15" data-path="ch12.html">
            
                <a href="ch12.html">
            
                    
                    第十二章: 为什么写注释？四个理由
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="ch13.html">
            
                <a href="ch13.html">
            
                    
                    第十三章: 注释应该描述代码中不明显的内容
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="ch14.html">
            
                <a href="ch14.html">
            
                    
                    第十四章: 选择的名字
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="ch15.html">
            
                <a href="ch15.html">
            
                    
                    第十五章: 先写注释
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="ch16.html">
            
                <a href="ch16.html">
            
                    
                    第十六章: 修改现有的代码
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.20" data-path="ch17.html">
            
                <a href="ch17.html">
            
                    
                    第十七章: 一致性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.21" data-path="ch18.html">
            
                <a href="ch18.html">
            
                    
                    第十八章: 代码应该是显而易见的
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.22" data-path="ch19.html">
            
                <a href="ch19.html">
            
                    
                    第十九章: 软件发展趋势
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.23" data-path="ch20.html">
            
                <a href="ch20.html">
            
                    
                    第二十章: 设计性能
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.24" data-path="ch21.html">
            
                <a href="ch21.html">
            
                    
                    第二十一章: 结论
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.25" data-path="summary.html">
            
                <a href="summary.html">
            
                    
                    总结
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >第十二章: 为什么写注释？四个理由</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7B2C;-12-&#x7AE0;-&#x4E3A;&#x4EC0;&#x4E48;&#x5199;&#x6CE8;&#x91CA;&#xFF1F;&#x56DB;&#x4E2A;&#x7406;&#x7531;">&#x7B2C; 12 &#x7AE0; &#x4E3A;&#x4EC0;&#x4E48;&#x5199;&#x6CE8;&#x91CA;&#xFF1F;&#x56DB;&#x4E2A;&#x7406;&#x7531;</h1>
<blockquote>
<p>Chapter 12 Why Write Comments? The Four Excuses</p>
</blockquote>
<p>In-code documentation plays a crucial role in software design. Comments are essential to help developers understand a system and work efficiently, but the role of comments goes beyond this. Documentation also plays an important role in abstraction; without comments, you can&#x2019;t hide complexity. Finally, the process of writing comments, if done correctly, will actually improve a system&#x2019;s design. Conversely, a good software design loses much of its value if it is poorly documented.</p>
<blockquote>
<p>&#x4EE3;&#x7801;&#x5185;&#x6587;&#x6863;&#x5728;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x4E2D;&#x8D77;&#x7740;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x7684;&#x4F5C;&#x7528;&#x3002;&#x6CE8;&#x91CA;&#x5BF9;&#x4E8E;&#x5E2E;&#x52A9;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x7406;&#x89E3;&#x7CFB;&#x7EDF;&#x548C;&#x6709;&#x6548;&#x5DE5;&#x4F5C;&#x81F3;&#x5173;&#x91CD;&#x8981;&#xFF0C;&#x4F46;&#x662F;&#x6CE8;&#x91CA;&#x7684;&#x4F5C;&#x7528;&#x4E0D;&#x6B62;&#x4E8E;&#x6B64;&#x3002;&#x6587;&#x6863;&#x5728;&#x62BD;&#x8C61;&#x4E2D;&#x4E5F;&#x8D77;&#x7740;&#x91CD;&#x8981;&#x4F5C;&#x7528;&#x3002;&#x6CA1;&#x6709;&#x6CE8;&#x91CA;&#xFF0C;&#x60A8;&#x5C31;&#x65E0;&#x6CD5;&#x9690;&#x85CF;&#x590D;&#x6742;&#x6027;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x7F16;&#x5199;&#x6CE8;&#x91CA;&#x7684;&#x8FC7;&#x7A0B;&#xFF08;&#x5982;&#x679C;&#x6B63;&#x786E;&#x5B8C;&#x6210;&#xFF09;&#x5C06;&#x5B9E;&#x9645;&#x4E0A;&#x6539;&#x5584;&#x7CFB;&#x7EDF;&#x7684;&#x8BBE;&#x8BA1;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x5F88;&#x597D;&#x7684;&#x6587;&#x6863;&#x8BB0;&#x5F55;&#xFF0C;&#x90A3;&#x4E48;&#x597D;&#x7684;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x4F1A;&#x5931;&#x53BB;&#x5F88;&#x591A;&#x4EF7;&#x503C;&#x3002;</p>
</blockquote>
<p>Unfortunately, this view is not universally shared. A significant fraction of production code contains essentially no comments. Many developers think that comments are a waste of time; others see the value in comments, but somehow never get around to writing them. Fortunately, many development teams recognize the value of documentation, and it feels like the prevalence of these teams is gradually increasing. However, even in teams that encourage documentation, comments are often viewed as drudge work and many developers don&#x2019;t understand how to write them, so the resulting documentation is often mediocre. Inadequate documentation creates a huge and unnecessary drag on software development.</p>
<blockquote>
<p>&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x8FD9;&#x79CD;&#x89C2;&#x70B9;&#x5E76;&#x672A;&#x5F97;&#x5230;&#x666E;&#x904D;&#x8BA4;&#x540C;&#x3002;&#x751F;&#x4EA7;&#x4EE3;&#x7801;&#x7684;&#x5F88;&#x5927;&#x4E00;&#x90E8;&#x5206;&#x57FA;&#x672C;&#x4E0A;&#x4E0D;&#x5305;&#x542B;&#x4EFB;&#x4F55;&#x6CE8;&#x91CA;&#x3002;&#x8BB8;&#x591A;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x8BA4;&#x4E3A;&#x6CE8;&#x91CA;&#x662F;&#x6D6A;&#x8D39;&#x65F6;&#x95F4;&#x3002;&#x5176;&#x4ED6;&#x4EBA;&#x5219;&#x770B;&#x5230;&#x4E86;&#x6CE8;&#x91CA;&#x4E2D;&#x7684;&#x4EF7;&#x503C;&#xFF0C;&#x4F46;&#x4E0D;&#x77E5;&#x4F55;&#x6545;&#x4ECE;&#x4E0D;&#x52A8;&#x624B;&#x7F16;&#x5199;&#x5B83;&#x4EEC;&#x3002;&#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;&#x8BB8;&#x591A;&#x5F00;&#x53D1;&#x56E2;&#x961F;&#x8BA4;&#x8BC6;&#x5230;&#x4E86;&#x6587;&#x6863;&#x7684;&#x4EF7;&#x503C;&#xFF0C;&#x5E76;&#x4E14;&#x611F;&#x89C9;&#x8FD9;&#x4E9B;&#x56E2;&#x961F;&#x7684;&#x666E;&#x53CA;&#x7387;&#x6B63;&#x5728;&#x9010;&#x6E10;&#x63D0;&#x9AD8;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5373;&#x4F7F;&#x5728;&#x9F13;&#x52B1;&#x6587;&#x6863;&#x7684;&#x56E2;&#x961F;&#x4E2D;&#xFF0C;&#x6CE8;&#x91CA;&#x4E5F;&#x7ECF;&#x5E38;&#x88AB;&#x89C6;&#x4E3A;&#x7E41;&#x7410;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x800C;&#x4E14;&#x8BB8;&#x591A;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x4E5F;&#x4E0D;&#x4E86;&#x89E3;&#x5982;&#x4F55;&#x7F16;&#x5199;&#x6CE8;&#x91CA;&#xFF0C;&#x56E0;&#x6B64;&#x751F;&#x6210;&#x7684;&#x6587;&#x6863;&#x901A;&#x5E38;&#x662F;&#x5E73;&#x5EB8;&#x7684;&#x3002;&#x6587;&#x6863;&#x4E0D;&#x8DB3;&#x4F1A;&#x7ED9;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x5E26;&#x6765;&#x5DE8;&#x5927;&#x4E14;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x62D6;&#x7D2F;&#x3002;</p>
</blockquote>
<p>In this chapter I will discuss the excuses developers use to avoid writing comments, and the reasons why comments really do matter. Chapter 13 will then describe how to write good comments and the next few chapters after that will discuss related issues such as choosing variable names and how to use documentation to improve a system&#x2019;s design. I hope these chapters will convince you of three things: good comments can make a big difference in the overall quality of software; it isn&#x2019;t hard to write good comments; and (this may be hard to believe) writing comments can actually be fun.</p>
<blockquote>
<p>&#x5728;&#x672C;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x5C06;&#x8BA8;&#x8BBA;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x907F;&#x514D;&#x5199;&#x6CE8;&#x91CA;&#x7684;&#x501F;&#x53E3;&#xFF0C;&#x4EE5;&#x53CA;&#x6CE8;&#x91CA;&#x771F;&#x6B63;&#x91CD;&#x8981;&#x7684;&#x539F;&#x56E0;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x7B2C; 13 &#x7AE0;&#x5C06;&#x63CF;&#x8FF0;&#x5982;&#x4F55;&#x7F16;&#x5199;&#x597D;&#x7684;&#x6CE8;&#x91CA;&#xFF0C;&#x5176;&#x540E;&#x7684;&#x51E0;&#x7AE0;&#x5C06;&#x8BA8;&#x8BBA;&#x76F8;&#x5173;&#x95EE;&#x9898;&#xFF0C;&#x4F8B;&#x5982;&#x9009;&#x62E9;&#x53D8;&#x91CF;&#x540D;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x6587;&#x6863;&#x6765;&#x6539;&#x8FDB;&#x7CFB;&#x7EDF;&#x7684;&#x8BBE;&#x8BA1;&#x3002;&#x6211;&#x5E0C;&#x671B;&#x8FD9;&#x4E9B;&#x7AE0;&#x8282;&#x80FD;&#x4F7F;&#x60A8;&#x76F8;&#x4FE1;&#x4E09;&#x4EF6;&#x4E8B;&#xFF1A;&#x597D;&#x7684;&#x6CE8;&#x91CA;&#x53EF;&#x4EE5;&#x5BF9;&#x8F6F;&#x4EF6;&#x7684;&#x6574;&#x4F53;&#x8D28;&#x91CF;&#x4EA7;&#x751F;&#x5F88;&#x5927;&#x7684;&#x5F71;&#x54CD;&#xFF1B;&#x5199;&#x597D;&#x6CE8;&#x91CA;&#x5E76;&#x4E0D;&#x96BE;&#xFF1B;&#x5E76;&#x4E14;&#xFF08;&#x53EF;&#x80FD;&#x5F88;&#x96BE;&#x76F8;&#x4FE1;&#xFF09;&#x5199;&#x6CE8;&#x91CA;&#x5B9E;&#x9645;&#x4E0A;&#x5F88;&#x6709;&#x8DA3;&#x3002;</p>
</blockquote>
<p>When developers don&#x2019;t write comments, they usually justify their behavior with one or more of the following excuses:</p>
<blockquote>
<p>&#x5F53;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x4E0D;&#x5199;&#x6CE8;&#x91CA;&#x65F6;&#xFF0C;&#x4ED6;&#x4EEC;&#x901A;&#x5E38;&#x4F1A;&#x4EE5;&#x4EE5;&#x4E0B;&#x4E00;&#x79CD;&#x6216;&#x591A;&#x79CD;&#x501F;&#x53E3;&#x4E3A;&#x81EA;&#x5DF1;&#x7684;&#x884C;&#x4E3A;&#x8FA9;&#x62A4;&#xFF1A;</p>
</blockquote>
<ul>
<li>&#x201C;Good code is self-documenting.&#x201D;</li>
<li>&#x201C;I don&#x2019;t have time to write comments.&#x201D;</li>
<li>&#x201C;Comments get out of date and become misleading.&#x201D;</li>
<li>&#x201C;The comments I have seen are all worthless; why bother?&#x201D; In the sections below I will address each of these excuses in turn.</li>
</ul>
<hr>
<blockquote>
<ul>
<li>&#x201C;&#x597D;&#x7684;&#x4EE3;&#x7801;&#x53EF;&#x4EE5;&#x81EA;&#x6211;&#x8BB0;&#x5F55;&#x3002;&#x201D;</li>
<li>&#x201C;&#x6211;&#x6CA1;&#x6709;&#x65F6;&#x95F4;&#x5199;&#x6CE8;&#x91CA;&#x3002;&#x201D;</li>
<li>&#x201C;&#x6CE8;&#x91CA;&#x8FC7;&#x65F6;&#xFF0C;&#x5E76;&#x4F1A;&#x4EA7;&#x751F;&#x8BEF;&#x5BFC;&#x3002;&#x201D;</li>
<li>&#x201C;&#x6211;&#x6240;&#x770B;&#x5230;&#x7684;&#x6CE8;&#x91CA;&#x90FD;&#x662F;&#x6BEB;&#x65E0;&#x4EF7;&#x503C;&#x7684;&#xFF1B;&#x4F55;&#x5FC5;&#xFF1F;&#x201D; &#x5728;&#x4EE5;&#x4E0B;&#x5404;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x5C06;&#x4F9D;&#x6B21;&#x8BA8;&#x8BBA;&#x8FD9;&#x4E9B;&#x501F;&#x53E3;&#x3002;</li>
</ul>
</blockquote>
<h2 id="121-good-code-is-self-documenting-&#x597D;&#x7684;&#x4EE3;&#x7801;&#x53EF;&#x4EE5;&#x81EA;&#x6211;&#x8BB0;&#x5F55;">12.1 Good code is self-documenting &#x597D;&#x7684;&#x4EE3;&#x7801;&#x53EF;&#x4EE5;&#x81EA;&#x6211;&#x8BB0;&#x5F55;</h2>
<p>Some people believe that if code is written well, it is so obvious that no comments are needed. This is a delicious myth, like a rumor that ice cream is good for your health: we&#x2019;d really like to believe it! Unfortunately, it&#x2019;s simply not true. To be sure, there are things you can do when writing code to reduce the need for comments, such as choosing good variable names (see Chapter 14). Nonetheless, there is still a significant amount of design information that can&#x2019;t be represented in code. For example, only a small part of a class&#x2019;s interface, such as the signatures of its methods, can be specified formally in the code. The informal aspects of an interface, such as a high-level description of what each method does or the meaning of its result, can only be described in comments. There are many other examples of things that can&#x2019;t be described in the code, such as the rationale for a particular design decision, or the conditions under which it makes sense to call a particular method.</p>
<blockquote>
<p>&#x6709;&#x4EBA;&#x8BA4;&#x4E3A;&#xFF0C;&#x5982;&#x679C;&#x4EE3;&#x7801;&#x7F16;&#x5199;&#x5F97;&#x5F53;&#xFF0C;&#x90A3;&#x4E48;&#x663E;&#x800C;&#x6613;&#x89C1;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x6CE8;&#x91CA;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x7F8E;&#x5473;&#x7684;&#x795E;&#x8BDD;&#xFF0C;&#x5C31;&#x50CF;&#x8C23;&#x8A00;&#x8BF4;&#x51B0;&#x6DC7;&#x6DCB;&#x5BF9;&#x60A8;&#x7684;&#x5065;&#x5EB7;&#x6709;&#x76CA;&#xFF1A;&#x6211;&#x4EEC;&#x771F;&#x7684;&#x5F88;&#x60F3;&#x76F8;&#x4FE1;&#xFF01;&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x4E8B;&#x5B9E;&#x5E76;&#x975E;&#x5982;&#x6B64;&#x3002;&#x53EF;&#x4EE5;&#x80AF;&#x5B9A;&#x7684;&#x662F;&#xFF0C;&#x5728;&#x7F16;&#x5199;&#x4EE3;&#x7801;&#x65F6;&#x53EF;&#x4EE5;&#x505A;&#x4E00;&#x4E9B;&#x4E8B;&#x60C5;&#x6765;&#x51CF;&#x5C11;&#x5BF9;&#x6CE8;&#x91CA;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x4F8B;&#x5982;&#x9009;&#x62E9;&#x597D;&#x7684;&#x53D8;&#x91CF;&#x540D;&#xFF08;&#x8BF7;&#x53C2;&#x9605;&#x7B2C; 14 &#x7AE0;&#xFF09;&#x3002;&#x5C3D;&#x7BA1;&#x5982;&#x6B64;&#xFF0C;&#x4ECD;&#x6709;&#x5927;&#x91CF;&#x8BBE;&#x8BA1;&#x4FE1;&#x606F;&#x65E0;&#x6CD5;&#x7528;&#x4EE3;&#x7801;&#x8868;&#x793A;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x53EA;&#x80FD;&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#x6B63;&#x5F0F;&#x6307;&#x5B9A;&#x7C7B;&#x63A5;&#x53E3;&#x7684;&#x4E00;&#x5C0F;&#x90E8;&#x5206;&#xFF0C;&#x4F8B;&#x5982;&#x5176;&#x65B9;&#x6CD5;&#x7684;&#x7B7E;&#x540D;&#x3002;&#x63A5;&#x53E3;&#x7684;&#x975E;&#x6B63;&#x5F0F;&#x65B9;&#x9762;&#xFF0C;&#x4F8B;&#x5982;&#x5BF9;&#x6BCF;&#x79CD;&#x65B9;&#x6CD5;&#x7684;&#x4F5C;&#x7528;&#x6216;&#x5176;&#x7ED3;&#x679C;&#x542B;&#x4E49;&#x7684;&#x9AD8;&#x7EA7;&#x63CF;&#x8FF0;&#xFF0C;&#x53EA;&#x80FD;&#x5728;&#x6CE8;&#x91CA;&#x4E2D;&#x63CF;&#x8FF0;&#x3002;</p>
</blockquote>
<p>Some developers argue that if others want to know what a method does, they should just read the code of the method: this will be more accurate than any comment. It&#x2019;s possible that a reader could deduce the abstract interface of the method by reading its code, but it would be time-consuming and painful. In addition, if you write code with the expectation that users will read method implementations, you will try to make each method as short as possible, so that it&#x2019;s easy to read. If the method does anything nontrivial, you will break it up into several smaller methods. This will result in a large number of shallow methods. Furthermore, it doesn&#x2019;t really make the code easier to read: in order to understand the behavior of the top-level method, readers will probably need to understand the behaviors of the nested methods. For large systems it isn&#x2019;t practical for users to read the code to learn the behavior.</p>
<blockquote>
<p>&#x4E00;&#x4E9B;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x8BA4;&#x4E3A;&#xFF0C;&#x5982;&#x679C;&#x5176;&#x4ED6;&#x4EBA;&#x60F3;&#x77E5;&#x9053;&#x67D0;&#x4E2A;&#x65B9;&#x6CD5;&#x7684;&#x4F5C;&#x7528;&#xFF0C;&#x90A3;&#x4E48;&#x4ED6;&#x4EEC;&#x5E94;&#x8BE5;&#x53EA;&#x9605;&#x8BFB;&#x8BE5;&#x65B9;&#x6CD5;&#x7684;&#x4EE3;&#x7801;&#xFF1A;&#x8FD9;&#x5C06;&#x6BD4;&#x4EFB;&#x4F55;&#x6CE8;&#x91CA;&#x90FD;&#x66F4;&#x51C6;&#x786E;&#x3002;&#x8BFB;&#x8005;&#x53EF;&#x80FD;&#x4F1A;&#x901A;&#x8FC7;&#x9605;&#x8BFB;&#x5176;&#x4EE3;&#x7801;&#x6765;&#x63A8;&#x65AD;&#x8BE5;&#x65B9;&#x6CD5;&#x7684;&#x62BD;&#x8C61;&#x63A5;&#x53E3;&#xFF0C;&#x4F46;&#x8FD9;&#x65E2;&#x8D39;&#x65F6;&#x53C8;&#x75DB;&#x82E6;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x5982;&#x679C;&#x5728;&#x7F16;&#x5199;&#x4EE3;&#x7801;&#x65F6;&#x671F;&#x671B;&#x7528;&#x6237;&#x4F1A;&#x9605;&#x8BFB;&#x65B9;&#x6CD5;&#x5B9E;&#x73B0;&#xFF0C;&#x5219;&#x5C06;&#x5C1D;&#x8BD5;&#x4F7F;&#x6BCF;&#x4E2A;&#x65B9;&#x6CD5;&#x5C3D;&#x53EF;&#x80FD;&#x77ED;&#xFF0C;&#x4EE5;&#x4FBF;&#x4E8E;&#x9605;&#x8BFB;&#x3002;&#x5982;&#x679C;&#x8BE5;&#x65B9;&#x6CD5;&#x6267;&#x884C;&#x4E86;&#x4E00;&#x4E9B;&#x91CD;&#x8981;&#x64CD;&#x4F5C;&#xFF0C;&#x5219;&#x5C06;&#x5176;&#x5206;&#x89E3;&#x4E3A;&#x51E0;&#x4E2A;&#x8F83;&#x5C0F;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x8FD9;&#x5C06;&#x5BFC;&#x81F4;&#x5927;&#x91CF;&#x6D45;&#x5C42;&#x65B9;&#x6CD5;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x5B83;&#x5E76;&#x6CA1;&#x6709;&#x771F;&#x6B63;&#x4F7F;&#x4EE3;&#x7801;&#x66F4;&#x6613;&#x4E8E;&#x9605;&#x8BFB;&#xFF1A;&#x4E3A;&#x4E86;&#x7406;&#x89E3;&#x9876;&#x5C42;&#x65B9;&#x6CD5;&#x7684;&#x884C;&#x4E3A;&#xFF0C;&#x8BFB;&#x8005;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x4E86;&#x89E3;&#x5D4C;&#x5957;&#x65B9;&#x6CD5;&#x7684;&#x884C;&#x4E3A;&#x3002;</p>
</blockquote>
<p>Moreover, comments are fundamental to abstractions. Recall from Chapter 4 that the goal of abstractions is to hide complexity: an abstraction is a simplified view of an entity, which preserves essential information but omits details that can safely be ignored. If users must read the code of a method in order to use it, then there is no abstraction: all of the complexity of the method is exposed. Without comments, the only abstraction of a method is its declaration, which specifies its name and the names and types of its arguments and results. The declaration is missing too much essential information to provide a useful abstraction by itself. For example, a method to extract a substring might have two arguments, start and end, indicating the range of characters to extract. From the declaration alone, it isn&#x2019;t possible to tell whether the extracted substring will include the character indicated by end, or what happens if start &gt; end. Comments allow us to capture the additional information that callers need, thereby completing the simplified view while hiding implementation details. It&#x2019;s also important that comments are written in a human language such as English; this makes them less precise than code, but it provides more expressive power, so we can create simple, intuitive descriptions. If you want to use abstractions to hide complexity, comments are essential.</p>
<blockquote>
<p>&#x6B64;&#x5916;&#xFF0C;&#x6CE8;&#x91CA;&#x662F;&#x62BD;&#x8C61;&#x7684;&#x57FA;&#x7840;&#x3002;&#x56DE;&#x987E;&#x7B2C;&#x56DB;&#x7AE0;&#xFF0C;&#x62BD;&#x8C61;&#x7684;&#x76EE;&#x7684;&#x662F;&#x9690;&#x85CF;&#x590D;&#x6742;&#x6027;&#xFF1A;&#x62BD;&#x8C61;&#x662F;&#x5B9E;&#x4F53;&#x7684;&#x7B80;&#x5316;&#x89C6;&#x56FE;&#xFF0C;&#x8BE5;&#x5B9E;&#x4F53;&#x4FDD;&#x7559;&#x5FC5;&#x8981;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x4F46;&#x5FFD;&#x7565;&#x4E86;&#x53EF;&#x4EE5;&#x5B89;&#x5168;&#x5FFD;&#x7565;&#x7684;&#x7EC6;&#x8282;&#x3002;&#x5982;&#x679C;&#x7528;&#x6237;&#x5FC5;&#x987B;&#x9605;&#x8BFB;&#x65B9;&#x6CD5;&#x7684;&#x4EE3;&#x7801;&#x624D;&#x80FD;&#x4F7F;&#x7528;&#x5B83;&#xFF0C;&#x5219;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x62BD;&#x8C61;&#xFF1A;&#x65B9;&#x6CD5;&#x7684;&#x6240;&#x6709;&#x590D;&#x6742;&#x6027;&#x90FD;&#x5C06;&#x66B4;&#x9732;&#x51FA;&#x6765;&#x3002;&#x6CA1;&#x6709;&#x6CE8;&#x91CA;&#xFF0C;&#x65B9;&#x6CD5;&#x7684;&#x552F;&#x4E00;&#x62BD;&#x8C61;&#x5C31;&#x662F;&#x5176;&#x58F0;&#x660E;&#xFF0C;&#x8BE5;&#x58F0;&#x660E;&#x6307;&#x5B9A;&#x5176;&#x540D;&#x79F0;&#x4EE5;&#x53CA;&#x5176;&#x53C2;&#x6570;&#x548C;&#x7ED3;&#x679C;&#x7684;&#x540D;&#x79F0;&#x548C;&#x7C7B;&#x578B;&#x3002;&#x8BE5;&#x58F0;&#x660E;&#x7F3A;&#x5C11;&#x592A;&#x591A;&#x57FA;&#x672C;&#x4FE1;&#x606F;&#xFF0C;&#x65E0;&#x6CD5;&#x5355;&#x72EC;&#x63D0;&#x4F9B;&#x6709;&#x7528;&#x7684;&#x62BD;&#x8C61;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x63D0;&#x53D6;&#x5B50;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x65B9;&#x6CD5;&#x53EF;&#x80FD;&#x6709;&#x4E24;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x5F00;&#x59CB;&#x548C;&#x7ED3;&#x675F;&#xFF0C;&#x8868;&#x793A;&#x8981;&#x63D0;&#x53D6;&#x7684;&#x5B57;&#x7B26;&#x8303;&#x56F4;&#x3002;&#x4EC5;&#x51ED;&#x5BA3;&#x8A00;&#xFF0C;&#x65E0;&#x6CD5;&#x786E;&#x5B9A;&#x63D0;&#x53D6;&#x7684;&#x5B50;&#x5B57;&#x7B26;&#x4E32;&#x662F;&#x5426;&#x5C06;&#x5305;&#x542B; end &#x6307;&#x793A;&#x7684;&#x5B57;&#x7B26;&#xFF0C;&#x6216;&#x8005;&#x5982;&#x679C; start&gt; end &#x4F1A;&#x53D1;&#x751F;&#x4EC0;&#x4E48;&#x3002;&#x6CE8;&#x91CA;&#x4F7F;&#x6211;&#x4EEC;&#x80FD;&#x591F;&#x6355;&#x83B7;&#x8C03;&#x7528;&#x8005;&#x6240;&#x9700;&#x7684;&#x5176;&#x4ED6;&#x4FE1;&#x606F;&#xFF0C;&#x4ECE;&#x800C;&#x5728;&#x9690;&#x85CF;&#x5B9E;&#x73B0;&#x7EC6;&#x8282;&#x7684;&#x540C;&#x65F6;&#x5B8C;&#x6210;&#x7B80;&#x5316;&#x7684;&#x89C6;&#x56FE;&#x3002;&#x7528;&#x4EBA;&#x7C7B;&#x8BED;&#x8A00;&#xFF08;&#x4F8B;&#x5982;&#x82F1;&#x8BED;&#xFF09;&#x5199;&#x6CE8;&#x91CA;&#x4E5F;&#x5F88;&#x91CD;&#x8981;&#xFF1B;&#x8FD9;&#x4F7F;&#x5B83;&#x4EEC;&#x4E0D;&#x5982;&#x4EE3;&#x7801;&#x7CBE;&#x786E;&#xFF0C;&#x4F46;&#x63D0;&#x4F9B;&#x4E86;&#x66F4;&#x591A;&#x7684;&#x8868;&#x8FBE;&#x80FD;&#x529B;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x7B80;&#x5355;&#x76F4;&#x89C2;&#x7684;&#x63CF;&#x8FF0;&#x3002;&#x5982;&#x679C;&#x8981;&#x4F7F;&#x7528;&#x62BD;&#x8C61;&#x6765;&#x9690;&#x85CF;&#x590D;&#x6742;&#x6027;&#xFF0C;&#x5219;&#x6CE8;&#x91CA;&#x5FC5;&#x4E0D;&#x53EF;&#x5C11;&#x3002;</p>
</blockquote>
<h2 id="122-i-dont-have-time-to-write-comments-&#x6211;&#x6CA1;&#x6709;&#x65F6;&#x95F4;&#x5199;&#x6CE8;&#x91CA;">12.2 I don&#x2019;t have time to write comments &#x6211;&#x6CA1;&#x6709;&#x65F6;&#x95F4;&#x5199;&#x6CE8;&#x91CA;</h2>
<p>It&#x2019;s tempting to prioritize comments lower than other development tasks. Given a choice between adding a new feature and documenting an existing feature, it seems logical to choose the new feature. However, software projects are almost always under time pressure, and there will always be things that seem higher priority than writing comments. Thus, if you allow documentation to be de-prioritized, you&#x2019;ll end up with no documentation.</p>
<blockquote>
<p>&#x4F18;&#x5148;&#x8003;&#x8651;&#x4F4E;&#x4E8E;&#x5176;&#x4ED6;&#x5F00;&#x53D1;&#x4EFB;&#x52A1;&#x7684;&#x6CE8;&#x91CA;&#x662F;&#x5F88;&#x8BF1;&#x4EBA;&#x7684;&#x3002;&#x5728;&#x6DFB;&#x52A0;&#x65B0;&#x529F;&#x80FD;&#x548C;&#x8BB0;&#x5F55;&#x73B0;&#x6709;&#x529F;&#x80FD;&#x4E4B;&#x95F4;&#x505A;&#x51FA;&#x9009;&#x62E9;&#x4E4B;&#x540E;&#xFF0C;&#x9009;&#x62E9;&#x65B0;&#x529F;&#x80FD;&#x4F3C;&#x4E4E;&#x5408;&#x4E4E;&#x903B;&#x8F91;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x8F6F;&#x4EF6;&#x9879;&#x76EE;&#x51E0;&#x4E4E;&#x603B;&#x662F;&#x5904;&#x4E8E;&#x65F6;&#x95F4;&#x538B;&#x529B;&#x4E4B;&#x4E0B;&#xFF0C;&#x5E76;&#x4E14;&#x603B;&#x4F1A;&#x6709;&#x6BD4;&#x7F16;&#x5199;&#x6CE8;&#x91CA;&#x4F18;&#x5148;&#x7EA7;&#x66F4;&#x9AD8;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5982;&#x679C;&#x60A8;&#x5141;&#x8BB8;&#x53D6;&#x6D88;&#x5BF9;&#x6587;&#x6863;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#xFF0C;&#x5219;&#x6700;&#x7EC8;&#x5C06;&#x6CA1;&#x6709;&#x6587;&#x6863;&#x3002;</p>
</blockquote>
<p>The counter-argument to this excuse is the investment mindset discussed on page 15. If you want a clean software structure, which will allow you to work efficiently over the long-term, then you must take some extra time up front in order to create that structure. Good comments make a huge difference in the maintainability of software, so the effort spent on them will pay for itself quickly. Furthermore, writing comments needn&#x2019;t take a lot of time. Ask yourself how much of your development time you spend typing in code (as opposed to designing, compiling, testing, etc.), assuming you don&#x2019;t include any comments; I doubt that the answer is more than 10%. Now suppose that you spend as much time typing comments as typing code; this should be a safe upper bound. With these assumptions, writing good comments won&#x2019;t add more than about 10% to your development time. The benefits of having good documentation will quickly offset this cost.</p>
<blockquote>
<p>&#x4E0E;&#x8BE5;&#x501F;&#x53E3;&#x76F8;&#x53CD;&#x7684;&#x662F;&#x7B2C; 15 &#x9875;&#x4E0A;&#x8BA8;&#x8BBA;&#x7684;&#x6295;&#x8D44;&#x601D;&#x8DEF;&#x3002;&#x5982;&#x679C;&#x60A8;&#x60F3;&#x8981;&#x4E00;&#x4E2A;&#x5E72;&#x51C0;&#x7684;&#x8F6F;&#x4EF6;&#x7ED3;&#x6784;&#xFF0C;&#x53EF;&#x4EE5;&#x957F;&#x671F;&#x6709;&#x6548;&#x5730;&#x5DE5;&#x4F5C;&#xFF0C;&#x90A3;&#x4E48;&#x60A8;&#x5FC5;&#x987B;&#x82B1;&#x4E00;&#x4E9B;&#x989D;&#x5916;&#x7684;&#x65F6;&#x95F4;&#x624D;&#x80FD;&#x521B;&#x5EFA;&#x8BE5;&#x7ED3;&#x6784;&#x3002;&#x597D;&#x7684;&#x6CE8;&#x91CA;&#x5BF9;&#x8F6F;&#x4EF6;&#x7684;&#x53EF;&#x7EF4;&#x62A4;&#x6027;&#x6709;&#x5F88;&#x5927;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x56E0;&#x6B64;&#x82B1;&#x8D39;&#x5728;&#x5B83;&#x4EEC;&#x4E0A;&#x9762;&#x7684;&#x7CBE;&#x529B;&#x5C06;&#x5F88;&#x5FEB;&#x6536;&#x56DE;&#x6210;&#x672C;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x64B0;&#x5199;&#x6CE8;&#x91CA;&#x4E0D;&#x9700;&#x8981;&#x82B1;&#x8D39;&#x5F88;&#x591A;&#x65F6;&#x95F4;&#x3002;&#x8BE2;&#x95EE;&#x81EA;&#x5DF1;&#xFF0C;&#x5047;&#x8BBE;&#x60A8;&#x4E0D;&#x5305;&#x542B;&#x4EFB;&#x4F55;&#x6CE8;&#x91CA;&#xFF0C;&#x90A3;&#x4E48;&#x60A8;&#x82B1;&#x8D39;&#x4E86;&#x591A;&#x5C11;&#x5F00;&#x53D1;&#x65F6;&#x95F4;&#x6765;&#x952E;&#x5165;&#x4EE3;&#x7801;&#xFF08;&#x4E0E;&#x8BBE;&#x8BA1;&#xFF0C;&#x7F16;&#x8BD1;&#xFF0C;&#x6D4B;&#x8BD5;&#x7B49;&#x76F8;&#x5BF9;&#xFF09;&#x3002;&#x6211;&#x6000;&#x7591;&#x7B54;&#x6848;&#x662F;&#x5426;&#x8D85;&#x8FC7; 10&#xFF05;&#x3002;&#x73B0;&#x5728;&#x5047;&#x8BBE;&#x60A8;&#x82B1;&#x5728;&#x8F93;&#x5165;&#x6CE8;&#x91CA;&#x4E0A;&#x7684;&#x65F6;&#x95F4;&#x4E0E;&#x8F93;&#x5165;&#x4EE3;&#x7801;&#x6240;&#x82B1;&#x8D39;&#x7684;&#x65F6;&#x95F4;&#x4E00;&#x6837;&#x591A;&#x3002;&#x8FD9;&#x5E94;&#x8BE5;&#x662F;&#x4E00;&#x4E2A;&#x5B89;&#x5168;&#x7684;&#x4E0A;&#x9650;&#x3002;&#x57FA;&#x4E8E;&#x8FD9;&#x4E9B;&#x5047;&#x8BBE;&#xFF0C;&#x64B0;&#x5199;&#x597D;&#x7684;&#x6CE8;&#x91CA;&#x4E0D;&#x4F1A;&#x589E;&#x52A0;&#x60A8;&#x7684;&#x5F00;&#x53D1;&#x65F6;&#x95F4;&#x7EA6; 10&#xFF05;&#x3002;&#x62E5;&#x6709;&#x826F;&#x597D;&#x6587;&#x6863;&#x7684;&#x597D;&#x5904;&#x5C06;&#x8FC5;&#x901F;&#x62B5;&#x6D88;&#x8FD9;&#x4E00;&#x6210;&#x672C;&#x3002;</p>
</blockquote>
<p>Furthermore, many of the most important comments are those related to abstractions, such as the top-level documentation for classes and methods. Chapter 15 will argue that these comments should be written as part of the design process, and that the act of writing the documentation serves as an important design tool that improves the overall design. These comments pay for themselves immediately.</p>
<blockquote>
<p>&#x6B64;&#x5916;&#xFF0C;&#x8BB8;&#x591A;&#x6700;&#x91CD;&#x8981;&#x7684;&#x6CE8;&#x91CA;&#x662F;&#x4E0E;&#x62BD;&#x8C61;&#x6709;&#x5173;&#x7684;&#x6CE8;&#x91CA;&#xFF0C;&#x4F8B;&#x5982;&#x7C7B;&#x548C;&#x65B9;&#x6CD5;&#x7684;&#x9876;&#x7EA7;&#x6587;&#x6863;&#x3002;&#x7B2C; 15 &#x7AE0;&#x8BA4;&#x4E3A;&#xFF0C;&#x8FD9;&#x4E9B;&#x6CE8;&#x91CA;&#x5E94;&#x4F5C;&#x4E3A;&#x8BBE;&#x8BA1;&#x8FC7;&#x7A0B;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x7F16;&#x5199;&#xFF0C;&#x5E76;&#x4E14;&#x7F16;&#x5199;&#x6587;&#x6863;&#x7684;&#x884C;&#x4E3A;&#x662F;&#x6539;&#x5584;&#x6574;&#x4F53;&#x8BBE;&#x8BA1;&#x7684;&#x91CD;&#x8981;&#x8BBE;&#x8BA1;&#x5DE5;&#x5177;&#x3002;&#x8FD9;&#x4E9B;&#x6CE8;&#x91CA;&#x7ACB;&#x5373;&#x4ED8;&#x8BF8;&#x884C;&#x52A8;&#x3002;</p>
</blockquote>
<h2 id="123-comments-get-out-of-date-and-become-misleading-&#x6CE8;&#x91CA;&#x8FC7;&#x65F6;&#x5E76;&#x4EA7;&#x751F;&#x8BEF;&#x5BFC;">12.3 Comments get out of date and become misleading &#x6CE8;&#x91CA;&#x8FC7;&#x65F6;&#x5E76;&#x4EA7;&#x751F;&#x8BEF;&#x5BFC;</h2>
<p>Comments do sometimes get out of date, but this need not be a major problem in practice. Keeping documentation up-to-date does not require an enormous effort. Large changes to the documentation are only required if there have been large changes to the code, and the code changes will take more time than the documentation changes. Chapter 16 discusses how to organize documentation so that it is as easy as possible to keep it updated after code modifications (the key ideas are to avoid duplicated documentation and keep the documentation close to the corresponding code). Code reviews provide a great mechanism for detecting and fixing stale comments.</p>
<blockquote>
<p>&#x6CE8;&#x91CA;&#x6709;&#x65F6;&#x786E;&#x5B9E;&#x4F1A;&#x8FC7;&#x65F6;&#xFF0C;&#x4F46;&#x8FD9;&#x5B9E;&#x9645;&#x4E0A;&#x5E76;&#x4E0D;&#x662F;&#x4E3B;&#x8981;&#x95EE;&#x9898;&#x3002;&#x4F7F;&#x6587;&#x6863;&#x4FDD;&#x6301;&#x6700;&#x65B0;&#x72B6;&#x6001;&#x5E76;&#x4E0D;&#x9700;&#x8981;&#x4ED8;&#x51FA;&#x5DE8;&#x5927;&#x7684;&#x52AA;&#x529B;&#x3002;&#x4EC5;&#x5F53;&#x5BF9;&#x4EE3;&#x7801;&#x8FDB;&#x884C;&#x4E86;&#x8F83;&#x5927;&#x7684;&#x66F4;&#x6539;&#x65F6;&#x624D;&#x9700;&#x8981;&#x5BF9;&#x6587;&#x6863;&#x8FDB;&#x884C;&#x5927;&#x7684;&#x66F4;&#x6539;&#xFF0C;&#x5E76;&#x4E14;&#x4EE3;&#x7801;&#x66F4;&#x6539;&#x5C06;&#x6BD4;&#x6587;&#x6863;&#x7684;&#x66F4;&#x6539;&#x82B1;&#x8D39;&#x66F4;&#x591A;&#x7684;&#x65F6;&#x95F4;&#x3002;&#x7B2C; 16 &#x7AE0;&#x8BA8;&#x8BBA;&#x4E86;&#x5982;&#x4F55;&#x7EC4;&#x7EC7;&#x6587;&#x6863;&#xFF0C;&#x4EE5;&#x4FBF;&#x5728;&#x4FEE;&#x6539;&#x4EE3;&#x7801;&#x540E;&#x5C3D;&#x53EF;&#x80FD;&#x5BB9;&#x6613;&#x5730;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x66F4;&#x65B0;&#xFF08;&#x4E3B;&#x8981;&#x601D;&#x60F3;&#x662F;&#x907F;&#x514D;&#x91CD;&#x590D;&#x7684;&#x6587;&#x6863;&#x5E76;&#x4F7F;&#x6587;&#x6863;&#x4E0E;&#x76F8;&#x5E94;&#x7684;&#x4EE3;&#x7801;&#x4FDD;&#x6301;&#x4E00;&#x81F4;&#xFF09;&#x3002;&#x4EE3;&#x7801;&#x5BA1;&#x67E5;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x79CD;&#x68C0;&#x6D4B;&#x548C;&#x4FEE;&#x590D;&#x9648;&#x65E7;&#x6CE8;&#x91CA;&#x7684;&#x5F3A;&#x5927;&#x673A;&#x5236;&#x3002;</p>
</blockquote>
<h2 id="124-all-the-comments-i-have-seen-are-worthless-&#x6211;&#x6240;&#x770B;&#x5230;&#x7684;&#x6240;&#x6709;&#x6CE8;&#x91CA;&#x90FD;&#x662F;&#x6BEB;&#x65E0;&#x4EF7;&#x503C;&#x7684;">12.4 All the comments I have seen are worthless &#x6211;&#x6240;&#x770B;&#x5230;&#x7684;&#x6240;&#x6709;&#x6CE8;&#x91CA;&#x90FD;&#x662F;&#x6BEB;&#x65E0;&#x4EF7;&#x503C;&#x7684;</h2>
<p>Of the four excuses, this is probably the one with the most merit. Every software developer has seen comments that provide no useful information, and most existing documentation is so-so at best. Fortunately, this problem is solvable; writing solid documentation is not hard, once you know how. The next chapters will lay out a framework for how to write good documentation and maintain it over time.</p>
<blockquote>
<p>&#x5728;&#x8FD9;&#x56DB;&#x4E2A;&#x501F;&#x53E3;&#x4E2D;&#xFF0C;&#x8FD9;&#x53EF;&#x80FD;&#x662F;&#x6700;&#x6709;&#x4EF7;&#x503C;&#x7684;&#x501F;&#x53E3;&#x3002;&#x6BCF;&#x4E2A;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x90FD;&#x770B;&#x5230;&#x6CA1;&#x6709;&#x63D0;&#x4F9B;&#x6709;&#x7528;&#x4FE1;&#x606F;&#x7684;&#x6CE8;&#x91CA;&#xFF0C;&#x5E76;&#x4E14;&#x5927;&#x591A;&#x6570;&#x73B0;&#x6709;&#x6587;&#x6863;&#x5145;&#x5176;&#x91CF;&#x90FD;&#x662F;&#x8FD9;&#x6837;&#x3002;&#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x662F;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x7684;&#x3002;&#x4E00;&#x65E6;&#x77E5;&#x9053;&#x4E86;&#x5982;&#x4F55;&#x7F16;&#x5199;&#x53EF;&#x9760;&#x7684;&#x6587;&#x6863;&#x5E76;&#x4E0D;&#x96BE;&#x3002;&#x4E0B;&#x4E00;&#x7AE0;&#x5C06;&#x4E3A;&#x5982;&#x4F55;&#x7F16;&#x5199;&#x826F;&#x597D;&#x7684;&#x6587;&#x6863;&#x5E76;&#x968F;&#x65F6;&#x95F4;&#x8FDB;&#x884C;&#x7EF4;&#x62A4;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x6846;&#x67B6;&#x3002;</p>
</blockquote>
<h2 id="125-benefits-of-well-written-comments">12.5 Benefits of well-written comments</h2>
<p>Now that I have discussed (and, hopefully, debunked) the arguments against writing comments, let&#x2019;s consider the benefits that you will get from good comments. The overall idea behind comments is to capture information that was in the mind of the designer but couldn&#x2019;t be represented in the code. This information ranges from low-level details, such as a hardware quirk that motivates a particularly tricky piece of code, up to high-level concepts such as the rationale for a class. When other developers come along later to make modifications, the comments will allow them to work more quickly and accurately. Without documentation, future developers will have to rederive or guess at the developer&#x2019;s original knowledge; this will take additional time, and there is a risk of bugs if the new developer misunderstands the original designer&#x2019;s intentions. Comments are valuable even when the original designer is the one making the changes: if it has been more than a few weeks since you last worked in a piece of code, you will have forgotten many of the details of the original design.</p>
<blockquote>
<p>&#x65E2;&#x7136;&#x6211;&#x5DF2;&#x7ECF;&#x8BA8;&#x8BBA;&#x4E86;&#xFF08;&#x5E76;&#x5E0C;&#x671B;&#x63ED;&#x7A7F;&#x4E86;&#x8FD9;&#x4E9B;&#xFF09;&#x53CD;&#x5BF9;&#x64B0;&#x5199;&#x6CE8;&#x91CA;&#x7684;&#x8BBA;&#x70B9;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x8003;&#x8651;&#x4E00;&#x4E0B;&#x4ECE;&#x826F;&#x597D;&#x6CE8;&#x91CA;&#x4E2D;&#x5C06;&#x83B7;&#x5F97;&#x7684;&#x597D;&#x5904;&#x3002;&#x6CE8;&#x91CA;&#x80CC;&#x540E;&#x7684;&#x603B;&#x4F53;&#x601D;&#x60F3;&#x662F;&#x6355;&#x83B7;&#x8BBE;&#x8BA1;&#x8005;&#x6240;&#x60F3;&#x4F46;&#x4E0D;&#x80FD;&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#x8868;&#x793A;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x4ECE;&#x4F4E;&#x7EA7;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x6FC0;&#x53D1;&#x7279;&#x6B8A;&#x4EE3;&#x7801;&#x7684;&#x786C;&#x4EF6;&#x602A;&#x7656;&#xFF09;&#x5230;&#x9AD8;&#x7EA7;&#x6982;&#x5FF5;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x7C7B;&#x7684;&#x57FA;&#x672C;&#x539F;&#x7406;&#xFF09;&#x3002;&#x5F53;&#x5176;&#x4ED6;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x7A0D;&#x540E;&#x8FDB;&#x884C;&#x4FEE;&#x6539;&#x65F6;&#xFF0C;&#x8FD9;&#x4E9B;&#x6CE8;&#x91CA;&#x5C06;&#x4F7F;&#x4ED6;&#x4EEC;&#x80FD;&#x591F;&#x66F4;&#x5FEB;&#xFF0C;&#x66F4;&#x51C6;&#x786E;&#x5730;&#x5DE5;&#x4F5C;&#x3002;&#x6CA1;&#x6709;&#x6587;&#x6863;&#xFF0C;&#x672A;&#x6765;&#x7684;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5C06;&#x4E0D;&#x5F97;&#x4E0D;&#x91CD;&#x65B0;&#x7F16;&#x5199;&#x6216;&#x731C;&#x6D4B;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x7684;&#x539F;&#x59CB;&#x77E5;&#x8BC6;&#x3002;&#x8FD9;&#x5C06;&#x82B1;&#x8D39;&#x989D;&#x5916;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x5E76;&#x4E14;&#x5982;&#x679C;&#x65B0;&#x5F00;&#x53D1;&#x8005;&#x8BEF;&#x89E3;&#x4E86;&#x539F;&#x59CB;&#x8BBE;&#x8BA1;&#x8005;&#x7684;&#x610F;&#x56FE;&#xFF0C;&#x5219;&#x5B58;&#x5728;&#x9519;&#x8BEF;&#x7684;&#x98CE;&#x9669;&#x3002;</p>
</blockquote>
<p>Chapter 2 described three ways in which complexity manifests itself in software systems:</p>
<blockquote>
<p>&#x7B2C; 2 &#x7AE0;&#x4ECB;&#x7ECD;&#x4E86;&#x5728;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E2D;&#x8868;&#x73B0;&#x51FA;&#x590D;&#x6742;&#x6027;&#x7684;&#x4E09;&#x79CD;&#x65B9;&#x5F0F;&#xFF1A;</p>
</blockquote>
<ul>
<li>Change amplification: a seemingly simple change requires code modifications in many places.</li>
<li>Cognitive load: in order to make a change, the developer must accumulate a large amount of information.</li>
<li>Unknown unknowns: it is unclear what code needs to be modified, or what information must be considered in order to make those modifications.</li>
</ul>
<hr>
<blockquote>
<ul>
<li>&#x53D8;&#x66F4;&#x653E;&#x5927;&#xFF1A;&#x770B;&#x4F3C;&#x7B80;&#x5355;&#x7684;&#x53D8;&#x66F4;&#x9700;&#x8981;&#x5728;&#x8BB8;&#x591A;&#x5730;&#x65B9;&#x8FDB;&#x884C;&#x4EE3;&#x7801;&#x4FEE;&#x6539;&#x3002;</li>
<li>&#x8BA4;&#x77E5;&#x8D1F;&#x8377;&#xFF1A;&#x4E3A;&#x4E86;&#x8FDB;&#x884C;&#x66F4;&#x6539;&#xFF0C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5FC5;&#x987B;&#x79EF;&#x7D2F;&#x5927;&#x91CF;&#x4FE1;&#x606F;&#x3002;</li>
<li>&#x672A;&#x77E5;&#x672A;&#x77E5;&#x6570;&#xFF1A;&#x5C1A;&#x4E0D;&#x6E05;&#x695A;&#x9700;&#x8981;&#x4FEE;&#x6539;&#x54EA;&#x4E9B;&#x4EE3;&#x7801;&#xFF0C;&#x6216;&#x5FC5;&#x987B;&#x8003;&#x8651;&#x54EA;&#x4E9B;&#x4FE1;&#x606F;&#x624D;&#x80FD;&#x8FDB;&#x884C;&#x8FD9;&#x4E9B;&#x4FEE;&#x6539;&#x3002;</li>
</ul>
</blockquote>
<p>Good documentation helps with the last two of these issues. Documentation can reduce cognitive load by providing developers with the information they need to make changes and by making it easy for developers to ignore information that is irrelevant. Without adequate documentation, developers may have to read large amounts of code to reconstruct what was in the designer&#x2019;s mind. Documentation can also reduce the unknown unknowns by clarifying the structure of the system, so that it is clear what information and code is relevant for any given change.</p>
<blockquote>
<p>&#x597D;&#x7684;&#x6587;&#x6863;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x89E3;&#x51B3;&#x6700;&#x540E;&#x4E24;&#x4E2A;&#x95EE;&#x9898;&#x3002;&#x901A;&#x8FC7;&#x4E3A;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x63D0;&#x4F9B;&#x4ED6;&#x4EEC;&#x8FDB;&#x884C;&#x66F4;&#x6539;&#x6240;&#x9700;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x5E76;&#x4F7F;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5BB9;&#x6613;&#x5FFD;&#x7565;&#x4E0D;&#x76F8;&#x5173;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x6587;&#x6863;&#x53EF;&#x4EE5;&#x51CF;&#x8F7B;&#x8BA4;&#x77E5;&#x8D1F;&#x62C5;&#x3002;&#x6CA1;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x6587;&#x6863;&#xFF0C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x53EF;&#x80FD;&#x5FC5;&#x987B;&#x9605;&#x8BFB;&#x5927;&#x91CF;&#x4EE3;&#x7801;&#x624D;&#x80FD;&#x91CD;&#x6784;&#x8BBE;&#x8BA1;&#x4EBA;&#x5458;&#x7684;&#x60F3;&#x6CD5;&#x3002;&#x6587;&#x6863;&#x8FD8;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x9610;&#x660E;&#x7CFB;&#x7EDF;&#x7684;&#x7ED3;&#x6784;&#x6765;&#x51CF;&#x5C11;&#x672A;&#x77E5;&#x7684;&#x672A;&#x77E5;&#x6570;&#xFF0C;&#x4ECE;&#x800C;&#x53EF;&#x4EE5;&#x6E05;&#x695A;&#x5730;&#x4E86;&#x89E3;&#x4E0E;&#x4EFB;&#x4F55;&#x7ED9;&#x5B9A;&#x66F4;&#x6539;&#x76F8;&#x5173;&#x7684;&#x4FE1;&#x606F;&#x548C;&#x4EE3;&#x7801;&#x3002;</p>
</blockquote>
<p>Chapter 2 pointed out that the primary causes of complexity are dependencies and obscurity. Good documentation can clarify dependencies, and it fills in gaps to eliminate obscurity.</p>
<blockquote>
<p>&#x7B2C; 2 &#x7AE0;&#x6307;&#x51FA;&#xFF0C;&#x5BFC;&#x81F4;&#x590D;&#x6742;&#x6027;&#x7684;&#x4E3B;&#x8981;&#x539F;&#x56E0;&#x662F;&#x4F9D;&#x8D56;&#x6027;&#x548C;&#x6A21;&#x7CCA;&#x6027;&#x3002;&#x597D;&#x7684;&#x6587;&#x6863;&#x53EF;&#x4EE5;&#x9610;&#x660E;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x586B;&#x8865;&#x7A7A;&#x767D;&#x4EE5;&#x6D88;&#x9664;&#x6A21;&#x7CCA;&#x6027;&#x3002;</p>
</blockquote>
<p>The next few chapters will show you how to write good documentation. They will also discuss how to integrate documentation-writing into the design process so that it improves the design of your software.</p>
<blockquote>
<p>&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x51E0;&#x7AE0;&#x5C06;&#x5411;&#x60A8;&#x5C55;&#x793A;&#x5982;&#x4F55;&#x7F16;&#x5199;&#x597D;&#x7684;&#x6587;&#x6863;&#x3002;&#x4ED6;&#x4EEC;&#x8FD8;&#x5C06;&#x8BA8;&#x8BBA;&#x5982;&#x4F55;&#x5C06;&#x6587;&#x6863;&#x7F16;&#x5199;&#x96C6;&#x6210;&#x5230;&#x8BBE;&#x8BA1;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x4ECE;&#x800C;&#x6539;&#x5584;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x3002;</p>
</blockquote>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="ch11.html" class="navigation navigation-prev " aria-label="Previous page: 第十一章: 设计它两次">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="ch13.html" class="navigation navigation-next " aria-label="Next page: 第十三章: 注释应该描述代码中不明显的内容">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第十二章: 为什么写注释？四个理由","level":"1.15","depth":1,"next":{"title":"第十三章: 注释应该描述代码中不明显的内容","level":"1.16","depth":1,"path":"docs/ch13.md","ref":"./docs/ch13.md","articles":[]},"previous":{"title":"第十一章: 设计它两次","level":"1.14","depth":1,"path":"docs/ch11.md","ref":"./docs/ch11.md","articles":[]},"dir":"ltr"},"config":{"plugins":["back-to-top-button","expandable-chapters-small","page-toc-button","livereload"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"livereload":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"page-toc-button":{},"back-to-top-button":{},"expandable-chapters-small":{},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"John Ousterhout","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"软件设计哲学","language":"zh-hans","gitbook":"*","description":"书中讨论了软件设计的主题：如何将复杂的软件系统分解成可以相对独立实现的模块(如类和方法)"},"file":{"path":"docs/ch12.md","mtime":"2020-08-06T16:26:19.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-02-06T04:55:41.669Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-page-toc-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

