
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第十三章: 注释应该描述代码中不明显的内容 · 软件设计哲学</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="John Ousterhout">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-page-toc-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="ch14.html" />
    
    
    <link rel="prev" href="ch12.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    首页
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="preface">
            
                <span>
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="ch1.html">
            
                <a href="ch1.html">
            
                    
                    第一章：介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="ch2.html">
            
                <a href="ch2.html">
            
                    
                    第二章：复杂性的本质
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="ch3.html">
            
                <a href="ch3.html">
            
                    
                    第三章：工作代码是不够的（战略与战术编程）
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="ch4.html">
            
                <a href="ch4.html">
            
                    
                    第四章：模块应该是深的
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="ch5.html">
            
                <a href="ch5.html">
            
                    
                    第五章：信息隐藏(和泄露)
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="ch6.html">
            
                <a href="ch6.html">
            
                    
                    第六章：通用模块更深入
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="ch7.html">
            
                <a href="ch7.html">
            
                    
                    第七章: 不同的层，不同的抽象
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="ch8.html">
            
                <a href="ch8.html">
            
                    
                    第八章: 降低复杂性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="ch9.html">
            
                <a href="ch9.html">
            
                    
                    第九章: 在一起更好还是分开更好？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="ch10.html">
            
                <a href="ch10.html">
            
                    
                    第十章: 定义不存在的错误
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="ch11.html">
            
                <a href="ch11.html">
            
                    
                    第十一章: 设计它两次
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="ch12.html">
            
                <a href="ch12.html">
            
                    
                    第十二章: 为什么写注释？四个理由
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.16" data-path="ch13.html">
            
                <a href="ch13.html">
            
                    
                    第十三章: 注释应该描述代码中不明显的内容
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="ch14.html">
            
                <a href="ch14.html">
            
                    
                    第十四章: 选择的名字
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="ch15.html">
            
                <a href="ch15.html">
            
                    
                    第十五章: 先写注释
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="ch16.html">
            
                <a href="ch16.html">
            
                    
                    第十六章: 修改现有的代码
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.20" data-path="ch17.html">
            
                <a href="ch17.html">
            
                    
                    第十七章: 一致性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.21" data-path="ch18.html">
            
                <a href="ch18.html">
            
                    
                    第十八章: 代码应该是显而易见的
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.22" data-path="ch19.html">
            
                <a href="ch19.html">
            
                    
                    第十九章: 软件发展趋势
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.23" data-path="ch20.html">
            
                <a href="ch20.html">
            
                    
                    第二十章: 设计性能
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.24" data-path="ch21.html">
            
                <a href="ch21.html">
            
                    
                    第二十一章: 结论
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.25" data-path="summary.html">
            
                <a href="summary.html">
            
                    
                    总结
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >第十三章: 注释应该描述代码中不明显的内容</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7B2C;-13-&#x7AE0;-&#x6CE8;&#x91CA;&#x5E94;&#x8BE5;&#x63CF;&#x8FF0;&#x4EE3;&#x7801;&#x4E2D;&#x4E0D;&#x660E;&#x663E;&#x7684;&#x5185;&#x5BB9;">&#x7B2C; 13 &#x7AE0; &#x6CE8;&#x91CA;&#x5E94;&#x8BE5;&#x63CF;&#x8FF0;&#x4EE3;&#x7801;&#x4E2D;&#x4E0D;&#x660E;&#x663E;&#x7684;&#x5185;&#x5BB9;</h1>
<blockquote>
<p>Chapter 13 Comments Should Describe Things that Aren&#x2019;t Obvious from the Code</p>
</blockquote>
<p>The reason for writing comments is that statements in a programming language can&#x2019;t capture all of the important information that was in the mind of the developer when the code was written. Comments record this information so that developers who come along later can easily understand and modify the code. The guiding principle for comments is that comments should describe things that aren&#x2019;t obvious from the code.</p>
<blockquote>
<p>&#x7F16;&#x5199;&#x6CE8;&#x91CA;&#x7684;&#x539F;&#x56E0;&#x662F;&#xFF0C;&#x4F7F;&#x7528;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x7F16;&#x5199;&#x7684;&#x8BED;&#x53E5;&#x65E0;&#x6CD5;&#x6355;&#x83B7;&#x7F16;&#x5199;&#x4EE3;&#x7801;&#x65F6;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x60F3;&#x5230;&#x7684;&#x6240;&#x6709;&#x91CD;&#x8981;&#x4FE1;&#x606F;&#x3002;&#x6CE8;&#x91CA;&#x8BB0;&#x5F55;&#x4E86;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#xFF0C;&#x4EE5;&#x4FBF;&#x540E;&#x6765;&#x7684;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x53EF;&#x4EE5;&#x8F7B;&#x677E;&#x5730;&#x7406;&#x89E3;&#x548C;&#x4FEE;&#x6539;&#x4EE3;&#x7801;&#x3002;&#x6CE8;&#x91CA;&#x7684;&#x6307;&#x5BFC;&#x539F;&#x5219;&#x662F;&#xFF0C;&#x6CE8;&#x91CA;&#x5E94;&#x63CF;&#x8FF0;&#x4EE3;&#x7801;&#x4E2D;&#x4E0D;&#x660E;&#x663E;&#x7684;&#x5185;&#x5BB9;&#x3002;</p>
</blockquote>
<p>There are many things that aren&#x2019;t obvious from the code. Sometimes it&#x2019;s low-level details that aren&#x2019;t obvious. For example, when a pair of indices describe a range, it isn&#x2019;t obvious whether the elements given by the indices are inside the range or out. Sometimes it&#x2019;s not clear why code is needed, or why it was implemented in a particular way. Sometimes there are rules the developer followed, such as &#x201C;always invoke a before b.&#x201D; You might be able to guess at a rule by looking at all of the code, but this is painful and error-prone; a comment can make the rule explicit and clear.</p>
<blockquote>
<p>&#x4ECE;&#x4EE3;&#x7801;&#x4E2D;&#x770B;&#x4E0D;&#x5230;&#x5F88;&#x591A;&#x4E8B;&#x60C5;&#x3002;&#x6709;&#x65F6;&#xFF0C;&#x5E95;&#x5C42;&#x7EC6;&#x8282;&#x5E76;&#x4E0D;&#x660E;&#x663E;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5F53;&#x4E00;&#x5BF9;&#x7D22;&#x5F15;&#x63CF;&#x8FF0;&#x4E00;&#x4E2A;&#x8303;&#x56F4;&#x65F6;&#xFF0C;&#x7531;&#x7D22;&#x5F15;&#x7ED9;&#x51FA;&#x7684;&#x5143;&#x7D20;&#x662F;&#x5728;&#x8303;&#x56F4;&#x4E4B;&#x5185;&#x8FD8;&#x662F;&#x4E4B;&#x5916;&#x5E76;&#x4E0D;&#x660E;&#x663E;&#x3002;&#x6709;&#x65F6;&#x4E0D;&#x6E05;&#x695A;&#x4E3A;&#x4EC0;&#x4E48;&#x9700;&#x8981;&#x4EE3;&#x7801;&#xFF0C;&#x6216;&#x8005;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x4EE5;&#x7279;&#x5B9A;&#x65B9;&#x5F0F;&#x5B9E;&#x73B0;&#x4EE3;&#x7801;&#x3002;&#x6709;&#x65F6;&#xFF0C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x9075;&#x5FAA;&#x4E00;&#x4E9B;&#x89C4;&#x5219;&#xFF0C;&#x4F8B;&#x5982;&#x201C;&#x603B;&#x662F;&#x5728; b &#x4E4B;&#x524D;&#x8C03;&#x7528; a&#x201D;&#x3002;&#x60A8;&#x53EF;&#x80FD;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x67E5;&#x770B;&#x6240;&#x6709;&#x4EE3;&#x7801;&#x6765;&#x731C;&#x6D4B;&#x89C4;&#x5219;&#xFF0C;&#x4F46;&#x8FD9;&#x5F88;&#x75DB;&#x82E6;&#x4E14;&#x5BB9;&#x6613;&#x51FA;&#x9519;&#x3002;&#x6CE8;&#x91CA;&#x53EF;&#x4EE5;&#x4F7F;&#x89C4;&#x5219;&#x6E05;&#x6670;&#x660E;&#x4E86;&#x3002;</p>
</blockquote>
<p>One of the most important reasons for comments is abstractions, which include a lot of information that isn&#x2019;t obvious from the code. The idea of an abstraction is to provide a simple way of thinking about something, but code is so detailed that it can be hard to see the abstraction just from reading the code. Comments can provide a simpler, higher-level view (&#x201C;after this method is invoked, network traffic will be limited to maxBandwidth bytes per second&#x201D;). Even if this information can be deduced by reading the code, we don&#x2019;t want to force users of a module to do that: reading the code is time-consuming and forces them to consider a lot of information that isn&#x2019;t needed to use the module. Developers should be able to understand the abstraction provided by a module without reading any code other than its externally visible declarations. The only way to do this is by supplementing the declarations with comments.</p>
<blockquote>
<p>&#x6CE8;&#x91CA;&#x7684;&#x6700;&#x91CD;&#x8981;&#x539F;&#x56E0;&#x4E4B;&#x4E00;&#x662F;&#x62BD;&#x8C61;&#xFF0C;&#x5176;&#x4E2D;&#x5305;&#x62EC;&#x8BB8;&#x591A;&#x4ECE;&#x4EE3;&#x7801;&#x4E2D;&#x770B;&#x4E0D;&#x5230;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x62BD;&#x8C61;&#x7684;&#x601D;&#x60F3;&#x662F;&#x63D0;&#x4F9B;&#x4E00;&#x79CD;&#x601D;&#x8003;&#x95EE;&#x9898;&#x7684;&#x7B80;&#x5355;&#x65B9;&#x6CD5;&#xFF0C;&#x4F46;&#x662F;&#x4EE3;&#x7801;&#x662F;&#x5982;&#x6B64;&#x8BE6;&#x7EC6;&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;&#x4EC5;&#x901A;&#x8FC7;&#x9605;&#x8BFB;&#x4EE3;&#x7801;&#x5C31;&#x5F88;&#x96BE;&#x770B;&#x5230;&#x62BD;&#x8C61;&#x3002;&#x6CE8;&#x91CA;&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x66F4;&#x7B80;&#x5355;&#xFF0C;&#x66F4;&#x9AD8;&#x7EA7;&#x7684;&#x89C6;&#x56FE;&#xFF08;&#x201C;&#x8C03;&#x7528;&#x6B64;&#x65B9;&#x6CD5;&#x540E;&#xFF0C;&#x7F51;&#x7EDC;&#x6D41;&#x91CF;&#x5C06;&#x88AB;&#x9650;&#x5236;&#x4E3A;&#x6BCF;&#x79D2; maxBandwidth &#x5B57;&#x8282;&#x201D;&#xFF09;&#x3002;&#x5373;&#x4F7F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x9605;&#x8BFB;&#x4EE3;&#x7801;&#x63A8;&#x65AD;&#x51FA;&#x6B64;&#x4FE1;&#x606F;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x4E0D;&#x60F3;&#x5F3A;&#x8FEB;&#x6A21;&#x5757;&#x7528;&#x6237;&#x8FD9;&#x6837;&#x505A;&#xFF1A;&#x9605;&#x8BFB;&#x4EE3;&#x7801;&#x5F88;&#x8017;&#x65F6;&#xFF0C;&#x5E76;&#x4E14;&#x8FEB;&#x4F7F;&#x4ED6;&#x4EEC;&#x8003;&#x8651;&#x5F88;&#x591A;&#x4E0D;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x7684;&#x4FE1;&#x606F;&#x6A21;&#x5757;&#x3002;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5E94;&#x8BE5;&#x80FD;&#x591F;&#x7406;&#x89E3;&#x6A21;&#x5757;&#x63D0;&#x4F9B;&#x7684;&#x62BD;&#x8C61;&#xFF0C;&#x800C;&#x65E0;&#x9700;&#x9605;&#x8BFB;&#x5176;&#x5916;&#x90E8;&#x53EF;&#x89C1;&#x58F0;&#x660E;&#x4EE5;&#x5916;&#x7684;&#x4EFB;&#x4F55;&#x4EE3;&#x7801;&#x3002;</p>
</blockquote>
<p>This chapter discusses what information needs to be described in comments and how to write good comments. As you will see, good comments typically explain things at a different level of detail than the code, which is more detailed in some situations and less detailed (more abstract) in others.</p>
<blockquote>
<p>&#x672C;&#x7AE0;&#x8BA8;&#x8BBA;&#x9700;&#x8981;&#x5728;&#x6CE8;&#x91CA;&#x4E2D;&#x63CF;&#x8FF0;&#x54EA;&#x4E9B;&#x4FE1;&#x606F;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x7F16;&#x5199;&#x826F;&#x597D;&#x7684;&#x6CE8;&#x91CA;&#x3002;&#x5C31;&#x50CF;&#x60A8;&#x5C06;&#x770B;&#x5230;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x597D;&#x7684;&#x6CE8;&#x91CA;&#x901A;&#x5E38;&#x4EE5;&#x4E0E;&#x4EE3;&#x7801;&#x4E0D;&#x540C;&#x7684;&#x8BE6;&#x7EC6;&#x7A0B;&#x5EA6;&#x6765;&#x89E3;&#x91CA;&#x4E8B;&#x7269;&#xFF0C;&#x5728;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6CE8;&#x91CA;&#x4F1A;&#x66F4;&#x8BE6;&#x7EC6;&#xFF0C;&#x800C;&#x5728;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4EE3;&#x7801;&#x5219;&#x8F83;&#x4E0D;&#x62BD;&#x8C61;&#xFF08;&#x66F4;&#x62BD;&#x8C61;&#xFF09;&#x3002;</p>
</blockquote>
<h2 id="131-pick-conventions">13.1 Pick conventions</h2>
<p>The first step in writing comments is to decide on conventions for commenting, such as what you will comment and the format you will use for comments. If you are programming in a language for which there exists a document compilation tool, such as Javadoc for Java, Doxygen for C++, or godoc for Go!, follow the conventions of the tools. None of these conventions is perfect, but the tools provide enough benefits to make up for that. If you are programming in an environment where there are no existing conventions to follow, try to adopt the conventions from some other language or project that is similar; this will make it easier for other developers to understand and adhere to your conventions.</p>
<blockquote>
<p>&#x7F16;&#x5199;&#x6CE8;&#x91CA;&#x7684;&#x7B2C;&#x4E00;&#x6B65;&#x662F;&#x786E;&#x5B9A;&#x6CE8;&#x91CA;&#x7684;&#x7EA6;&#x5B9A;&#xFF0C;&#x4F8B;&#x5982;&#x60A8;&#x8981;&#x6CE8;&#x91CA;&#x7684;&#x5185;&#x5BB9;&#x548C;&#x6CE8;&#x91CA;&#x7684;&#x683C;&#x5F0F;&#x3002;&#x5982;&#x679C;&#x60A8;&#x6B63;&#x5728;&#x4F7F;&#x7528;&#x5B58;&#x5728;&#x6587;&#x6863;&#x7F16;&#x8BD1;&#x5DE5;&#x5177;&#x7684;&#x8BED;&#x8A00;&#x8FDB;&#x884C;&#x7F16;&#x7A0B;&#xFF0C;&#x4F8B;&#x5982; Java &#x7684; Javadoc&#xFF0C;C ++&#x7684; Doxygen &#x6216; Go&#xFF01;&#x7684; godoc&#xFF0C;&#x8BF7;&#x9075;&#x5FAA;&#x5DE5;&#x5177;&#x7684;&#x7EA6;&#x5B9A;&#x3002;&#x8FD9;&#x4E9B;&#x7EA6;&#x5B9A;&#x90FD;&#x4E0D;&#x662F;&#x5B8C;&#x7F8E;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x4E9B;&#x5DE5;&#x5177;&#x53EF;&#x63D0;&#x4F9B;&#x8DB3;&#x591F;&#x7684;&#x597D;&#x5904;&#x6765;&#x5F25;&#x8865;&#x8FD9;&#x4E00;&#x7F3A;&#x70B9;&#x3002;&#x5982;&#x679C;&#x5728;&#x6CA1;&#x6709;&#x73B0;&#x6709;&#x7EA6;&#x5B9A;&#x53EF;&#x9075;&#x5FAA;&#x7684;&#x73AF;&#x5883;&#x4E2D;&#x8FDB;&#x884C;&#x7F16;&#x7A0B;&#xFF0C;&#x8BF7;&#x5C1D;&#x8BD5;&#x4ECE;&#x5176;&#x4ED6;&#x7C7B;&#x4F3C;&#x7684;&#x8BED;&#x8A00;&#x6216;&#x9879;&#x76EE;&#x4E2D;&#x91C7;&#x7528;&#x8FD9;&#x4E9B;&#x7EA6;&#x5B9A;&#xFF1B;&#x8FD9;&#x5C06;&#x4F7F;&#x5176;&#x4ED6;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x66F4;&#x5BB9;&#x6613;&#x7406;&#x89E3;&#x548C;&#x9075;&#x5B88;&#x60A8;&#x7684;&#x7EA6;&#x5B9A;&#x3002;</p>
</blockquote>
<p>Conventions serve two purposes. First, they ensure consistency, which makes comments easier to read and understand. Second, they help to ensure that you actually write comments. If you don&#x2019;t have a clear idea what you are going to comment and how, it&#x2019;s easy to end up writing no comments at all.</p>
<blockquote>
<p>&#x7EA6;&#x5B9A;&#x6709;&#x4E24;&#x4E2A;&#x76EE;&#x7684;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x5B83;&#x4EEC;&#x786E;&#x4FDD;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x8FD9;&#x4F7F;&#x5F97;&#x6CE8;&#x91CA;&#x66F4;&#x6613;&#x4E8E;&#x9605;&#x8BFB;&#x548C;&#x7406;&#x89E3;&#x3002;&#x5176;&#x6B21;&#xFF0C;&#x5B83;&#x4EEC;&#x6709;&#x52A9;&#x4E8E;&#x786E;&#x4FDD;&#x60A8;&#x5B9E;&#x9645;&#x7F16;&#x5199;&#x8BC4;&#x8BBA;&#x3002;&#x5982;&#x679C;&#x60A8;&#x4E0D;&#x6E05;&#x695A;&#x8981;&#x53D1;&#x8868;&#x7684;&#x8BC4;&#x8BBA;&#x4EE5;&#x53CA;&#x53D1;&#x8868;&#x8BC4;&#x8BBA;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x90A3;&#x4E48;&#x5F88;&#x5BB9;&#x6613;&#x6700;&#x7EC8;&#x6839;&#x672C;&#x4E0D;&#x53D1;&#x8868;&#x8BC4;&#x8BBA;&#x3002;</p>
</blockquote>
<p>Most comments fall into one of the following categories:</p>
<blockquote>
<p>&#x5927;&#x591A;&#x6570;&#x8BC4;&#x8BBA;&#x5C5E;&#x4E8E;&#x4EE5;&#x4E0B;&#x7C7B;&#x522B;&#x4E4B;&#x4E00;&#xFF1A;</p>
</blockquote>
<p>Interface: a comment block that immediately precedes the declaration of a module such as a class, data structure, function, or method. The comment describe&#x2019;s the module&#x2019;s interface. For a class, the comment describes the overall abstraction provided by the class. For a method or function, the comment describes its overall behavior, its arguments and return value, if any, any side effects or exceptions that it generates, and any other requirements the caller must satisfy before invoking the method.</p>
<blockquote>
<p>&#x63A5;&#x53E3;&#xFF1A;&#x5728;&#x6A21;&#x5757;&#x58F0;&#x660E;&#xFF08;&#x4F8B;&#x5982;&#x7C7B;&#xFF0C;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x51FD;&#x6570;&#x6216;&#x65B9;&#x6CD5;&#xFF09;&#x4E4B;&#x524D;&#x7684;&#x6CE8;&#x91CA;&#x5757;&#x3002;&#x6CE8;&#x91CA;&#x63CF;&#x8FF0;&#x6A21;&#x5757;&#x7684;&#x63A5;&#x53E3;&#x3002;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x7C7B;&#xFF0C;&#x6CE8;&#x91CA;&#x63CF;&#x8FF0;&#x4E86;&#x8BE5;&#x7C7B;&#x63D0;&#x4F9B;&#x7684;&#x6574;&#x4F53;&#x62BD;&#x8C61;&#x3002;&#x5BF9;&#x4E8E;&#x65B9;&#x6CD5;&#x6216;&#x51FD;&#x6570;&#xFF0C;&#x6CE8;&#x91CA;&#x63CF;&#x8FF0;&#x5176;&#x6574;&#x4F53;&#x884C;&#x4E3A;&#xFF0C;&#x5176;&#x53C2;&#x6570;&#x548C;&#x8FD4;&#x56DE;&#x503C;&#xFF08;&#x5982;&#x679C;&#x6709;&#xFF09;&#xFF0C;&#x5176;&#x751F;&#x6210;&#x7684;&#x4EFB;&#x4F55;&#x526F;&#x4F5C;&#x7528;&#x6216;&#x5F02;&#x5E38;&#xFF0C;&#x4EE5;&#x53CA;&#x8C03;&#x7528;&#x8005;&#x5728;&#x8C03;&#x7528;&#x8BE5;&#x65B9;&#x6CD5;&#x4E4B;&#x524D;&#x5FC5;&#x987B;&#x6EE1;&#x8DB3;&#x7684;&#x4EFB;&#x4F55;&#x5176;&#x4ED6;&#x8981;&#x6C42;&#x3002;</p>
</blockquote>
<p>Data structure member: a comment next to the declaration of a field in a data structure, such as an instance variable or static variable for a class.</p>
<blockquote>
<p>&#x6570;&#x636E;&#x7ED3;&#x6784;&#x6210;&#x5458;&#xFF1A;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4E2D;&#x5B57;&#x6BB5;&#x58F0;&#x660E;&#x65C1;&#x8FB9;&#x7684;&#x6CE8;&#x91CA;&#xFF0C;&#x4F8B;&#x5982;&#x7C7B;&#x7684;&#x5B9E;&#x4F8B;&#x53D8;&#x91CF;&#x6216;&#x9759;&#x6001;&#x53D8;&#x91CF;&#x3002;</p>
</blockquote>
<p>Implementation comment: a comment inside the code of a method or function, which describes how the code works internally.</p>
<blockquote>
<p>&#x5B9E;&#x73B0;&#x6CE8;&#x91CA;&#xFF1A;&#x65B9;&#x6CD5;&#x6216;&#x51FD;&#x6570;&#x4EE3;&#x7801;&#x5185;&#x90E8;&#x7684;&#x6CE8;&#x91CA;&#xFF0C;&#x5B83;&#x63CF;&#x8FF0;&#x4EE3;&#x7801;&#x5728;&#x5185;&#x90E8;&#x7684;&#x5DE5;&#x4F5C;&#x65B9;&#x5F0F;&#x3002;</p>
</blockquote>
<p>Cross-module comment: a comment describing dependencies that cross module boundaries.</p>
<blockquote>
<p>&#x8DE8;&#x6A21;&#x5757;&#x6CE8;&#x91CA;&#xFF1A;&#x63CF;&#x8FF0;&#x8DE8;&#x6A21;&#x5757;&#x8FB9;&#x754C;&#x7684;&#x4F9D;&#x8D56;&#x9879;&#x7684;&#x6CE8;&#x91CA;&#x3002;</p>
</blockquote>
<p>The most important comments are those in the first two categories. Every class should have an interface comment, every class variable should have a comment, and every method should have an interface comment. Occasionally, the declaration for a variable or method is so obvious that there is nothing useful to add in a comment (getters and setters sometimes fall in this category), but this is rare; it is easier to comment everything rather than spend energy worrying about whether a comment is needed. Implementation comments are often unnecessary (see Section 13.6 below). Cross-module comments are the most rare of all and they are problematic to write, but when they are needed they are quite important; Section 13.7 discusses them in more detail.</p>
<blockquote>
<p>&#x6700;&#x91CD;&#x8981;&#x7684;&#x8BC4;&#x8BBA;&#x662F;&#x524D;&#x4E24;&#x4E2A;&#x7C7B;&#x522B;&#x4E2D;&#x7684;&#x8BC4;&#x8BBA;&#x3002;&#x6BCF;&#x4E2A;&#x7C7B;&#x90FD;&#x5E94;&#x6709;&#x4E00;&#x4E2A;&#x63A5;&#x53E3;&#x6CE8;&#x91CA;&#xFF0C;&#x6BCF;&#x4E2A;&#x7C7B;&#x53D8;&#x91CF;&#x5E94;&#x6709;&#x4E00;&#x4E2A;&#x6CE8;&#x91CA;&#xFF0C;&#x6BCF;&#x4E2A;&#x65B9;&#x6CD5;&#x90FD;&#x5E94;&#x6709;&#x4E00;&#x4E2A;&#x63A5;&#x53E3;&#x6CE8;&#x91CA;&#x3002;&#x6709;&#x65F6;&#xFF0C;&#x53D8;&#x91CF;&#x6216;&#x65B9;&#x6CD5;&#x7684;&#x58F0;&#x660E;&#x662F;&#x5982;&#x6B64;&#x660E;&#x663E;&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;&#x5728;&#x6CE8;&#x91CA;&#x4E2D;&#x6CA1;&#x6709;&#x6DFB;&#x52A0;&#x4EFB;&#x4F55;&#x6709;&#x7528;&#x7684;&#x4E1C;&#x897F;&#xFF08;getter &#x548C; setter &#x6709;&#x65F6;&#x90FD;&#x5C5E;&#x4E8E;&#x6B64;&#x7C7B;&#xFF09;&#xFF0C;&#x4F46;&#x8FD9;&#x5F88;&#x5C11;&#x89C1;&#x3002;&#x8BC4;&#x8BBA;&#x6240;&#x6709;&#x5185;&#x5BB9;&#x8981;&#x6BD4;&#x82B1;&#x7CBE;&#x529B;&#x62C5;&#x5FC3;&#x662F;&#x5426;&#x9700;&#x8981;&#x8BC4;&#x8BBA;&#x8981;&#x5BB9;&#x6613;&#x5F97;&#x591A;&#x3002;&#x5B9E;&#x65BD;&#x6CE8;&#x91CA;&#x901A;&#x5E38;&#x662F;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#xFF08;&#x8BF7;&#x53C2;&#x9605;&#x4E0B;&#x9762;&#x7684; 13.6 &#x8282;&#xFF09;&#x3002;&#x8DE8;&#x6A21;&#x5757;&#x6CE8;&#x91CA;&#x662F;&#x6700;&#x7F55;&#x89C1;&#x7684;&#xFF0C;&#x800C;&#x4E14;&#x7F16;&#x5199;&#x8D77;&#x6765;&#x5F88;&#x6210;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x662F;&#x5F53;&#x9700;&#x8981;&#x5B83;&#x4EEC;&#x65F6;&#xFF0C;&#x5B83;&#x4EEC;&#x5C31;&#x5F88;&#x91CD;&#x8981;&#x3002;&#x7B2C; 13.7 &#x8282;&#x5C06;&#x66F4;&#x8BE6;&#x7EC6;&#x5730;&#x8BA8;&#x8BBA;&#x5B83;&#x4EEC;&#x3002;</p>
</blockquote>
<h2 id="132-dont-repeat-the-code-&#x4E0D;&#x8981;&#x91CD;&#x590D;&#x4EE3;&#x7801;">13.2 Don&#x2019;t repeat the code &#x4E0D;&#x8981;&#x91CD;&#x590D;&#x4EE3;&#x7801;</h2>
<p>Unfortunately, many comments are not particularly helpful. The most common reason is that the comments repeat the code: all of the information in the comment can easily be deduced from the code next to the comment. Here is a code sample that appeared in a recent research paper:</p>
<blockquote>
<p>&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x8BB8;&#x591A;&#x8BC4;&#x8BBA;&#x5E76;&#x4E0D;&#x662F;&#x7279;&#x522B;&#x6709;&#x7528;&#x3002;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x539F;&#x56E0;&#x662F;&#x6CE8;&#x91CA;&#x91CD;&#x590D;&#x4E86;&#x4EE3;&#x7801;&#xFF1A;&#x53EF;&#x4EE5;&#x8F7B;&#x677E;&#x5730;&#x4ECE;&#x6CE8;&#x91CA;&#x65C1;&#x8FB9;&#x7684;&#x4EE3;&#x7801;&#x4E2D;&#x63A8;&#x65AD;&#x51FA;&#x6CE8;&#x91CA;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x4FE1;&#x606F;&#x3002;&#x8FD9;&#x662F;&#x6700;&#x8FD1;&#x7814;&#x7A76;&#x8BBA;&#x6587;&#x4E2D;&#x51FA;&#x73B0;&#x7684;&#x4EE3;&#x7801;&#x793A;&#x4F8B;&#xFF1A;</p>
</blockquote>
<pre><code class="lang-sh">ptr_copy = get_copy(obj)            <span class="hljs-comment"># Get pointer copy</span>
<span class="hljs-keyword">if</span> is_unlocked(ptr_copy):           <span class="hljs-comment"># Is obj free?</span>
    <span class="hljs-built_in">return</span> obj                      <span class="hljs-comment"># return current obj</span>
<span class="hljs-keyword">if</span> is_copy(ptr_copy):               <span class="hljs-comment"># Already a copy?</span>
    <span class="hljs-built_in">return</span> obj                      <span class="hljs-comment"># return obj</span>
thread_id = get_thread_id(ptr_copy)
<span class="hljs-keyword">if</span> thread_id == ctx.thread_id:      <span class="hljs-comment"># Locked by current ctx</span>
    <span class="hljs-built_in">return</span> ptr_copy                 <span class="hljs-comment"># Return copy</span>
</code></pre>
<p>There is no useful information in any of these comments except for the &#x201C;Locked by&#x201D; comment, which suggests something about the thread that might not be obvious from the code. Notice that these comments are at roughly the same level of detail as the code: there is one comment per line of code, which describes that line. Comments like this are rarely useful.</p>
<blockquote>
<p>&#x8FD9;&#x4E9B;&#x6CE8;&#x91CA;&#x4E2D;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x6709;&#x7528;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x4F46;&#x201C; Locked by&#x201D;&#x6CE8;&#x91CA;&#x9664;&#x5916;&#xFF0C;&#x8BE5;&#x6CE8;&#x91CA;&#x6697;&#x793A;&#x4E86;&#x6709;&#x5173;&#x7EBF;&#x7A0B;&#x7684;&#x67D0;&#x4E9B;&#x4FE1;&#x606F;&#x53EF;&#x80FD;&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#x5E76;&#x4E0D;&#x660E;&#x663E;&#x3002;&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x8FD9;&#x4E9B;&#x6CE8;&#x91CA;&#x7684;&#x8BE6;&#x7EC6;&#x7A0B;&#x5EA6;&#x4E0E;&#x4EE3;&#x7801;&#x5927;&#x81F4;&#x76F8;&#x540C;&#xFF1A;&#x6BCF;&#x884C;&#x4EE3;&#x7801;&#x6709;&#x4E00;&#x4E2A;&#x6CE8;&#x91CA;&#xFF0C;&#x7528;&#x4E8E;&#x63CF;&#x8FF0;&#x8BE5;&#x884C;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x6CE8;&#x91CA;&#x5F88;&#x5C11;&#x6709;&#x7528;&#x3002;</p>
</blockquote>
<p>Here are more examples of comments that repeat the code:</p>
<blockquote>
<p>&#x4EE5;&#x4E0B;&#x662F;&#x91CD;&#x590D;&#x4EE3;&#x7801;&#x7684;&#x6CE8;&#x91CA;&#x7684;&#x66F4;&#x591A;&#x793A;&#x4F8B;&#xFF1A;</p>
</blockquote>
<pre><code class="lang-java"><span class="hljs-comment">// Add a horizontal scroll bar</span>
hScrollBar = <span class="hljs-keyword">new</span> JScrollBar(JScrollBar.HORIZONTAL);
add(hScrollBar, BorderLayout.SOUTH);

<span class="hljs-comment">// Add a vertical scroll bar</span>
vScrollBar = <span class="hljs-keyword">new</span> JScrollBar(JScrollBar.VERTICAL);
add(vScrollBar, BorderLayout.EAST);

<span class="hljs-comment">// Initialize the caret-position related values</span>
caretX     = <span class="hljs-number">0</span>;
caretY     = <span class="hljs-number">0</span>;
caretMemX  = <span class="hljs-keyword">null</span>;
</code></pre>
<p>None of these comments provide any value. For the first two comments, the code is already clear enough that it doesn&#x2019;t really need comments; in the third case, a comment might be useful, but the current comment doesn&#x2019;t provide enough detail to be helpful.</p>
<blockquote>
<p>&#x8FD9;&#x4E9B;&#x8BC4;&#x8BBA;&#x5747;&#x672A;&#x63D0;&#x4F9B;&#x4EFB;&#x4F55;&#x4EF7;&#x503C;&#x3002;&#x5BF9;&#x4E8E;&#x524D;&#x4E24;&#x4E2A;&#x6CE8;&#x91CA;&#xFF0C;&#x4EE3;&#x7801;&#x5DF2;&#x7ECF;&#x5F88;&#x6E05;&#x695A;&#x4E86;&#xFF0C;&#x5B83;&#x5B9E;&#x9645;&#x4E0A;&#x4E0D;&#x9700;&#x8981;&#x6CE8;&#x91CA;&#x3002;&#x5728;&#x7B2C;&#x4E09;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6CE8;&#x91CA;&#x53EF;&#x80FD;&#x6709;&#x7528;&#xFF0C;&#x4F46;&#x662F;&#x5F53;&#x524D;&#x6CE8;&#x91CA;&#x6CA1;&#x6709;&#x63D0;&#x4F9B;&#x8DB3;&#x591F;&#x7684;&#x7EC6;&#x8282;&#x6765;&#x63D0;&#x4F9B;&#x5E2E;&#x52A9;&#x3002;</p>
</blockquote>
<p>After you have written a comment, ask yourself the following question: could someone who has never seen the code write the comment just by looking at the code next to the comment? If the answer is yes, as in the examples above, then the comment doesn&#x2019;t make the code any easier to understand. Comments like these are why some people think that comments are worthless.</p>
<blockquote>
<p>&#x7F16;&#x5199;&#x8BC4;&#x8BBA;&#x540E;&#xFF0C;&#x8BF7;&#x95EE;&#x81EA;&#x5DF1;&#x4EE5;&#x4E0B;&#x95EE;&#x9898;&#xFF1A;&#x4ECE;&#x672A;&#x770B;&#x8FC7;&#x4EE3;&#x7801;&#x7684;&#x4EBA;&#x80FD;&#x5426;&#x4EC5;&#x901A;&#x8FC7;&#x67E5;&#x770B;&#x8BC4;&#x8BBA;&#x65C1;&#x8FB9;&#x7684;&#x4EE3;&#x7801;&#x6765;&#x7F16;&#x5199;&#x8BC4;&#x8BBA;&#xFF1F;&#x5982;&#x679C;&#x7B54;&#x6848;&#x662F;&#x80AF;&#x5B9A;&#x7684;&#xFF08;&#x5982;&#x4E0A;&#x8FF0;&#x793A;&#x4F8B;&#x6240;&#x793A;&#xFF09;&#xFF0C;&#x5219;&#x6CE8;&#x91CA;&#x4E0D;&#x4F1A;&#x4F7F;&#x4EE3;&#x7801;&#x66F4;&#x6613;&#x4E8E;&#x7406;&#x89E3;&#x3002;&#x50CF;&#x8FD9;&#x6837;&#x7684;&#x8BC4;&#x8BBA;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x6709;&#x4E9B;&#x4EBA;&#x8BA4;&#x4E3A;&#x8BC4;&#x8BBA;&#x6BEB;&#x65E0;&#x4EF7;&#x503C;&#x7684;&#x539F;&#x56E0;&#x3002;</p>
</blockquote>
<p>Another common mistake is to use the same words in the comment that appear in the name of the entity being documented:</p>
<blockquote>
<p>&#x53E6;&#x4E00;&#x4E2A;&#x5E38;&#x89C1;&#x7684;&#x9519;&#x8BEF;&#x662F;&#x5728;&#x6CE8;&#x91CA;&#x4E2D;&#x4F7F;&#x7528;&#x4E0E;&#x8981;&#x8BB0;&#x5F55;&#x7684;&#x5B9E;&#x4F53;&#x540D;&#x79F0;&#x76F8;&#x540C;&#x7684;&#x8BCD;&#xFF1A;</p>
</blockquote>
<pre><code class="lang-java"><span class="hljs-comment">/*
 * Obtain a normalized resource name from REQ.
 */</span>
<span class="hljs-keyword">private</span> <span class="hljs-keyword">static</span> String[] getNormalizedResourceNames(
            HTTPRequest req) ...
<span class="hljs-comment">/*
 * Downcast PARAMETER to TYPE.
 */</span>
<span class="hljs-function"><span class="hljs-keyword">private</span> <span class="hljs-keyword">static</span> Object <span class="hljs-title">downCastParameter</span><span class="hljs-params">(String parameter, String type)</span> ...
<span class="hljs-comment">/*
 * The horizontal padding of each line in the text.
 */</span>
<span class="hljs-keyword">private</span> <span class="hljs-keyword">static</span> <span class="hljs-keyword">final</span> <span class="hljs-keyword">int</span> textHorizontalPadding </span>= <span class="hljs-number">4</span>;
</code></pre>
<p>These comments just take the words from the method or variable name, perhaps add a few words from argument names and types, and form them into a sentence. For example, the only thing in the second comment that isn&#x2019;t in the code is the word &#x201C;to&#x201D;! Once again, these comments could be written just by looking at the declarations, without any understanding the methods of variables; as a result, they have no value.</p>
<blockquote>
<p>&#x8FD9;&#x4E9B;&#x6CE8;&#x91CA;&#x53EA;&#x662F;&#x4ECE;&#x65B9;&#x6CD5;&#x6216;&#x53D8;&#x91CF;&#x540D;&#x4E2D;&#x63D0;&#x53D6;&#x5355;&#x8BCD;&#xFF0C;&#x6216;&#x8005;&#x4ECE;&#x53C2;&#x6570;&#x540D;&#x79F0;&#x548C;&#x7C7B;&#x578B;&#x4E2D;&#x6DFB;&#x52A0;&#x51E0;&#x4E2A;&#x5355;&#x8BCD;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x5B83;&#x4EEC;&#x7EC4;&#x6210;&#x4E00;&#x4E2A;&#x53E5;&#x5B50;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x6CE8;&#x91CA;&#x4E2D;&#x552F;&#x4E00;&#x4E0D;&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#x7684;&#x662F;&#x5355;&#x8BCD;&#x201C; to&#x201D;&#xFF01;&#x518D;&#x8BF4;&#x4E00;&#x6B21;&#xFF0C;&#x8FD9;&#x4E9B;&#x6CE8;&#x91CA;&#x53EF;&#x4EE5;&#x4EC5;&#x901A;&#x8FC7;&#x67E5;&#x770B;&#x58F0;&#x660E;&#x6765;&#x7F16;&#x5199;&#xFF0C;&#x800C;&#x65E0;&#x9700;&#x4EFB;&#x4F55;&#x4E86;&#x89E3;&#x53D8;&#x91CF;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x7ED3;&#x679C;&#xFF0C;&#x5B83;&#x4EEC;&#x6CA1;&#x6709;&#x4EF7;&#x503C;&#x3002;</p>
</blockquote>
<p>img Red Flag: Comment Repeats Code img</p>
<p>If the information in a comment is already obvious from the code next to the comment, then the comment isn&#x2019;t helpful. One example of this is when the comment uses the same words that make up the name of the thing it is describing.</p>
<blockquote>
<p>&#x5982;&#x679C;&#x6CE8;&#x91CA;&#x65C1;&#x8FB9;&#x7684;&#x4EE3;&#x7801;&#x4E2D;&#x7684;&#x6CE8;&#x91CA;&#x4FE1;&#x606F;&#x5DF2;&#x7ECF;&#x5F88;&#x660E;&#x663E;&#xFF0C;&#x5219;&#x6CE8;&#x91CA;&#x65E0;&#x6D4E;&#x4E8E;&#x4E8B;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x662F;&#xFF0C;&#x5F53;&#x6CE8;&#x91CA;&#x4F7F;&#x7528;&#x4E0E;&#x6240;&#x63CF;&#x8FF0;&#x4E8B;&#x7269;&#x540D;&#x79F0;&#x76F8;&#x540C;&#x7684;&#x5355;&#x8BCD;&#x65F6;&#x3002;</p>
</blockquote>
<p>At the same time, there is important information that is missing from the comments: for example, what is a &#x201C;normalized resource name&#x201D;, and what are the elements of the array returned by getNormalizedResourceNames? What does &#x201C;downcast&#x201D; mean? What are the units of padding, and is the padding on one side of each line or both? Describing these things in comments would be helpful.</p>
<blockquote>
<p>&#x540C;&#x65F6;&#xFF0C;&#x6CE8;&#x91CA;&#x4E2D;&#x7F3A;&#x5C11;&#x4E00;&#x4E9B;&#x91CD;&#x8981;&#x4FE1;&#x606F;&#xFF1A;&#x4F8B;&#x5982;&#xFF0C;&#x4EC0;&#x4E48;&#x662F;&#x201C;&#x6807;&#x51C6;&#x5316;&#x8D44;&#x6E90;&#x540D;&#x79F0;&#x201D;&#xFF0C;&#x4EE5;&#x53CA; getNormalizedResourceNames &#x8FD4;&#x56DE;&#x7684;&#x6570;&#x7EC4;&#x7684;&#x5143;&#x7D20;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x201C;&#x8D2C;&#x4F4E;&#x201D;&#x662F;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#xFF1F;&#x586B;&#x5145;&#x7684;&#x5355;&#x4F4D;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x586B;&#x5145;&#x662F;&#x5728;&#x6BCF;&#x884C;&#x7684;&#x4E00;&#x4FA7;&#x8FD8;&#x662F;&#x5728;&#x4E24;&#x8005;&#x7684;&#x4E24;&#x4FA7;&#xFF1F;&#x5728;&#x6CE8;&#x91CA;&#x4E2D;&#x63CF;&#x8FF0;&#x8FD9;&#x4E9B;&#x5185;&#x5BB9;&#x5C06;&#x5F88;&#x6709;&#x5E2E;&#x52A9;&#x3002;</p>
</blockquote>
<p>A first step towards writing good comments is to use different words in the comment from those in the name of the entity being described. Pick words for the comment that provide additional information about the meaning of the entity, rather than just repeating its name. For example, here is a better comment for textHorizontalPadding:</p>
<blockquote>
<p>&#x7F16;&#x5199;&#x826F;&#x597D;&#x8BC4;&#x8BBA;&#x7684;&#x7B2C;&#x4E00;&#x6B65;&#x662F;&#x5728;&#x8BC4;&#x8BBA;&#x4E2D;&#x4F7F;&#x7528;&#x4E0E;&#x6240;&#x63CF;&#x8FF0;&#x5B9E;&#x4F53;&#x540D;&#x79F0;&#x4E0D;&#x540C;&#x7684;&#x8BCD;&#x3002;&#x4E3A;&#x6CE8;&#x91CA;&#x9009;&#x62E9;&#x5355;&#x8BCD;&#xFF0C;&#x4EE5;&#x63D0;&#x4F9B;&#x6709;&#x5173;&#x5B9E;&#x4F53;&#x542B;&#x4E49;&#x7684;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#xFF0C;&#x800C;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x91CD;&#x590D;&#x5176;&#x540D;&#x79F0;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4EE5;&#x4E0B;&#x662F;&#x9488;&#x5BF9; textHorizo&#x200B;&#x200B;ntalPadding &#x7684;&#x66F4;&#x597D;&#x6CE8;&#x91CA;&#xFF1A;</p>
</blockquote>
<pre><code class="lang-java"><span class="hljs-comment">/*
 * The amount of blank space to leave on the left and
 * right sides of each line of text, in pixels.
 */</span>
<span class="hljs-keyword">private</span> <span class="hljs-keyword">static</span> <span class="hljs-keyword">final</span> <span class="hljs-keyword">int</span> textHorizontalPadding = <span class="hljs-number">4</span>;
</code></pre>
<p>This comment provides additional information that is not obvious from the declaration itself, such as the units (pixels) and the fact that padding applies to both sides of each line. Instead of using the term &#x201C;padding&#x201D;, the comment explains what padding is, in case the reader isn&#x2019;t already familiar with the term.</p>
<blockquote>
<p>&#x8BE5;&#x6CE8;&#x91CA;&#x63D0;&#x4F9B;&#x4E86;&#x4ECE;&#x58F0;&#x660E;&#x672C;&#x8EAB;&#x4E0D;&#x660E;&#x663E;&#x7684;&#x5176;&#x4ED6;&#x4FE1;&#x606F;&#xFF0C;&#x4F8B;&#x5982;&#x5355;&#x4F4D;&#xFF08;&#x50CF;&#x7D20;&#xFF09;&#x4EE5;&#x53CA;&#x586B;&#x5145;&#x9002;&#x7528;&#x4E8E;&#x6BCF;&#x884C;&#x4E24;&#x8FB9;&#x7684;&#x4E8B;&#x5B9E;&#x3002;&#x5982;&#x679C;&#x8BFB;&#x8005;&#x4E0D;&#x719F;&#x6089;&#x8BE5;&#x672F;&#x8BED;&#xFF0C;&#x5219;&#x6CE8;&#x91CA;&#x5C06;&#x89E3;&#x91CA;&#x4EC0;&#x4E48;&#x662F;&#x586B;&#x5145;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4F7F;&#x7528;&#x672F;&#x8BED;&#x201C;&#x586B;&#x5145;&#x201D;&#x3002;</p>
</blockquote>
<h2 id="133-lower-level-comments-add-precision-&#x4F4E;&#x7EA7;&#x6CE8;&#x91CA;&#x53EF;&#x63D0;&#x9AD8;&#x7CBE;&#x5EA6;">13.3 Lower-level comments add precision &#x4F4E;&#x7EA7;&#x6CE8;&#x91CA;&#x53EF;&#x63D0;&#x9AD8;&#x7CBE;&#x5EA6;</h2>
<p>Now that you know what not to do, let&#x2019;s discuss what information you should put in comments. Comments augment the code by providing information at a different level of detail. Some comments provide information at a lower, more detailed, level than the code; these comments add precision by clarifying the exact meaning of the code. Other comments provide information at a higher, more abstract, level than the code; these comments offer intuition, such as the reasoning behind the code, or a simpler and more abstract way of thinking about the code. Comments at the same level as the code are likely to repeat the code. This section discusses the lower-level approach in more detail, and the next section discusses the higher-level approach.</p>
<blockquote>
<p>&#x73B0;&#x5728;&#x60A8;&#x77E5;&#x9053;&#x4E86;&#x4E0D;&#x5E94;&#x8BE5;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x5E94;&#x8BE5;&#x5728;&#x6CE8;&#x91CA;&#x4E2D;&#x6DFB;&#x52A0;&#x54EA;&#x4E9B;&#x4FE1;&#x606F;&#x3002;&#x6CE8;&#x91CA;&#x901A;&#x8FC7;&#x63D0;&#x4F9B;&#x4E0D;&#x540C;&#x8BE6;&#x7EC6;&#x7A0B;&#x5EA6;&#x7684;&#x4FE1;&#x606F;&#x6765;&#x589E;&#x5F3A;&#x4EE3;&#x7801;&#x3002;&#x4E00;&#x4E9B;&#x6CE8;&#x91CA;&#x63D0;&#x4F9B;&#x4E86;&#x6BD4;&#x4EE3;&#x7801;&#x66F4;&#x4F4E;&#xFF0C;&#x66F4;&#x8BE6;&#x7EC6;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x8FD9;&#x4E9B;&#x6CE8;&#x91CA;&#x901A;&#x8FC7;&#x9610;&#x660E;&#x4EE3;&#x7801;&#x7684;&#x786E;&#x5207;&#x542B; &#x200B;&#x200B; &#x4E49;&#x6765;&#x589E;&#x52A0;&#x7CBE;&#x5EA6;&#x3002;&#x5176;&#x4ED6;&#x6CE8;&#x91CA;&#x63D0;&#x4F9B;&#x4E86;&#x6BD4;&#x4EE3;&#x7801;&#x66F4;&#x9AD8;&#xFF0C;&#x66F4;&#x62BD;&#x8C61;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x8FD9;&#x4E9B;&#x6CE8;&#x91CA;&#x63D0;&#x4F9B;&#x4E86;&#x76F4;&#x89C9;&#xFF0C;&#x4F8B;&#x5982;&#x4EE3;&#x7801;&#x80CC;&#x540E;&#x7684;&#x63A8;&#x7406;&#xFF0C;&#x6216;&#x8005;&#x66F4;&#x7B80;&#x5355;&#xFF0C;&#x66F4;&#x62BD;&#x8C61;&#x7684;&#x4EE3;&#x7801;&#x601D;&#x8003;&#x65B9;&#x5F0F;&#x3002;&#x4E0E;&#x4EE3;&#x7801;&#x5904;&#x4E8E;&#x540C;&#x4E00;&#x7EA7;&#x522B;&#x7684;&#x6CE8;&#x91CA;&#x53EF;&#x80FD;&#x4F1A;&#x91CD;&#x590D;&#x8BE5;&#x4EE3;&#x7801;&#x3002;&#x672C;&#x8282;&#x5C06;&#x66F4;&#x8BE6;&#x7EC6;&#x5730;&#x8BA8;&#x8BBA;&#x4E0B;&#x5C42;&#x65B9;&#x6CD5;&#xFF0C;&#x800C;&#x4E0B;&#x4E00;&#x8282;&#x5C06;&#x8BA8;&#x8BBA;&#x4E0A;&#x5C42;&#x65B9;&#x6CD5;&#x3002;</p>
</blockquote>
<p>Precision is most useful when commenting variable declarations such as class instance variables, method arguments, and return values. The name and type in a variable declaration are typically not very precise. Comments can fill in missing details such as:</p>
<blockquote>
<p>&#x5728;&#x6CE8;&#x91CA;&#x53D8;&#x91CF;&#x58F0;&#x660E;&#xFF08;&#x4F8B;&#x5982;&#x7C7B;&#x5B9E;&#x4F8B;&#x53D8;&#x91CF;&#xFF0C;&#x65B9;&#x6CD5;&#x53C2;&#x6570;&#x548C;&#x8FD4;&#x56DE;&#x503C;&#xFF09;&#x65F6;&#xFF0C;&#x7CBE;&#x5EA6;&#x6700;&#x6709;&#x7528;&#x3002;&#x53D8;&#x91CF;&#x58F0;&#x660E;&#x4E2D;&#x7684;&#x540D;&#x79F0;&#x548C;&#x7C7B;&#x578B;&#x901A;&#x5E38;&#x4E0D;&#x662F;&#x5F88;&#x7CBE;&#x786E;&#x3002;&#x6CE8;&#x91CA;&#x53EF;&#x4EE5;&#x586B;&#x5199;&#x7F3A;&#x5C11;&#x7684;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;</p>
</blockquote>
<ul>
<li>What are the units for this variable?</li>
<li>Are the boundary conditions inclusive or exclusive?</li>
<li>If a null value is permitted, what does it imply?</li>
<li>If a variable refers to a resource that must eventually be freed or closed, who is responsible for freeing or closing it?</li>
<li>Are there certain properties that are always true for the variable (invariants), such as &#x201C;this list always contains at least one entry&#x201D;?</li>
</ul>
<hr>
<blockquote>
<ul>
<li>&#x6B64;&#x53D8;&#x91CF;&#x7684;&#x5355;&#x4F4D;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;</li>
<li>&#x8FB9;&#x754C;&#x6761;&#x4EF6;&#x662F;&#x5305;&#x5BB9;&#x6027;&#x8FD8;&#x662F;&#x6392;&#x4ED6;&#x6027;&#xFF1F;</li>
<li>&#x5982;&#x679C;&#x5141;&#x8BB8;&#x4F7F;&#x7528;&#x7A7A;&#x503C;&#xFF0C;&#x5219;&#x610F;&#x5473;&#x7740;&#x4EC0;&#x4E48;&#xFF1F;</li>
<li>&#x5982;&#x679C;&#x53D8;&#x91CF;&#x5F15;&#x7528;&#x4E86;&#x6700;&#x7EC8;&#x5FC5;&#x987B;&#x91CA;&#x653E;&#x6216;&#x5173;&#x95ED;&#x7684;&#x8D44;&#x6E90;&#xFF0C;&#x90A3;&#x4E48;&#x8C01;&#x8D1F;&#x8D23;&#x91CA;&#x653E;&#x6216;&#x5173;&#x95ED;&#x8BE5;&#x8D44;&#x6E90;&#xFF1F;</li>
<li>&#x662F;&#x5426;&#x5B58;&#x5728;&#x67D0;&#x4E9B;&#x5BF9;&#x4E8E;&#x53D8;&#x91CF;&#x59CB;&#x7EC8;&#x4E0D;&#x53D8;&#x7684;&#x5C5E;&#x6027;&#xFF08;&#x4E0D;&#x53D8;&#x91CF;&#xFF09;&#xFF0C;&#x4F8B;&#x5982;&#x201C;&#x6B64;&#x5217;&#x8868;&#x59CB;&#x7EC8;&#x5305;&#x542B;&#x81F3;&#x5C11;&#x4E00;&#x4E2A;&#x6761;&#x76EE;&#x201D;&#xFF1F;</li>
</ul>
</blockquote>
<p>Some of this information could potentially be figured out by examining all of the code where the variable is used. However, this is time-consuming and error-prone; the declaration&#x2019;s comment should be clear and complete enough to make this unnecessary. When I say that the comment for a declaration should describe things that aren&#x2019;t obvious from the code, &#x201C;the code&#x201D; refers to the code next to the comment (the declaration), not &#x201C;all of the code in the application.&#x201D;</p>
<blockquote>
<p>&#x901A;&#x8FC7;&#x68C0;&#x67E5;&#x4F7F;&#x7528;&#x8BE5;&#x53D8;&#x91CF;&#x7684;&#x6240;&#x6709;&#x4EE3;&#x7801;&#xFF0C;&#x53EF;&#x4EE5;&#x6F5C;&#x5728;&#x5730;&#x4E86;&#x89E3;&#x67D0;&#x4E9B;&#x4FE1;&#x606F;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x8FD9;&#x5F88;&#x8017;&#x65F6;&#x4E14;&#x5BB9;&#x6613;&#x51FA;&#x9519;&#x3002;&#x5BA3;&#x8A00;&#x7684;&#x8BC4;&#x8BBA;&#x5E94;&#x6E05;&#x6670;&#xFF0C;&#x5B8C;&#x6574;&#xFF0C;&#x4EE5;&#x514D;&#x4E0D;&#x5FC5;&#x8981;&#x3002;&#x5F53;&#x6211;&#x8BF4;&#x58F0;&#x660E;&#x7684;&#x6CE8;&#x91CA;&#x5E94;&#x63CF;&#x8FF0;&#x4EE3;&#x7801;&#x4E2D;&#x4E0D;&#x660E;&#x663E;&#x7684;&#x5185;&#x5BB9;&#x65F6;&#xFF0C;&#x201C;&#x4EE3;&#x7801;&#x201D;&#x662F;&#x6307;&#x6CE8;&#x91CA;&#xFF08;&#x58F0;&#x660E;&#xFF09;&#x65C1;&#x8FB9;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x201C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x4EE3;&#x7801;&#x201D;&#x3002;</p>
</blockquote>
<p>The most common problem with comments for variables is that the comments are too vague. Here are two examples of comments that aren&#x2019;t precise enough:</p>
<blockquote>
<p>&#x53D8;&#x91CF;&#x6CE8;&#x91CA;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x95EE;&#x9898;&#x662F;&#x6CE8;&#x91CA;&#x592A;&#x6A21;&#x7CCA;&#x3002;&#x8FD9;&#x662F;&#x4E24;&#x4E2A;&#x4E0D;&#x591F;&#x7CBE;&#x786E;&#x7684;&#x6CE8;&#x91CA;&#x793A;&#x4F8B;&#xFF1A;</p>
</blockquote>
<pre><code class="lang-java"><span class="hljs-comment">// Current offset in resp Buffer</span>
uint32_t offset;

<span class="hljs-comment">// Contains all line-widths inside the document and</span>
<span class="hljs-comment">// number of appearances.</span>
<span class="hljs-keyword">private</span> TreeMap&lt;Integer, Integer&gt; lineWidths;
</code></pre>
<p>In the first example, it&#x2019;s not clear what &#x201C;current&#x201D; means. In the second example, it&#x2019;s not clear that the keys in the TreeMap are line widths and values are occurrence counts. Also, are widths measured in pixels or characters? The revised comments below provide additional details:</p>
<blockquote>
<p>&#x5728;&#x7B2C;&#x4E00;&#x4E2A;&#x793A;&#x4F8B;&#x4E2D;&#xFF0C;&#x5C1A;&#x4E0D;&#x6E05;&#x695A;&#x201C;&#x5F53;&#x524D;&#x201D;&#x7684;&#x542B;&#x4E49;&#x3002;&#x5728;&#x7B2C;&#x4E8C;&#x4E2A;&#x793A;&#x4F8B;&#x4E2D;&#xFF0C;&#x5C1A;&#x4E0D;&#x6E05;&#x695A; TreeMap &#x4E2D;&#x7684;&#x952E;&#x662F;&#x7EBF;&#x5BBD;&#xFF0C;&#x503C;&#x662F;&#x51FA;&#x73B0;&#x6B21;&#x6570;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x5BBD;&#x5EA6;&#x662F;&#x4EE5;&#x50CF;&#x7D20;&#x6216;&#x5B57;&#x7B26;&#x4E3A;&#x5355;&#x4F4D;&#x6D4B;&#x91CF;&#x7684;&#x5417;&#xFF1F;&#x4EE5;&#x4E0B;&#x4FEE;&#x8BA2;&#x540E;&#x7684;&#x6CE8;&#x91CA;&#x63D0;&#x4F9B;&#x4E86;&#x66F4;&#x591A;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#xFF1A;</p>
</blockquote>
<pre><code class="lang-java"><span class="hljs-comment">//  Position in this buffer of the first object that hasn&apos;t</span>
<span class="hljs-comment">//  been returned to the client.</span>
uint32_t offset;

<span class="hljs-comment">//  Holds statistics about line lengths of the form &lt;length, count&gt;</span>
<span class="hljs-comment">//  where length is the number of characters in a line (including</span>
<span class="hljs-comment">//  the newline), and count is the number of lines with</span>
<span class="hljs-comment">//  exactly that many characters. If there are no lines with</span>
<span class="hljs-comment">//  a particular length, then there is no entry for that length.</span>
<span class="hljs-keyword">private</span> TreeMap&lt;Integer, Integer&gt; numLinesWithLength;
</code></pre>
<p>The second declaration uses a longer name that conveys more information. It also changes &#x201C;width&#x201D; to &#x201C;length&#x201D;, because this term is more likely to make people think that the units are characters rather than pixels. Notice that the second comment documents not only the details of each entry, but also what it means if an entry is missing.</p>
<blockquote>
<p>&#x7B2C;&#x4E8C;&#x4E2A;&#x58F0;&#x660E;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x8F83;&#x957F;&#x7684;&#x540D;&#x79F0;&#x6765;&#x4F20;&#x8FBE;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#x3002;&#x5B83;&#x8FD8;&#x5C06;&#x201C;&#x5BBD;&#x5EA6;&#x201D;&#x66F4;&#x6539;&#x4E3A;&#x201C;&#x957F;&#x5EA6;&#x201D;&#xFF0C;&#x56E0;&#x4E3A;&#x8BE5;&#x672F;&#x8BED;&#x66F4;&#x53EF;&#x80FD;&#x4F7F;&#x4EBA;&#x4EEC;&#x8BA4;&#x4E3A;&#x5355;&#x4F4D;&#x662F;&#x5B57;&#x7B26;&#x800C;&#x4E0D;&#x662F;&#x50CF;&#x7D20;&#x3002;&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x7B2C;&#x4E8C;&#x6761;&#x6CE8;&#x91CA;&#x4E0D;&#x4EC5;&#x8BB0;&#x5F55;&#x4E86;&#x6BCF;&#x4E2A;&#x6761;&#x76EE;&#x7684;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#xFF0C;&#x8FD8;&#x8BB0;&#x5F55;&#x4E86;&#x7F3A;&#x5C11;&#x6761;&#x76EE;&#x7684;&#x542B;&#x4E49;&#x3002;</p>
</blockquote>
<p>When documenting a variable, think nouns, not verbs. In other words, focus on what the variable represents, not how it is manipulated. Consider the following comment:</p>
<blockquote>
<p>&#x5728;&#x8BB0;&#x5F55;&#x53D8;&#x91CF;&#x65F6;&#xFF0C;&#x8BF7;&#x8003;&#x8651;&#x540D;&#x8BCD;&#x800C;&#x4E0D;&#x662F;&#x52A8;&#x8BCD;&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x5173;&#x6CE8;&#x53D8;&#x91CF;&#x4EE3;&#x8868;&#x4EC0;&#x4E48;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5982;&#x4F55;&#x64CD;&#x7EB5;&#x53D8;&#x91CF;&#x3002;&#x8003;&#x8651;&#x4EE5;&#x4E0B;&#x8BC4;&#x8BBA;&#xFF1A;</p>
</blockquote>
<pre><code class="lang-java"><span class="hljs-comment">/* FOLLOWER VARIABLE: indicator variable that allows the Receiver and the
 * PeriodicTasks thread to communicate about whether a heartbeat has been
 * received within the follower&apos;s election timeout window.
 * Toggled to TRUE when a valid heartbeat is received.
 * Toggled to FALSE when the election timeout window is reset.  */</span>
<span class="hljs-keyword">private</span> <span class="hljs-keyword">boolean</span> receivedValidHeartbeat;
</code></pre>
<p>This documentation describes how the variable is modified by several pieces of code in the class. The comment will be both shorter and more useful if it describes what the variable represents rather than mirroring the code structure:</p>
<blockquote>
<p>&#x672C;&#x6587;&#x6863;&#x63CF;&#x8FF0;&#x4E86;&#x5982;&#x4F55;&#x901A;&#x8FC7;&#x7C7B;&#x4E2D;&#x7684;&#x51E0;&#x6BB5;&#x4EE3;&#x7801;&#x6765;&#x4FEE;&#x6539;&#x53D8;&#x91CF;&#x3002;&#x5982;&#x679C;&#x6CE8;&#x91CA;&#x63CF;&#x8FF0;&#x53D8;&#x91CF;&#x4EE3;&#x8868;&#x4EC0;&#x4E48;&#x800C;&#x4E0D;&#x662F;&#x955C;&#x50CF;&#x4EE3;&#x7801;&#x7ED3;&#x6784;&#xFF0C;&#x5219;&#x6CE8;&#x91CA;&#x5C06;&#x66F4;&#x77ED;&#x4E14;&#x66F4;&#x6709;&#x7528;&#xFF1A;</p>
</blockquote>
<pre><code class="lang-java"><span class="hljs-comment">/* True means that a heartbeat has been received since the last time
 * the election timer was reset. Used for communication between the
 * Receiver and PeriodicTasks threads.  */</span>
<span class="hljs-keyword">private</span> <span class="hljs-keyword">boolean</span> receivedValidHeartbeat;
</code></pre>
<p>Given this documentation, it&#x2019;s easy to infer that the variable must be set to true when a heartbeat is received and false when the election timer is reset.</p>
<blockquote>
<p>&#x6839;&#x636E;&#x672C;&#x6587;&#x6863;&#xFF0C;&#x5F88;&#x5BB9;&#x6613;&#x63A8;&#x65AD;&#x51FA;&#xFF0C;&#x5F53;&#x63A5;&#x6536;&#x5230;&#x5FC3;&#x8DF3;&#x4FE1;&#x53F7;&#x65F6;&#xFF0C;&#x53D8;&#x91CF;&#x5FC5;&#x987B;&#x8BBE;&#x7F6E;&#x4E3A; true&#xFF1B;&#x800C;&#x5F53;&#x91CD;&#x7F6E;&#x9009;&#x4E3E;&#x8BA1;&#x65F6;&#x5668;&#x65F6;&#xFF0C;&#x5219;&#x5FC5;&#x987B;&#x5C06;&#x53D8;&#x91CF;&#x8BBE;&#x7F6E;&#x4E3A; false&#x3002;</p>
</blockquote>
<h2 id="134-higher-level-comments-enhance-intuition-&#x9AD8;&#x7EA7;&#x6CE8;&#x91CA;&#x53EF;&#x589E;&#x5F3A;&#x76F4;&#x89C9;">13.4 Higher-level comments enhance intuition &#x9AD8;&#x7EA7;&#x6CE8;&#x91CA;&#x53EF;&#x589E;&#x5F3A;&#x76F4;&#x89C9;</h2>
<p>The second way in which comments can augment code is by providing intuition. These comments are written at a higher level than the code. They omit details and help the reader to understand the overall intent and structure of the code. This approach is commonly used for comments inside methods, and for interface comments. For example, consider the following code:</p>
<blockquote>
<p>&#x6CE8;&#x91CA;&#x53EF;&#x4EE5;&#x589E;&#x52A0;&#x4EE3;&#x7801;&#x7684;&#x7B2C;&#x4E8C;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x63D0;&#x4F9B;&#x76F4;&#x89C9;&#x3002;&#x8FD9;&#x4E9B;&#x6CE8;&#x91CA;&#x662F;&#x5728;&#x6BD4;&#x4EE3;&#x7801;&#x66F4;&#x9AD8;&#x7684;&#x7EA7;&#x522B;&#x4E0A;&#x7F16;&#x5199;&#x7684;&#x3002;&#x5B83;&#x4EEC;&#x5FFD;&#x7565;&#x4E86;&#x7EC6;&#x8282;&#xFF0C;&#x5E76;&#x5E2E;&#x52A9;&#x8BFB;&#x8005;&#x7406;&#x89E3;&#x4E86;&#x4EE3;&#x7801;&#x7684;&#x6574;&#x4F53;&#x610F;&#x56FE;&#x548C;&#x7ED3;&#x6784;&#x3002;&#x6B64;&#x65B9;&#x6CD5;&#x901A;&#x5E38;&#x7528;&#x4E8E;&#x65B9;&#x6CD5;&#x5185;&#x90E8;&#x7684;&#x6CE8;&#x91CA;&#x4EE5;&#x53CA;&#x63A5;&#x53E3;&#x6CE8;&#x91CA;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x8003;&#x8651;&#x4EE5;&#x4E0B;&#x4EE3;&#x7801;&#xFF1A;</p>
</blockquote>
<pre><code class="lang-java"><span class="hljs-comment">// If there is a LOADING readRpc using the same session</span>
<span class="hljs-comment">// as PKHash pointed to by assignPos, and the last PKHash</span>
<span class="hljs-comment">// in that readRPC is smaller than current assigning</span>
<span class="hljs-comment">// PKHash, then we put assigning PKHash into that readRPC.</span>
<span class="hljs-keyword">int</span> readActiveRpcId = RPC_ID_NOT_ASSIGNED;
<span class="hljs-keyword">for</span> (<span class="hljs-keyword">int</span> i = <span class="hljs-number">0</span>; i &lt; NUM_READ_RPC; i++) {
    <span class="hljs-keyword">if</span> (session == readRpc[i].session
            &amp;&amp; readRpc[i].status == LOADING
            &amp;&amp; readRpc[i].maxPos &lt; assignPos
            &amp;&amp; readRpc[i].numHashes &lt; MAX_PKHASHES_PERRPC) {
        readActiveRpcId = i;
        <span class="hljs-keyword">break</span>;
    }
}
</code></pre>
<p>The comment is too low-level and detailed. On the one hand, it partially repeats the code: &#x201C;if there is a LOADING readRPC&#x201D; just duplicates the test <code>readRpc[i].status == LOADING</code>. On the other hand, the comment doesn&#x2019;t explain the overall purpose of this code, or how it fits into the method that contains it. As a result, the comment doesn&#x2019;t help the reader to understand the code.</p>
<blockquote>
<p>&#x8BE5;&#x8BC4;&#x8BBA;&#x592A;&#x5E95;&#x5C42;&#x548C;&#x592A;&#x8BE6;&#x7EC6;&#x3002;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x5B83;&#x90E8;&#x5206;&#x91CD;&#x590D;&#x4E86;&#x4EE3;&#x7801;&#xFF1A;&#x201C;&#x5982;&#x679C;&#x6709; LOADING readRPC&#x201D;&#x4EC5;&#x91CD;&#x590D;&#x6D4B;&#x8BD5; <code>readRpc[i].status == LOADING</code>&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x6CE8;&#x91CA;&#x4E0D;&#x80FD;&#x89E3;&#x91CA;&#x6B64;&#x4EE3;&#x7801;&#x7684;&#x603B;&#x4F53;&#x76EE;&#x7684;&#xFF0C;&#x4E5F;&#x4E0D;&#x80FD;&#x89E3;&#x91CA;&#x5176;&#x5982;&#x4F55;&#x9002;&#x5408;&#x5305;&#x542B;&#x6B64;&#x4EE3;&#x7801;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x5982;&#x6B64;&#x4E00;&#x6765;&#x6CE8;&#x91CA;&#x4E0D;&#x80FD;&#x5E2E;&#x52A9;&#x8BFB;&#x8005;&#x7406;&#x89E3;&#x4EE3;&#x7801;&#x3002;</p>
</blockquote>
<p>Here is a better comment:</p>
<blockquote>
<p>&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x66F4;&#x597D;&#x7684;&#x8BC4;&#x8BBA;&#xFF1A;</p>
</blockquote>
<pre><code class="lang-java"><span class="hljs-comment">// Try to append the current key hash onto an existing</span>
<span class="hljs-comment">// RPC to the desired server that hasn&apos;t been sent yet.</span>
</code></pre>
<p>This comment doesn&#x2019;t contain any details; instead, it describes the code&#x2019;s overall function at a higher level. With this high-level information, a reader can explain almost everything that happens in the code: the loop must be iterating over all the existing remote procedure calls (RPCs); the session test is probably used to see if a particular RPC is destined for the right server; the LOADING test suggests that RPCs can have multiple states, and in some states it isn&#x2019;t safe to add more hashes; the MAX - PKHASHES_PERRPC test suggests that there is a limit to how many hashes can be sent in a single RPC. The only thing not explained by the comment is the maxPos test. Furthermore, the new comment provides a basis for readers to judge the code: does it do everything that is needed to add the key hash to an existing RPC? The original comment didn&#x2019;t describe the overall intent of the code, so it&#x2019;s hard for a reader to decide whether the code is behaving correctly.</p>
<blockquote>
<p>&#x6B64;&#x8BC4;&#x8BBA;&#x4E0D;&#x5305;&#x542B;&#x4EFB;&#x4F55;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x5B83;&#x5728;&#x66F4;&#x9AD8;&#x7EA7;&#x522B;&#x4E0A;&#x63CF;&#x8FF0;&#x4E86;&#x4EE3;&#x7801;&#x7684;&#x6574;&#x4F53;&#x529F;&#x80FD;&#x3002;&#x6709;&#x4E86;&#x8FD9;&#x4E9B;&#x9AD8;&#x7EA7;&#x4FE1;&#x606F;&#xFF0C;&#x8BFB;&#x8005;&#x5C31;&#x53EF;&#x4EE5;&#x89E3;&#x91CA;&#x4EE3;&#x7801;&#x4E2D;&#x51E0;&#x4E4E;&#x53D1;&#x751F;&#x7684;&#x6240;&#x6709;&#x4E8B;&#x60C5;&#xFF1A;&#x5FAA;&#x73AF;&#x5FC5;&#x987B;&#x904D;&#x5386;&#x6240;&#x6709;&#x73B0;&#x6709;&#x7684;&#x8FDC;&#x7A0B;&#x8FC7;&#x7A0B;&#x8C03;&#x7528;&#xFF08;RPC&#xFF09;&#xFF1B;&#x4F1A;&#x8BDD;&#x6D4B;&#x8BD5;&#x53EF;&#x80FD;&#x7528;&#x4E8E;&#x67E5;&#x770B;&#x7279;&#x5B9A;&#x7684; RPC &#x662F;&#x5426;&#x53D1;&#x5F80;&#x6B63;&#x786E;&#x7684;&#x670D;&#x52A1;&#x5668;&#xFF1B;LOADING &#x6D4B;&#x8BD5;&#x8868;&#x660E; RPC &#x53EF;&#x4EE5;&#x5177;&#x6709;&#x591A;&#x4E2A;&#x72B6;&#x6001;&#xFF0C;&#x5728;&#x67D0;&#x4E9B;&#x72B6;&#x6001;&#x4E0B;&#x6DFB;&#x52A0;&#x66F4;&#x591A;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#x662F;&#x4E0D;&#x5B89;&#x5168;&#x7684;&#xFF1B;MAX-PKHASHES_PERRPC &#x6D4B;&#x8BD5;&#x8868;&#x660E;&#x5728;&#x5355;&#x4E2A; RPC &#x4E2D;&#x53EF;&#x4EE5;&#x53D1;&#x9001;&#x591A;&#x5C11;&#x4E2A;&#x54C8;&#x5E0C;&#x503C;&#x662F;&#x6709;&#x9650;&#x5236;&#x7684;&#x3002;&#x6CE8;&#x91CA;&#x4E2D;&#x552F;&#x4E00;&#x6CA1;&#x6709;&#x89E3;&#x91CA;&#x7684;&#x662F; maxPos &#x6D4B;&#x8BD5;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x65B0;&#x6CE8;&#x91CA;&#x4E3A;&#x8BFB;&#x8005;&#x5224;&#x65AD;&#x4EE3;&#x7801;&#x63D0;&#x4F9B;&#x4E86;&#x57FA;&#x7840;&#xFF1A;&#x5B83;&#x53EF;&#x4EE5;&#x5B8C;&#x6210;&#x5C06;&#x5BC6;&#x94A5;&#x54C8;&#x5E0C;&#x6DFB;&#x52A0;&#x5230;&#x73B0;&#x6709; RPC &#x6240;&#x9700;&#x7684;&#x4E00;&#x5207;&#x5417;&#xFF1F;&#x539F;&#x59CB;&#x6CE8;&#x91CA;&#x5E76;&#x672A;&#x63CF;&#x8FF0;&#x4EE3;&#x7801;&#x7684;&#x6574;&#x4F53;&#x610F;&#x56FE;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x8BFB;&#x8005;&#x5F88;&#x96BE;&#x786E;&#x5B9A;&#x4EE3;&#x7801;&#x662F;&#x5426;&#x884C;&#x4E3A;&#x6B63;&#x786E;&#x3002;</p>
</blockquote>
<p>Higher-level comments are more difficult to write than lower-level comments because you must think about the code in a different way. Ask yourself: What is this code trying to do? What is the simplest thing you can say that explains everything in the code? What is the most important thing about this code?</p>
<blockquote>
<p>&#x9AD8;&#x7EA7;&#x522B;&#x7684;&#x6CE8;&#x91CA;&#x6BD4;&#x4F4E;&#x7EA7;&#x522B;&#x7684;&#x6CE8;&#x91CA;&#x66F4;&#x96BE;&#x7F16;&#x5199;&#xFF0C;&#x56E0;&#x4E3A;&#x60A8;&#x5FC5;&#x987B;&#x4EE5;&#x4E0D;&#x540C;&#x7684;&#x65B9;&#x5F0F;&#x8003;&#x8651;&#x4EE3;&#x7801;&#x3002;&#x95EE;&#x95EE;&#x81EA;&#x5DF1;&#xFF1A;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x8981;&#x505A;&#x4EC0;&#x4E48;&#xFF1F;&#x60A8;&#x80FD;&#x8BF4;&#x4EC0;&#x4E48;&#x6700;&#x7B80;&#x5355;&#x7684;&#x4E1C;&#x897F;&#x6765;&#x89E3;&#x91CA;&#x4EE3;&#x7801;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x5185;&#x5BB9;&#xFF1F;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x6700;&#x91CD;&#x8981;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;</p>
</blockquote>
<p>Engineers tend to be very detail-oriented. We love details and are good at managing lots of them; this is essential for being a good engineer. But, great software designers can also step back from the details and think about a system at a higher level. This means deciding which aspects of the system are most important, and being able to ignore the low-level details and think about the system only in terms of its most fundamental characteristics. This is the essence of abstraction (finding a simple way to think about a complex entity), and it&#x2019;s also what you must do when writing higher-level comments. A good higher-level comment expresses one or a few simple ideas that provide a conceptual framework, such as &#x201C;append to an existing RPC.&#x201D; Given the framework, it becomes easy to see how specific code statements relate to the overall goal.</p>
<blockquote>
<p>&#x5DE5;&#x7A0B;&#x5E08;&#x5F80;&#x5F80;&#x975E;&#x5E38;&#x6CE8;&#x91CD;&#x7EC6;&#x8282;&#x3002;&#x6211;&#x4EEC;&#x559C;&#x6B22;&#x7EC6;&#x8282;&#xFF0C;&#x5584;&#x4E8E;&#x7BA1;&#x7406;&#x5176;&#x4E2D;&#x7684;&#x8BB8;&#x591A;&#x7EC6;&#x8282;&#xFF1B;&#x8FD9;&#x5BF9;&#x4E8E;&#x6210;&#x4E3A;&#x4E00;&#x540D;&#x4F18;&#x79C0;&#x7684;&#x5DE5;&#x7A0B;&#x5E08;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x4F18;&#x79C0;&#x7684;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x5E08;&#x4E5F;&#x53EF;&#x4EE5;&#x4ECE;&#x7EC6;&#x8282;&#x9000;&#x540E;&#x4E00;&#x6B65;&#xFF0C;&#x4ECE;&#x66F4;&#x9AD8;&#x5C42;&#x6B21;&#x8003;&#x8651;&#x7CFB;&#x7EDF;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x8981;&#x786E;&#x5B9A;&#x7CFB;&#x7EDF;&#x7684;&#x54EA;&#x4E9B;&#x65B9;&#x9762;&#x6700;&#x91CD;&#x8981;&#xFF0C;&#x5E76;&#x4E14;&#x80FD;&#x591F;&#x5FFD;&#x7565;&#x5E95;&#x5C42;&#x7EC6;&#x8282;&#xFF0C;&#x4EC5;&#x6839;&#x636E;&#x7CFB;&#x7EDF;&#x7684;&#x6700;&#x57FA;&#x672C;&#x7279;&#x5F81;&#x6765;&#x8003;&#x8651;&#x7CFB;&#x7EDF;&#x3002;&#x8FD9;&#x662F;&#x62BD;&#x8C61;&#x7684;&#x672C;&#x8D28;&#xFF08;&#x627E;&#x5230;&#x4E00;&#x79CD;&#x601D;&#x8003;&#x590D;&#x6742;&#x5B9E;&#x4F53;&#x7684;&#x7B80;&#x5355;&#x65B9;&#x6CD5;&#xFF09;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x7F16;&#x5199;&#x9AD8;&#x7EA7;&#x6CE8;&#x91CA;&#x65F6;&#x5FC5;&#x987B;&#x6267;&#x884C;&#x7684;&#x64CD;&#x4F5C;&#x3002;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x9AD8;&#x5C42;&#x6CE8;&#x91CA;&#x8868;&#x8FBE;&#x4E86;&#x4E00;&#x4E2A;&#x6216;&#x51E0;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x8FD9;&#x4E9B;&#x60F3;&#x6CD5;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x6982;&#x5FF5;&#x6846;&#x67B6;&#xFF0C;&#x4F8B;&#x5982;&#x201C;&#x9644;&#x52A0;&#x5230;&#x73B0;&#x6709;&#x7684; RPC&#x201D;&#x3002;&#x4F7F;&#x7528;&#x8BE5;&#x6846;&#x67B6;&#xFF0C;&#x53EF;&#x4EE5;&#x5F88;&#x5BB9;&#x6613;&#x5730;&#x770B;&#x5230;&#x7279;&#x5B9A;&#x7684;&#x4EE3;&#x7801;&#x8BED;&#x53E5;&#x4E0E;&#x603B;&#x4F53;&#x76EE;&#x6807;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x3002;</p>
</blockquote>
<p>Here is another code sample, which has a good higher-level comment:</p>
<blockquote>
<p>&#x8FD9;&#x662F;&#x53E6;&#x4E00;&#x4E2A;&#x4EE3;&#x7801;&#x793A;&#x4F8B;&#xFF0C;&#x5177;&#x6709;&#x8F83;&#x9AD8;&#x5C42;&#x6B21;&#x7684;&#x6CE8;&#x91CA;&#xFF1A;</p>
</blockquote>
<pre><code class="lang-java"><span class="hljs-keyword">if</span> (numProcessedPKHashes &lt; readRpc[i].numHashes) {
    <span class="hljs-comment">// Some of the key hashes couldn&apos;t be looked up in</span>
    <span class="hljs-comment">// this request (either because they aren&apos;t stored</span>
    <span class="hljs-comment">// on the server, the server crashed, or there</span>
    <span class="hljs-comment">// wasn&apos;t enough space in the response message).</span>
    <span class="hljs-comment">// Mark the unprocessed hashes so they will get</span>
    <span class="hljs-comment">// reassigned to new RPCs.</span>
    <span class="hljs-keyword">for</span> (size_t p = removePos; p &lt; insertPos; p++) {
        <span class="hljs-keyword">if</span> (activeRpcId[p] == i) {
            <span class="hljs-keyword">if</span> (numProcessedPKHashes &gt; <span class="hljs-number">0</span>) {
                numProcessedPKHashes--;
            } <span class="hljs-keyword">else</span> {
                <span class="hljs-keyword">if</span> (p &lt; assignPos)
                    assignPos = p;
                activeRpcId[p] = RPC_ID_NOT_ASSIGNED;
            }
        }
    }
}
</code></pre>
<p>This comment does two things. The second sentence provides an abstract description of what the code does. The first sentence is different: it explains (in high level terms) why the code is executed. Comments of the form &#x201C;how we get here&#x201D; are very useful for helping people to understand code. For example, when documenting a method, it can be very helpful to describe the conditions under which the method is most likely to be invoked (especially if the method is only invoked in unusual situations).</p>
<blockquote>
<p>&#x6B64;&#x8BC4;&#x8BBA;&#x6709;&#x4E24;&#x4EF6;&#x4E8B;&#x3002;&#x7B2C;&#x4E8C;&#x53E5;&#x8BDD;&#x63D0;&#x4F9B;&#x4E86;&#x4EE3;&#x7801;&#x529F;&#x80FD;&#x7684;&#x62BD;&#x8C61;&#x63CF;&#x8FF0;&#x3002;&#x7B2C;&#x4E00;&#x53E5;&#x8BDD;&#x662F;&#x4E0D;&#x540C;&#x7684;&#xFF1A;&#x5B83;&#x4EE5;&#x9AD8;&#x7EA7;&#x7684;&#x65B9;&#x5F0F;&#x89E3;&#x91CA;&#x4E86;&#x4E3A;&#x4EC0;&#x4E48;&#x6267;&#x884C;&#x4EE3;&#x7801;&#x3002;&#x201C;&#x5982;&#x4F55;&#x5230;&#x8FBE;&#x8FD9;&#x91CC;&#x201D;&#x5F62;&#x5F0F;&#x7684;&#x6CE8;&#x91CA;&#x5BF9;&#x4E8E;&#x5E2E;&#x52A9;&#x4EBA;&#x4EEC;&#x7406;&#x89E3;&#x4EE3;&#x7801;&#x975E;&#x5E38;&#x6709;&#x7528;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5728;&#x8BB0;&#x5F55;&#x65B9;&#x6CD5;&#x65F6;&#xFF0C;&#x63CF;&#x8FF0;&#x6700;&#x6709;&#x53EF;&#x80FD;&#x5728;&#x4EC0;&#x4E48;&#x60C5;&#x51B5;&#x4E0B;&#x8C03;&#x7528;&#x8BE5;&#x65B9;&#x6CD5;&#x7684;&#x6761;&#x4EF6;&#xFF08;&#x7279;&#x522B;&#x662F;&#x4EC5;&#x5728;&#x5F02;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#x8C03;&#x7528;&#x8BE5;&#x65B9;&#x6CD5;&#x7684;&#x60C5;&#x51B5;&#xFF09;&#x4F1A;&#x975E;&#x5E38;&#x6709;&#x5E2E;&#x52A9;&#x3002;</p>
</blockquote>
<h2 id="135-interface-documentation-&#x63A5;&#x53E3;&#x6587;&#x6863;">13.5 Interface documentation &#x63A5;&#x53E3;&#x6587;&#x6863;</h2>
<p>One of the most important roles for comments is to define abstractions. Recall from Chapter 4 that an abstraction is a simplified view of an entity, which preserves essential information but omits details that can safely be ignored. Code isn&#x2019;t suitable for describing abstractions; it&#x2019;s too low level and it includes implementation details that shouldn&#x2019;t be visible in the abstraction. The only way to describe an abstraction is with comments. If you want code that presents good abstractions, you must document those abstractions with comments.</p>
<blockquote>
<p>&#x6CE8;&#x91CA;&#x6700;&#x91CD;&#x8981;&#x7684;&#x4F5C;&#x7528;&#x4E4B;&#x4E00;&#x5C31;&#x662F;&#x5B9A;&#x4E49;&#x62BD;&#x8C61;&#x3002;&#x56DE;&#x60F3;&#x4E00;&#x4E0B;&#x7B2C; 4 &#x7AE0;&#xFF0C;&#x62BD;&#x8C61;&#x662F;&#x5B9E;&#x4F53;&#x7684;&#x7B80;&#x5316;&#x89C6;&#x56FE;&#xFF0C;&#x5B83;&#x4FDD;&#x7559;&#x4E86;&#x57FA;&#x672C;&#x4FE1;&#x606F;&#xFF0C;&#x4F46;&#x7701;&#x7565;&#x4E86;&#x53EF;&#x4EE5;&#x5B89;&#x5168;&#x5FFD;&#x7565;&#x7684;&#x7EC6;&#x8282;&#x3002;&#x4EE3;&#x7801;&#x4E0D;&#x9002;&#x5408;&#x63CF;&#x8FF0;&#x62BD;&#x8C61;&#xFF1B;&#x5B83;&#x7684;&#x7EA7;&#x522B;&#x592A;&#x4F4E;&#xFF0C;&#x5B83;&#x5305;&#x542B;&#x5B9E;&#x73B0;&#x7EC6;&#x8282;&#xFF0C;&#x8FD9;&#x4E9B;&#x7EC6;&#x8282;&#x5728;&#x62BD;&#x8C61;&#x4E2D;&#x4E0D;&#x5E94;&#x8BE5;&#x770B;&#x5230;&#x3002;&#x63CF;&#x8FF0;&#x62BD;&#x8C61;&#x7684;&#x552F;&#x4E00;&#x65B9;&#x6CD5;&#x662F;&#x4F7F;&#x7528;&#x6CE8;&#x91CA;&#x3002;&#x5982;&#x679C;&#x60A8;&#x60F3;&#x8981;&#x5448;&#x73B0;&#x826F;&#x597D;&#x62BD;&#x8C61;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x5219;&#x5FC5;&#x987B;&#x7528;&#x6CE8;&#x91CA;&#x8BB0;&#x5F55;&#x8FD9;&#x4E9B;&#x62BD;&#x8C61;&#x3002;</p>
</blockquote>
<p>The first step in documenting abstractions is to separate interface comments from implementation comments. Interface comments provide information that someone needs to know in order to use a class or method; they define the abstraction. Implementation comments describe how a class or method works internally in order to implement the abstraction. It&#x2019;s important to separate these two kinds of comments, so that users of an interface are not exposed to implementation details. Furthermore, these two forms had better be different. If interface comments must also describe the implementation, then the class or method is shallow. This means that the act of writing comments can provide clues about the quality of a design; Chapter 15 will return to this idea.</p>
<blockquote>
<p>&#x8BB0;&#x5F55;&#x62BD;&#x8C61;&#x7684;&#x7B2C;&#x4E00;&#x6B65;&#x662F;&#x5C06;&#x63A5;&#x53E3;&#x6CE8;&#x91CA;&#x4E0E;&#x5B9E;&#x73B0;&#x6CE8;&#x91CA;&#x5206;&#x5F00;&#x3002;&#x63A5;&#x53E3;&#x6CE8;&#x91CA;&#x63D0;&#x4F9B;&#x4E86;&#x4F7F;&#x7528;&#x7C7B;&#x6216;&#x65B9;&#x6CD5;&#x65F6;&#x9700;&#x8981;&#x77E5;&#x9053;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x4ED6;&#x4EEC;&#x5B9A;&#x4E49;&#x4E86;&#x62BD;&#x8C61;&#x3002;&#x5B9E;&#x73B0;&#x6CE8;&#x91CA;&#x63CF;&#x8FF0;&#x4E86;&#x7C7B;&#x6216;&#x65B9;&#x6CD5;&#x5982;&#x4F55;&#x5728;&#x5185;&#x90E8;&#x5DE5;&#x4F5C;&#x4EE5;&#x5B9E;&#x73B0;&#x62BD;&#x8C61;&#x3002;&#x533A;&#x5206;&#x8FD9;&#x4E24;&#x79CD;&#x6CE8;&#x91CA;&#x5F88;&#x91CD;&#x8981;&#xFF0C;&#x8FD9;&#x6837;&#x754C;&#x9762;&#x7684;&#x7528;&#x6237;&#x5C31;&#x4E0D;&#x4F1A;&#x66B4;&#x9732;&#x4E8E;&#x5B9E;&#x73B0;&#x7EC6;&#x8282;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x8FD9;&#x4E24;&#x79CD;&#x5F62;&#x5F0F;&#x6700;&#x597D;&#x6709;&#x6240;&#x4E0D;&#x540C;&#x3002;&#x5982;&#x679C;&#x63A5;&#x53E3;&#x6CE8;&#x91CA;&#x4E5F;&#x5FC5;&#x987B;&#x63CF;&#x8FF0;&#x5B9E;&#x73B0;&#xFF0C;&#x5219;&#x8BE5;&#x7C7B;&#x6216;&#x65B9;&#x6CD5;&#x5F88;&#x6D45;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x64B0;&#x5199;&#x8BC4;&#x8BBA;&#x7684;&#x884C;&#x4E3A;&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;&#x6709;&#x5173;&#x8BBE;&#x8BA1;&#x8D28;&#x91CF;&#x7684;&#x7EBF;&#x7D22;&#xFF1B;&#x7B2C; 15 &#x7AE0;&#x5C06;&#x56DE;&#x5230;&#x8FD9;&#x4E2A;&#x60F3;&#x6CD5;&#x3002;</p>
</blockquote>
<p>The interface comment for a class provides a high-level description of the abstraction provided by the class, such as the following:</p>
<blockquote>
<p>&#x7C7B;&#x7684;&#x63A5;&#x53E3;&#x6CE8;&#x91CA;&#x63D0;&#x4F9B;&#x4E86;&#x8BE5;&#x7C7B;&#x63D0;&#x4F9B;&#x7684;&#x62BD;&#x8C61;&#x7684;&#x9AD8;&#x7EA7;&#x63CF;&#x8FF0;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;</p>
</blockquote>
<pre><code class="lang-java"><span class="hljs-comment">/**
 * This class implements a simple server-side interface to the HTTP
 * protocol: by using this class, an application can receive HTTP
 * requests, process them, and return responses. Each instance of
 * this class corresponds to a particular socket used to receive
 * requests. The current implementation is single-threaded and
 * processes one request at a time.
 */</span>
<span class="hljs-keyword">public</span> <span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">Http</span> </span>{...}
</code></pre>
<p>This comment describes the overall capabilities of the class, without any implementation details or even the specifics of particular methods. It also describes what each instance of the class represents. Finally, the comments describe the limitations of the class (it does not support concurrent access from multiple threads), which may be important to developers contemplating whether to use it.</p>
<blockquote>
<p>&#x8BE5;&#x6CE8;&#x91CA;&#x63CF;&#x8FF0;&#x4E86;&#x7C7B;&#x7684;&#x6574;&#x4F53;&#x529F;&#x80FD;&#xFF0C;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x5B9E;&#x73B0;&#x7EC6;&#x8282;&#xFF0C;&#x751A;&#x81F3;&#x6CA1;&#x6709;&#x7279;&#x5B9A;&#x65B9;&#x6CD5;&#x7684;&#x7EC6;&#x8282;&#x3002;&#x5B83;&#x8FD8;&#x63CF;&#x8FF0;&#x4E86;&#x8BE5;&#x7C7B;&#x7684;&#x6BCF;&#x4E2A;&#x5B9E;&#x4F8B;&#x4EE3;&#x8868;&#x4EC0;&#x4E48;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x6CE8;&#x91CA;&#x63CF;&#x8FF0;&#x4E86;&#x8BE5;&#x7C7B;&#x7684;&#x9650;&#x5236;&#xFF08;&#x5B83;&#x4E0D;&#x652F;&#x6301;&#x4ECE;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x7684;&#x5E76;&#x53D1;&#x8BBF;&#x95EE;&#xFF09;&#xFF0C;&#x8FD9;&#x5BF9;&#x4E8E;&#x8003;&#x8651;&#x662F;&#x5426;&#x4F7F;&#x7528;&#x5B83;&#x7684;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x53EF;&#x80FD;&#x5F88;&#x91CD;&#x8981;&#x3002;</p>
</blockquote>
<p>The interface comment for a method includes both higher-level information for abstraction and lower-level details for precision:</p>
<blockquote>
<p>&#x65B9;&#x6CD5;&#x7684;&#x63A5;&#x53E3;&#x6CE8;&#x91CA;&#x65E2;&#x5305;&#x62EC;&#x7528;&#x4E8E;&#x62BD;&#x8C61;&#x7684;&#x9AD8;&#x5C42;&#x4FE1;&#x606F;&#xFF0C;&#x53C8;&#x5305;&#x62EC;&#x7528;&#x4E8E;&#x7CBE;&#x5EA6;&#x7684;&#x4F4E;&#x5C42;&#x7EC6;&#x8282;&#xFF1A;</p>
</blockquote>
<ul>
<li>The comment usually starts with a sentence or two describing the behavior of the method as perceived by callers; this is the higher-level abstraction.</li>
<li>The comment must describe each argument and the return value (if any). These comments must be very precise, and must describe any constraints on argument values as well as dependencies between arguments.</li>
<li>If the method has any side effects, these must be documented in the interface comment. A side effect is any consequence of the method that affects the future behavior of the system but is not part of the result. For example, if the method adds a value to an internal data structure, which can be retrieved by future method calls, this is a side effect; writing to the file system is also a side effect.</li>
<li>A method&#x2019;s interface comment must describe any exceptions that can emanate from the method.</li>
<li>If there are any preconditions that must be satisfied before a method is invoked, these must be described (perhaps some other method must be invoked first; for a binary search method, the list being searched must be sorted). It is a good idea to minimize preconditions, but any that remain must be documented.</li>
</ul>
<hr>
<blockquote>
<ul>
<li>&#x6CE8;&#x91CA;&#x901A;&#x5E38;&#x4EE5;&#x4E00;&#x4E24;&#x4E2A;&#x53E5;&#x5B50;&#x5F00;&#x5934;&#xFF0C;&#x63CF;&#x8FF0;&#x8C03;&#x7528;&#x8005;&#x611F;&#x77E5;&#x5230;&#x7684;&#x65B9;&#x6CD5;&#x7684;&#x884C;&#x4E3A;&#x3002;&#x8FD9;&#x662F;&#x66F4;&#x9AD8;&#x5C42;&#x6B21;&#x7684;&#x62BD;&#x8C61;&#x3002;</li>
<li>&#x6CE8;&#x91CA;&#x5FC5;&#x987B;&#x63CF;&#x8FF0;&#x6BCF;&#x4E2A;&#x53C2;&#x6570;&#x548C;&#x8FD4;&#x56DE;&#x503C;&#xFF08;&#x5982;&#x679C;&#x6709;&#xFF09;&#x3002;&#x8FD9;&#x4E9B;&#x6CE8;&#x91CA;&#x5FC5;&#x987B;&#x975E;&#x5E38;&#x7CBE;&#x786E;&#xFF0C;&#x5E76;&#x4E14;&#x5FC5;&#x987B;&#x63CF;&#x8FF0;&#x5BF9;&#x53C2;&#x6570;&#x503C;&#x7684;&#x4EFB;&#x4F55;&#x7EA6;&#x675F;&#x4EE5;&#x53CA;&#x53C2;&#x6570;&#x4E4B;&#x95F4;&#x7684;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x3002;</li>
<li>&#x5982;&#x679C;&#x8BE5;&#x65B9;&#x6CD5;&#x6709;&#x4EFB;&#x4F55;&#x526F;&#x4F5C;&#x7528;&#xFF0C;&#x5219;&#x5FC5;&#x987B;&#x5728;&#x754C;&#x9762;&#x6CE8;&#x91CA;&#x4E2D;&#x8BB0;&#x5F55;&#x8FD9;&#x4E9B;&#x526F;&#x4F5C;&#x7528;&#x3002;&#x526F;&#x4F5C;&#x7528;&#x662F;&#x8BE5;&#x65B9;&#x6CD5;&#x7684;&#x4EFB;&#x4F55;&#x7ED3;&#x679C;&#x90FD;&#x4F1A;&#x5F71;&#x54CD;&#x7CFB;&#x7EDF;&#x7684;&#x672A;&#x6765;&#x884C;&#x4E3A;&#xFF0C;&#x4F46;&#x4E0D;&#x5C5E;&#x4E8E;&#x7ED3;&#x679C;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x8BE5;&#x65B9;&#x6CD5;&#x5C06;&#x4E00;&#x4E2A;&#x503C;&#x6DFB;&#x52A0;&#x5230;&#x5185;&#x90E8;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4E2D;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5C06;&#x6765;&#x7684;&#x65B9;&#x6CD5;&#x8C03;&#x7528;&#x6765;&#x68C0;&#x7D22;&#x8BE5;&#x503C;&#xFF0C;&#x5219;&#x8FD9;&#x662F;&#x526F;&#x4F5C;&#x7528;&#x3002;&#x5199;&#x5165;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x526F;&#x4F5C;&#x7528;&#x3002;</li>
<li>&#x65B9;&#x6CD5;&#x7684;&#x754C;&#x9762;&#x6CE8;&#x91CA;&#x5FC5;&#x987B;&#x63CF;&#x8FF0;&#x8BE5;&#x65B9;&#x6CD5;&#x53EF;&#x80FD;&#x4EA7;&#x751F;&#x7684;&#x4EFB;&#x4F55;&#x5F02;&#x5E38;&#x3002;</li>
<li>&#x5982;&#x679C;&#x5728;&#x8C03;&#x7528;&#x67D0;&#x4E2A;&#x65B9;&#x6CD5;&#x4E4B;&#x524D;&#x5FC5;&#x987B;&#x6EE1;&#x8DB3;&#x4EFB;&#x4F55;&#x524D;&#x63D0;&#x6761;&#x4EF6;&#xFF0C;&#x5219;&#x5FC5;&#x987B;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x63CF;&#x8FF0;&#xFF08;&#x4E5F;&#x8BB8;&#x5FC5;&#x987B;&#x5148;&#x8C03;&#x7528;&#x5176;&#x4ED6;&#x65B9;&#x6CD5;&#xFF1B;&#x5BF9;&#x4E8E;&#x4E8C;&#x8FDB;&#x5236;&#x641C;&#x7D22;&#x65B9;&#x6CD5;&#xFF0C;&#x5FC5;&#x987B;&#x5BF9;&#x8981;&#x641C;&#x7D22;&#x7684;&#x5217;&#x8868;&#x8FDB;&#x884C;&#x6392;&#x5E8F;&#xFF09;&#x3002;&#x5C3D;&#x91CF;&#x51CF;&#x5C11;&#x524D;&#x63D0;&#x6761;&#x4EF6;&#x662F;&#x4E00;&#x4E2A;&#x597D;&#x4E3B;&#x610F;&#xFF0C;&#x4F46;&#x662F;&#x4EFB;&#x4F55;&#x4FDD;&#x7559;&#x7684;&#x6761;&#x4EF6;&#x90FD;&#x5FC5;&#x987B;&#x8BB0;&#x5F55;&#x5728;&#x6848;&#x3002;</li>
</ul>
</blockquote>
<p>Here is the interface comment for a method that copies data out of a Buffer object:</p>
<blockquote>
<p>&#x8FD9;&#x662F;&#x4ECE; Buffer &#x5BF9;&#x8C61;&#x590D;&#x5236;&#x6570;&#x636E;&#x7684;&#x65B9;&#x6CD5;&#x7684;&#x63A5;&#x53E3;&#x6CE8;&#x91CA;&#xFF1A;</p>
</blockquote>
<pre><code class="lang-java"><span class="hljs-comment">/**
 * Copy a range of bytes from a buffer to an external location.
 *
 * \param offset
 *        Index within the buffer of the first byte to copy.
 * \param length
 *        Number of bytes to copy.
 * \param dest
 *        Where to copy the bytes: must have room for at least
 *        length bytes.
 *
 * \return
 *        The return value is the actual number of bytes copied,
 *        which may be less than length if the requested range of
 *        bytes extends past the end of the buffer. 0 is returned
 *        if there is no overlap between the requested range and
 *        the actual buffer.
 */</span>

uint32_t
Buffer::copy(uint32_t offset, uint32_t length, <span class="hljs-keyword">void</span>* dest)
...
</code></pre>
<p>The syntax of this comment (e.g., \return) follows the conventions of Doxygen, a program that extracts comments from C/C++ code and compiles them into Web pages. The goal of the comment is to provide all the information a developer needs in order to invoke the method, including how special cases are handled (note how this method follows the advice of Chapter 10 and defines out of existence any errors associated with the range specification). The developer should not need to read the body of the method in order to invoke it, and the interface comment provides no information about how the method is implemented, such as how it scans its internal data structures to find the desired data.</p>
<blockquote>
<p>&#x6B64;&#x6CE8;&#x91CA;&#x7684;&#x8BED;&#x6CD5;&#xFF08;&#x4F8B;&#x5982;\ return&#xFF09;&#x9075;&#x5FAA; Doxygen &#x7684;&#x7EA6;&#x5B9A;&#xFF0C;&#x8BE5;&#x7A0B;&#x5E8F;&#x4ECE; C / C ++&#x4EE3;&#x7801;&#x4E2D;&#x63D0;&#x53D6;&#x6CE8;&#x91CA;&#x5E76;&#x5C06;&#x5176;&#x7F16;&#x8BD1;&#x4E3A; Web &#x9875;&#x3002;&#x6CE8;&#x91CA;&#x7684;&#x76EE;&#x7684;&#x662F;&#x63D0;&#x4F9B;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x8C03;&#x7528;&#x8BE5;&#x65B9;&#x6CD5;&#x6240;&#x9700;&#x7684;&#x6240;&#x6709;&#x4FE1;&#x606F;&#xFF0C;&#x5305;&#x62EC;&#x7279;&#x6B8A;&#x60C5;&#x51B5;&#x7684;&#x5904;&#x7406;&#x65B9;&#x5F0F;&#xFF08;&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x6B64;&#x65B9;&#x6CD5;&#x5982;&#x4F55;&#x9075;&#x5FAA;&#x7B2C; 10 &#x7AE0;&#x7684;&#x5EFA;&#x8BAE;&#x5E76;&#x5B9A;&#x4E49;&#x4E0E;&#x8303;&#x56F4;&#x89C4;&#x8303;&#x76F8;&#x5173;&#x7684;&#x4EFB;&#x4F55;&#x9519;&#x8BEF;&#x3002; &#xFF09;&#x3002;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x4E0D;&#x5FC5;&#x4E3A;&#x4E86;&#x8C03;&#x7528;&#x5B83;&#x800C;&#x9605;&#x8BFB;&#x65B9;&#x6CD5;&#x7684;&#x4E3B;&#x4F53;&#xFF0C;&#x5E76;&#x4E14;&#x63A5;&#x53E3;&#x6CE8;&#x91CA;&#x4E0D;&#x63D0;&#x4F9B;&#x6709;&#x5173;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x8BE5;&#x65B9;&#x6CD5;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x4F8B;&#x5982;&#x5B83;&#x5982;&#x4F55;&#x626B;&#x63CF;&#x5176;&#x5185;&#x90E8;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4EE5;&#x67E5;&#x627E;&#x6240;&#x9700;&#x7684;&#x6570;&#x636E;&#x3002;</p>
</blockquote>
<p>For a more extended example, let&#x2019;s consider a class called IndexLookup, which is part of a distributed storage system. The storage system holds a collection of tables, each of which contains many objects. In addition, each table can have one or more indexes; each index provides efficient access to objects in the table based on a particular field of the object. For example, one index might be used to look up objects based on their name field, and another index might be used to look up objects based on their age field. With these indexes, applications can quickly extract all of the objects with a particular name, or all of those with an age in a given range.</p>
<blockquote>
<p>&#x5BF9;&#x4E8E;&#x66F4;&#x6269;&#x5C55;&#x7684;&#x793A;&#x4F8B;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x8003;&#x8651;&#x4E00;&#x4E2A;&#x79F0;&#x4E3A; IndexLookup &#x7684;&#x7C7B;&#xFF0C;&#x8BE5;&#x7C7B;&#x662F;&#x5206;&#x5E03;&#x5F0F;&#x5B58;&#x50A8;&#x7CFB;&#x7EDF;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;&#x5B58;&#x50A8;&#x7CFB;&#x7EDF;&#x62E5;&#x6709;&#x4E00;&#x4E2A;&#x8868;&#x96C6;&#x5408;&#xFF0C;&#x6BCF;&#x4E2A;&#x8868;&#x5305;&#x542B;&#x8BB8;&#x591A;&#x5BF9;&#x8C61;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x6BCF;&#x4E2A;&#x8868;&#x53EF;&#x4EE5;&#x5177;&#x6709;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x7D22;&#x5F15;&#xFF1B;&#x6BCF;&#x4E2A;&#x7D22;&#x5F15;&#x90FD;&#x57FA;&#x4E8E;&#x5BF9;&#x8C61;&#x7684;&#x7279;&#x5B9A;&#x5B57;&#x6BB5;&#x63D0;&#x4F9B;&#x5BF9;&#x8868;&#x4E2D;&#x5BF9;&#x8C61;&#x7684;&#x6709;&#x6548;&#x8BBF;&#x95EE;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4E00;&#x4E2A;&#x7D22;&#x5F15;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x6839;&#x636E;&#x5BF9;&#x8C61;&#x7684;&#x540D;&#x79F0;&#x5B57;&#x6BB5;&#x67E5;&#x627E;&#x5BF9;&#x8C61;&#xFF0C;&#x800C;&#x53E6;&#x4E00;&#x4E2A;&#x7D22;&#x5F15;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x6839;&#x636E;&#x5BF9;&#x8C61;&#x7684;&#x5E74;&#x9F84;&#x5B57;&#x6BB5;&#x67E5;&#x627E;&#x5BF9;&#x8C61;&#x3002;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x7D22;&#x5F15;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x5FEB;&#x901F;&#x63D0;&#x53D6;&#x5177;&#x6709;&#x7279;&#x5B9A;&#x540D;&#x79F0;&#x7684;&#x6240;&#x6709;&#x5BF9;&#x8C61;&#xFF0C;&#x6216;&#x5177;&#x6709;&#x7ED9;&#x5B9A;&#x8303;&#x56F4;&#x5185;&#x7684;&#x5E74;&#x9F84;&#x7684;&#x6240;&#x6709;&#x5BF9;&#x8C61;&#x3002;</p>
</blockquote>
<p>The IndexLookup class provides a convenient interface for performing indexed lookups. Here is an example of how it might be used in an application:</p>
<blockquote>
<p>IndexLookup &#x7C7B;&#x4E3A;&#x6267;&#x884C;&#x7D22;&#x5F15;&#x67E5;&#x627E;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x65B9;&#x4FBF;&#x7684;&#x63A5;&#x53E3;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5982;&#x4F55;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x4F7F;&#x7528;&#x7684;&#x793A;&#x4F8B;&#xFF1A;</p>
</blockquote>
<pre><code class="lang-java">query = <span class="hljs-keyword">new</span> IndexLookup(table, index, key1, key2);
<span class="hljs-keyword">while</span>  (<span class="hljs-keyword">true</span>) {
    object = query.getNext();
    <span class="hljs-keyword">if</span>  (object == NULL) {
        <span class="hljs-keyword">break</span>;
    }
    ... process object ...
}
</code></pre>
<p>The application first constructs an object of type IndexLookup, providing arguments that select a table, an index, and a range within the index (for example, if the index is based on an age field, key1 and key2 might be specified as 21 and 65 to select all objects with ages between those values). Then the application calls the getNext method repeatedly. Each invocation returns one object that falls within the desired range; once all of the matching objects have been returned, getNext returns NULL. Because the storage system is distributed, the implementation of this class is somewhat complex. The objects in a table may be spread across multiple servers, and each index may also be distributed across a different set of servers; the code in the IndexLookup class must first communicate with all of the relevant index servers to collect information about the objects in the range, then it must communicate with the servers that actually store the objects in order to retrieve their values.</p>
<blockquote>
<p>&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x9996;&#x5148;&#x6784;&#x9020;&#x4E00;&#x4E2A;&#x7C7B;&#x578B;&#x4E3A; IndexLookup &#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x5E76;&#x63D0;&#x4F9B;&#x7528;&#x4E8E;&#x9009;&#x62E9;&#x8868;&#xFF0C;&#x7D22;&#x5F15;&#x548C;&#x7D22;&#x5F15;&#x5185;&#x8303;&#x56F4;&#x7684;&#x53C2;&#x6570;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x7D22;&#x5F15;&#x57FA;&#x4E8E;&#x5E74;&#x9F84;&#x5B57;&#x6BB5;&#xFF0C;&#x5219; key1 &#x548C; key2 &#x53EF;&#x4EE5;&#x6307;&#x5B9A;&#x4E3A; 21 &#x548C; 65 &#x9009;&#x62E9;&#x5E74;&#x9F84;&#x4ECB;&#x4E8E;&#x8FD9;&#x4E9B;&#x503C;&#x4E4B;&#x95F4;&#x7684;&#x6240;&#x6709;&#x5BF9;&#x8C61;&#xFF09;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x91CD;&#x590D;&#x8C03;&#x7528; getNext &#x65B9;&#x6CD5;&#x3002;&#x6BCF;&#x6B21;&#x8C03;&#x7528;&#x90FD;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x4F4D;&#x4E8E;&#x6240;&#x9700;&#x8303;&#x56F4;&#x5185;&#x7684;&#x5BF9;&#x8C61;&#x3002;&#x4E00;&#x65E6;&#x8FD4;&#x56DE;&#x6240;&#x6709;&#x5339;&#x914D;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;getNext &#x5C06;&#x8FD4;&#x56DE; NULL&#x3002;&#x56E0;&#x4E3A;&#x5B58;&#x50A8;&#x7CFB;&#x7EDF;&#x662F;&#x5206;&#x5E03;&#x5F0F;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x6B64;&#x7C7B;&#x7684;&#x5B9E;&#x73B0;&#x6709;&#x4E9B;&#x590D;&#x6742;&#x3002;&#x8868;&#x4E2D;&#x7684;&#x5BF9;&#x8C61;&#x53EF;&#x4EE5;&#x5206;&#x5E03;&#x5728;&#x591A;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#xFF0C;&#x6BCF;&#x4E2A;&#x7D22;&#x5F15;&#x4E5F;&#x53EF;&#x4EE5;&#x5206;&#x5E03;&#x5728;&#x4E00;&#x7EC4;&#x4E0D;&#x540C;&#x7684;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x3002;</p>
</blockquote>
<p>Now let&#x2019;s consider what information needs to be included in the interface comment for this class. For each piece of information given below, ask yourself whether a developer needs to know that information in order to use the class (my answers to the questions are at the end of the chapter):</p>
<blockquote>
<p>&#x73B0;&#x5728;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x8003;&#x8651;&#x8BE5;&#x7C7B;&#x7684;&#x63A5;&#x53E3;&#x6CE8;&#x91CA;&#x4E2D;&#x9700;&#x8981;&#x5305;&#x542B;&#x54EA;&#x4E9B;&#x4FE1;&#x606F;&#x3002;&#x5BF9;&#x4E8E;&#x4E0B;&#x9762;&#x7ED9;&#x51FA;&#x7684;&#x6BCF;&#x6761;&#x4FE1;&#x606F;&#xFF0C;&#x95EE;&#x81EA;&#x5DF1;&#x4E00;&#x4E2A;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x662F;&#x5426;&#x9700;&#x8981;&#x77E5;&#x9053;&#x8BE5;&#x4FE1;&#x606F;&#x624D;&#x80FD;&#x4F7F;&#x7528;&#x8BE5;&#x7C7B;&#xFF08;&#x6211;&#x5BF9;&#x95EE;&#x9898;&#x7684;&#x56DE;&#x7B54;&#x5728;&#x672C;&#x7AE0;&#x7684;&#x7ED3;&#x5C3E;&#xFF09;&#xFF1A;</p>
</blockquote>
<ol>
<li>The format of messages that the IndexLookup class sends to the servers holding indexes and objects.</li>
<li>The comparison function used to determine whether a particular object falls in the desired range (is comparison done using integers, floating-point numbers, or strings?).</li>
<li>The data structure used to store indexes on servers.</li>
<li>Whether or not IndexLookup issues multiple requests to different servers concurrently.</li>
<li>The mechanism for handling server crashes.</li>
</ol>
<blockquote>
<ol>
<li>IndexLookup &#x7C7B;&#x53D1;&#x9001;&#x7ED9;&#x5305;&#x542B;&#x7D22;&#x5F15;&#x548C;&#x5BF9;&#x8C61;&#x7684;&#x670D;&#x52A1;&#x5668;&#x7684;&#x6D88;&#x606F;&#x683C;&#x5F0F;&#x3002;</li>
<li>&#x7528;&#x4E8E;&#x786E;&#x5B9A;&#x7279;&#x5B9A;&#x5BF9;&#x8C61;&#x662F;&#x5426;&#x5728;&#x6240;&#x9700;&#x8303;&#x56F4;&#x5185;&#x7684;&#x6BD4;&#x8F83;&#x529F;&#x80FD;&#xFF08;&#x4F7F;&#x7528;&#x6574;&#x6570;&#xFF0C;&#x6D6E;&#x70B9;&#x6570;&#x6216;&#x5B57;&#x7B26;&#x4E32;&#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#x5417;&#xFF1F;&#xFF09;&#x3002;</li>
<li>&#x7528;&#x4E8E;&#x5728;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x5B58;&#x50A8;&#x7D22;&#x5F15;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;</li>
<li>IndexLookup &#x662F;&#x5426;&#x540C;&#x65F6;&#x5411;&#x591A;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#x53D1;&#x51FA;&#x591A;&#x4E2A;&#x8BF7;&#x6C42;&#x3002;</li>
<li>&#x5904;&#x7406;&#x670D;&#x52A1;&#x5668;&#x5D29;&#x6E83;&#x7684;&#x673A;&#x5236;&#x3002;</li>
</ol>
</blockquote>
<hr>
<p>Here is the original version of the interface comment for the IndexLookup class; the excerpt also includes a few lines from the class&#x2019;s definition, which are referred to in the comment:</p>
<blockquote>
<p>&#x8FD9;&#x662F; IndexLookup &#x7C7B;&#x7684;&#x63A5;&#x53E3;&#x6CE8;&#x91CA;&#x7684;&#x539F;&#x59CB;&#x7248;&#x672C;&#xFF1B;&#x6458;&#x5F55;&#x8FD8;&#x5305;&#x62EC;&#x7C7B;&#x5B9A;&#x4E49;&#x7684;&#x51E0;&#x884C;&#x5185;&#x5BB9;&#xFF0C;&#x5728;&#x6CE8;&#x91CA;&#x4E2D;&#x8FDB;&#x884C;&#x4E86;&#x5F15;&#x7528;&#xFF1A;</p>
</blockquote>
<pre><code class="lang-cpp"><span class="hljs-comment">/*
 * This class implements the client side framework for index range
 * lookups. It manages a single LookupIndexKeys RPC and multiple
 * IndexedRead RPCs. Client side just includes &quot;IndexLookup.h&quot; in
 * its header to use IndexLookup class. Several parameters can be set
 * in the config below:
 * - The number of concurrent indexedRead RPCs
 * - The max number of PKHashes a indexedRead RPC can hold at a time
 * - The size of the active PKHashes
 *
 * To use IndexLookup, the client creates an object of this class by
 * providing all necessary information. After construction of
 * IndexLookup, client can call getNext() function to move to next
 * available object. If getNext() returns NULL, it means we reached
 * the last object. Client can use getKey, getKeyLength, getValue,
 * and getValueLength to get object data of current object.
 */</span>
 <span class="hljs-keyword">class</span> IndexLookup {
       ...
   <span class="hljs-keyword">private</span>:
       <span class="hljs-comment">/// Max number of concurrent indexedRead RPCs</span>
       <span class="hljs-keyword">static</span> <span class="hljs-keyword">const</span> <span class="hljs-keyword">uint8_t</span> NUM_READ_RPC = <span class="hljs-number">10</span>;
       <span class="hljs-comment">/// Max number of PKHashes that can be sent in one</span>
       <span class="hljs-comment">/// indexedRead RPC</span>
       <span class="hljs-keyword">static</span> <span class="hljs-keyword">const</span> <span class="hljs-keyword">uint32_t</span> MAX_PKHASHES_PERRPC = <span class="hljs-number">256</span>;
       <span class="hljs-comment">/// Max number of PKHashes that activeHashes can</span>
       <span class="hljs-comment">/// hold at once.</span>
       <span class="hljs-keyword">static</span> <span class="hljs-keyword">const</span> <span class="hljs-keyword">size_t</span> MAX_NUM_PK = (<span class="hljs-number">1</span> &lt;&lt; LG_BUFFER_SIZE);
 }
</code></pre>
<p>Before reading further, see if you can identify the problems with this comment. Here are the problems that I found:</p>
<blockquote>
<p>&#x5728;&#x8FDB;&#x4E00;&#x6B65;&#x9605;&#x8BFB;&#x4E4B;&#x524D;&#xFF0C;&#x8BF7;&#x5148;&#x67E5;&#x770B;&#x60A8;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x6B64;&#x6CE8;&#x91CA;&#x786E;&#x5B9A;&#x95EE;&#x9898;&#x6240;&#x5728;&#x3002;&#x8FD9;&#x662F;&#x6211;&#x53D1;&#x73B0;&#x7684;&#x95EE;&#x9898;&#xFF1A;</p>
</blockquote>
<ul>
<li>Most of the first paragraph concerns the implementation, not the interface. As one example, users don&#x2019;t need to know the names of the particular remote procedure calls used to communicate with the servers. The configuration parameters referred to in the second half of the first paragraph are all private variables that are relevant only to the maintainer of the class, not to its users. All of this implementation information should be omitted from the comment.</li>
<li>The comment also includes several things that are obvious. For example, there&#x2019;s no need to tell users to include IndexLookup.h: anyone who writes C++ code will be able to guess that this is necessary. In addition, the text &#x201C;by providing all necessary information&#x201D; says nothing, so it can be omitted.</li>
</ul>
<hr>
<blockquote>
<ul>
<li>&#x7B2C;&#x4E00;&#x6BB5;&#x7684;&#x5927;&#x90E8;&#x5206;&#x4E0E;&#x5B9E;&#x73B0;&#x6709;&#x5173;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x63A5;&#x53E3;&#x3002;&#x4E3E;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x7528;&#x6237;&#x4E0D;&#x9700;&#x8981;&#x77E5;&#x9053;&#x7528;&#x4E8E;&#x4E0E;&#x670D;&#x52A1;&#x5668;&#x901A;&#x4FE1;&#x7684;&#x7279;&#x5B9A;&#x8FDC;&#x7A0B;&#x8FC7;&#x7A0B;&#x8C03;&#x7528;&#x7684;&#x540D;&#x79F0;&#x3002;&#x5728;&#x7B2C;&#x4E00;&#x6BB5;&#x7684;&#x540E;&#x534A;&#x90E8;&#x5206;&#x4E2D;&#x63D0;&#x5230;&#x7684;&#x914D;&#x7F6E;&#x53C2;&#x6570;&#x90FD;&#x662F;&#x6240;&#x6709;&#x79C1;&#x6709;&#x53D8;&#x91CF;&#xFF0C;&#x5B83;&#x4EEC;&#x4EC5;&#x4E0E;&#x7C7B;&#x7684;&#x7EF4;&#x62A4;&#x8005;&#x76F8;&#x5173;&#xFF0C;&#x800C;&#x4E0E;&#x7C7B;&#x7684;&#x7528;&#x6237;&#x65E0;&#x5173;&#x3002;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x5B9E;&#x73B0;&#x4FE1;&#x606F;&#x90FD;&#x5E94;&#x4ECE;&#x6CE8;&#x91CA;&#x4E2D;&#x7701;&#x7565;&#x3002;</li>
<li>&#x8BE5;&#x8BC4;&#x8BBA;&#x8FD8;&#x5305;&#x62EC;&#x4E00;&#x4E9B;&#x663E;&#x800C;&#x6613;&#x89C1;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x544A;&#x8BC9;&#x7528;&#x6237;&#x5305;&#x62EC; IndexLookup.h&#xFF1A;&#x4EFB;&#x4F55;&#x7F16;&#x5199; C ++&#x4EE3;&#x7801;&#x7684;&#x4EBA;&#x90FD;&#x53EF;&#x4EE5;&#x731C;&#x6D4B;&#x8FD9;&#x662F;&#x5FC5;&#x8981;&#x7684;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x201C;&#x901A;&#x8FC7;&#x63D0;&#x4F9B;&#x6240;&#x6709;&#x5FC5;&#x8981;&#x7684;&#x4FE1;&#x606F;&#x201D;&#x4E00;&#x8BCD;&#x65E0;&#x8BED;&#xFF0C;&#x56E0;&#x6B64;&#x53EF;&#x4EE5;&#x7701;&#x7565;&#x3002;</li>
</ul>
</blockquote>
<p>A shorter comment for this class is sufficient (and preferable):</p>
<blockquote>
<p>&#x5BF9;&#x6B64;&#x7C7B;&#x7684;&#x7B80;&#x77ED;&#x8BC4;&#x8BBA;&#x5C31;&#x8DB3;&#x591F;&#x4E86;&#xFF08;&#x5E76;&#x4E14;&#x66F4;&#x53EF;&#x53D6;&#xFF09;&#xFF1A;</p>
</blockquote>
<pre><code class="lang-java"><span class="hljs-comment">/*
 * This class is used by client applications to make range queries
 * using indexes. Each instance represents a single range query.
 *
 * To start a range query, a client creates an instance of this
 * class. The client can then call getNext() to retrieve the objects
 * in the desired range. For each object returned by getNext(), the
 * caller can invoke getKey(), getKeyLength(), getValue(), and
 * getValueLength() to get information about that object.
 */</span>
</code></pre>
<p>The last paragraph of this comment is not strictly necessary, since it mostly duplicates information in the comments for individual methods. However, it can be helpful to have examples in the class documentation that illustrate how its methods work together, particularly for deep classes with usage patterns that are nonobvious. Note that the new comment does not mention NULL return values from getNext. This comment is not intended to document every detail of each method; it just provides high level information to help readers understand how the methods work together and when each method might be invoked. For details, readers can refer to the interface comments for individual methods. This comment also does not mention server crashes; that is because server crashes are invisible to users of this class (the system automatically recovers from them).</p>
<blockquote>
<p>&#x6B64;&#x6CE8;&#x91CA;&#x7684;&#x6700;&#x540E;&#x4E00;&#x6BB5;&#x4E0D;&#x662F;&#x4E25;&#x683C;&#x5FC5;&#x9700;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4E3B;&#x8981;&#x9488;&#x5BF9;&#x5355;&#x4E2A;&#x65B9;&#x6CD5;&#x590D;&#x5236;&#x4E86;&#x6CE8;&#x91CA;&#x4E2D;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5728;&#x7C7B;&#x6587;&#x6863;&#x4E2D;&#x63D0;&#x4F9B;&#x793A;&#x4F8B;&#x6765;&#x8BF4;&#x660E;&#x5176;&#x65B9;&#x6CD5;&#x5982;&#x4F55;&#x534F;&#x540C;&#x5DE5;&#x4F5C;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x6240;&#x5E2E;&#x52A9;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5BF9;&#x4E8E;&#x4F7F;&#x7528;&#x6A21;&#x5F0F;&#x4E0D;&#x660E;&#x663E;&#x7684;&#x6DF1;&#x5C42;&#x7C7B;&#x5C24;&#x5176;&#x5982;&#x6B64;&#x3002;&#x6CE8;&#x610F;&#xFF0C;&#x65B0;&#x6CE8;&#x91CA;&#x672A;&#x63D0;&#x53CA; getNext &#x7684; NULL &#x8FD4;&#x56DE;&#x503C;&#x3002;&#x6B64;&#x6CE8;&#x91CA;&#x65E0;&#x610F;&#x8BB0;&#x5F55;&#x6BCF;&#x79CD;&#x65B9;&#x6CD5;&#x7684;&#x6BCF;&#x4E2A;&#x7EC6;&#x8282;&#xFF1B;&#x5B83;&#x53EA;&#x662F;&#x63D0;&#x4F9B;&#x9AD8;&#x7EA7;&#x4FE1;&#x606F;&#xFF0C;&#x4EE5;&#x5E2E;&#x52A9;&#x8BFB;&#x8005;&#x4E86;&#x89E3;&#x8FD9;&#x4E9B;&#x65B9;&#x6CD5;&#x5982;&#x4F55;&#x534F;&#x540C;&#x5DE5;&#x4F5C;&#x4EE5;&#x53CA;&#x4F55;&#x65F6;&#x53EF;&#x4EE5;&#x8C03;&#x7528;&#x6BCF;&#x79CD;&#x65B9;&#x6CD5;&#x3002;&#x6709;&#x5173;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#xFF0C;&#x8BFB;&#x8005;&#x53EF;&#x4EE5;&#x53C2;&#x8003;&#x63A5;&#x53E3;&#x6CE8;&#x91CA;&#x4E2D;&#x7684;&#x5404;&#x4E2A;&#x65B9;&#x6CD5;&#x3002;&#x6B64;&#x8BC4;&#x8BBA;&#x4E5F;&#x6CA1;&#x6709;&#x63D0;&#x5230;&#x670D;&#x52A1;&#x5668;&#x5D29;&#x6E83;&#xFF1B;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x6B64;&#x7C7B;&#x670D;&#x52A1;&#x5668;&#x7684;&#x7528;&#x6237;&#x770B;&#x4E0D;&#x5230;&#x670D;&#x52A1;&#x5668;&#x5D29;&#x6E83;&#xFF08;&#x7CFB;&#x7EDF;&#x4F1A;&#x81EA;&#x52A8;&#x4ECE;&#x4E2D;&#x6062;&#x590D;&#xFF09;&#x3002;</p>
</blockquote>
<p>img Red Flag: Implementation Documentation Contaminates Interface img</p>
<p>This red flag occurs when interface documentation, such as that for a method, describes implementation details that aren&#x2019;t needed in order to use the thing being documented.</p>
<blockquote>
<p>&#x5F53;&#x63A5;&#x53E3;&#x6587;&#x6863;&#xFF08;&#x4F8B;&#x5982;&#x65B9;&#x6CD5;&#x7684;&#x6587;&#x6863;&#xFF09;&#x63CF;&#x8FF0;&#x4E86;&#x4E0D;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x8981;&#x8BB0;&#x5F55;&#x7684;&#x4E8B;&#x7269;&#x7684;&#x5B9E;&#x73B0;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#x65F6;&#xFF0C;&#x5C31;&#x4F1A;&#x51FA;&#x73B0;&#x6B64;&#x7EA2;&#x8272;&#x6807;&#x8BB0;&#x3002;</p>
</blockquote>
<p>Now consider the following code, which shows the first version of the documentation for the isReady method in IndexLookup:</p>
<blockquote>
<p>&#x73B0;&#x5728;&#x8003;&#x8651;&#x4EE5;&#x4E0B;&#x4EE3;&#x7801;&#xFF0C;&#x8BE5;&#x4EE3;&#x7801;&#x663E;&#x793A; IndexLookup &#x4E2D; isReady &#x65B9;&#x6CD5;&#x7684;&#x6587;&#x6863;&#x7684;&#x7B2C;&#x4E00;&#x7248;&#xFF1A;</p>
</blockquote>
<pre><code class="lang-cpp"><span class="hljs-comment">/**
 * Check if the next object is RESULT_READY. This function is
 * implemented in a DCFT module, each execution of isReady() tries
 * to make small progress, and getNext() invokes isReady() in a
 * while loop, until isReady() returns true.
 *
 * isReady() is implemented in a rule-based approach. We check
 * different rules by following a particular order, and perform
 * certain actions if some rule is satisfied.
 *
 * \return
 *         True means the next Object is available. Otherwise, return
 *         false.
 */</span>
<span class="hljs-keyword">bool</span> IndexLookup::isReady() { ... }
</code></pre>
<p>Once again, most of this documentation, such as the reference to DCFT and the entire second paragraph, concerns the implementation, so it doesn&#x2019;t belong here; this is one of the most common errors in interface comments. Some of the implementation documentation is useful, but it should go inside the method, where it will be clearly separated from interface documentation. In addition, the first sentence of the documentation is cryptic (what does RESULT_READY mean?) and some important information is missing. Finally, it isn&#x2019;t necessary to describe the implementation of getNext here. Here is a better version of the comment:</p>
<blockquote>
<p>&#x518D;&#x4E00;&#x6B21;&#xFF0C;&#x672C;&#x6587;&#x6863;&#x4E2D;&#x7684;&#x5927;&#x591A;&#x6570;&#x5185;&#x5BB9;&#xFF0C;&#x4F8B;&#x5982;&#x5BF9; DCFT &#x7684;&#x5F15;&#x7528;&#x4EE5;&#x53CA;&#x6574;&#x4E2A;&#x7B2C;&#x4E8C;&#x6BB5;&#xFF0C;&#x90FD;&#x4E0E;&#x5B9E;&#x73B0;&#x6709;&#x5173;&#xFF0C;&#x56E0;&#x6B64;&#x4E0D;&#x5C5E;&#x4E8E;&#x6B64;&#x5904;&#x3002;&#x8FD9;&#x662F;&#x754C;&#x9762;&#x6CE8;&#x91CA;&#x4E2D;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x9519;&#x8BEF;&#x4E4B;&#x4E00;&#x3002;&#x67D0;&#x4E9B;&#x5B9E;&#x73B0;&#x6587;&#x6863;&#x5F88;&#x6709;&#x7528;&#xFF0C;&#x4F46;&#x5E94;&#x653E;&#x5728;&#x65B9;&#x6CD5;&#x5185;&#x90E8;&#xFF0C;&#x5728;&#x8BE5;&#x65B9;&#x6CD5;&#x4E2D;&#x5E94;&#x5C06;&#x5176;&#x4E0E;&#x63A5;&#x53E3;&#x6587;&#x6863;&#x660E;&#x786E;&#x5206;&#x5F00;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x6587;&#x6863;&#x7684;&#x7B2C;&#x4E00;&#x53E5;&#x8BDD;&#x662F;&#x542B;&#x7CCA;&#x7684;&#xFF08;RESULT_READY &#x662F;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#xFF1F;&#xFF09;&#xFF0C;&#x5E76;&#x4E14;&#x7F3A;&#x5C11;&#x4E00;&#x4E9B;&#x91CD;&#x8981;&#x4FE1;&#x606F;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x65E0;&#x9700;&#x5728;&#x6B64;&#x5904;&#x63CF;&#x8FF0; getNext &#x7684;&#x5B9E;&#x73B0;&#x3002;&#x8FD9;&#x662F;&#x8BC4;&#x8BBA;&#x7684;&#x66F4;&#x597D;&#x7248;&#x672C;&#xFF1A;</p>
</blockquote>
<pre><code class="lang-java"><span class="hljs-comment">/*
 * Indicates whether an indexed read has made enough progress for
 * getNext to return immediately without blocking. In addition, this
 * method does most of the real work for indexed reads, so it must
 * be invoked (either directly, or indirectly by calling getNext) in
 * order for the indexed read to make progress.
 *
 * \return
 *         True means that the next invocation of getNext will not block
 *         (at least one object is available to return, or the end of the
 *         lookup has been reached); false means getNext may block.
 */</span>
</code></pre>
<p>This version of the comment provides more precise information about what &#x201C;ready&#x201D; means, and it provides the important information that this method must eventually be invoked if the indexed retrieval is to move forward.</p>
<blockquote>
<p>&#x6B64;&#x6CE8;&#x91CA;&#x7248;&#x672C;&#x63D0;&#x4F9B;&#x4E86;&#x6709;&#x5173;&#x201C;&#x5C31;&#x7EEA;&#x201D;&#x542B;&#x4E49;&#x7684;&#x66F4;&#x7CBE;&#x786E;&#x4FE1;&#x606F;&#xFF0C;&#x5E76;&#x4E14;&#x63D0;&#x4F9B;&#x4E86;&#x91CD;&#x8981;&#x4FE1;&#x606F;&#xFF0C;&#x5982;&#x679C;&#x8981;&#x7EE7;&#x7EED;&#x8FDB;&#x884C;&#x7D22;&#x5F15;&#x68C0;&#x7D22;&#xFF0C;&#x5219;&#x5FC5;&#x987B;&#x6700;&#x7EC8;&#x8C03;&#x7528;&#x6B64;&#x65B9;&#x6CD5;&#x3002;</p>
</blockquote>
<h2 id="136-implementation-comments-what-and-why-not-how-&#x5B9E;&#x65BD;&#x6CE8;&#x91CA;&#xFF1A;&#x4EC0;&#x4E48;&#x4EE5;&#x53CA;&#x4E3A;&#x4EC0;&#x4E48;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5982;&#x4F55;">13.6 Implementation comments: what and why, not how &#x5B9E;&#x65BD;&#x6CE8;&#x91CA;&#xFF1A;&#x4EC0;&#x4E48;&#x4EE5;&#x53CA;&#x4E3A;&#x4EC0;&#x4E48;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5982;&#x4F55;</h2>
<p>Implementation comments are the comments that appear inside methods to help readers understand how they work internally. Most methods are so short and simple that they don&#x2019;t need any implementation comments: given the code and the interface comments, it&#x2019;s easy to figure out how a method works.</p>
<blockquote>
<p>&#x5B9E;&#x73B0;&#x6CE8;&#x91CA;&#x662F;&#x51FA;&#x73B0;&#x5728;&#x65B9;&#x6CD5;&#x5185;&#x90E8;&#x7684;&#x6CE8;&#x91CA;&#xFF0C;&#x4EE5;&#x5E2E;&#x52A9;&#x8BFB;&#x8005;&#x4E86;&#x89E3;&#x5B83;&#x4EEC;&#x5728;&#x5185;&#x90E8;&#x7684;&#x5DE5;&#x4F5C;&#x65B9;&#x5F0F;&#x3002;&#x5927;&#x591A;&#x6570;&#x65B9;&#x6CD5;&#x662F;&#x5982;&#x6B64;&#x7B80;&#x77ED;&#xFF0C;&#x7B80;&#x5355;&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;&#x5B83;&#x4EEC;&#x4E0D;&#x9700;&#x8981;&#x4EFB;&#x4F55;&#x5B9E;&#x73B0;&#x6CE8;&#x91CA;&#xFF1A;&#x6709;&#x4E86;&#x4EE3;&#x7801;&#x548C;&#x63A5;&#x53E3;&#x6CE8;&#x91CA;&#xFF0C;&#x5C31;&#x5F88;&#x5BB9;&#x6613;&#x5F04;&#x6E05;&#x695A;&#x65B9;&#x6CD5;&#x7684;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#x3002;</p>
</blockquote>
<p>The main goal of implementation comments is to help readers understand what the code is doing (not how it does it). Once readers know what the code is trying to do, it&#x2019;s usually easy to understand how the code works. For short methods, the code only does one thing, which is already described in its interface comment, so no implementation comments are needed. Longer methods have several blocks of code that do different things as part of the method&#x2019;s overall task. Add a comment before each of the major blocks to provide a high-level (more abstract) description of what that block does. Here is an example:</p>
<blockquote>
<p>&#x5B9E;&#x73B0;&#x6CE8;&#x91CA;&#x7684;&#x4E3B;&#x8981;&#x76EE;&#x7684;&#x662F;&#x5E2E;&#x52A9;&#x8BFB;&#x8005;&#x7406;&#x89E3;&#x4EE3;&#x7801;&#x5728;&#x505A;&#x4EC0;&#x4E48;&#xFF08;&#x800C;&#x4E0D;&#x662F;&#x4EE3;&#x7801;&#x5982;&#x4F55;&#x5DE5;&#x4F5C;&#xFF09;&#x3002;&#x4E00;&#x65E6;&#x8BFB;&#x8005;&#x77E5;&#x9053;&#x4E86;&#x4EE3;&#x7801;&#x8981;&#x505A;&#x4EC0;&#x4E48;&#xFF0C;&#x901A;&#x5E38;&#x5C31;&#x5F88;&#x5BB9;&#x6613;&#x7406;&#x89E3;&#x4EE3;&#x7801;&#x7684;&#x5DE5;&#x4F5C;&#x539F;&#x7406;&#x3002;&#x5BF9;&#x4E8E;&#x7B80;&#x77ED;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x4EE3;&#x7801;&#x53EA;&#x505A;&#x4E00;&#x4EF6;&#x4E8B;&#xFF0C;&#x8BE5;&#x95EE;&#x9898;&#x5DF2;&#x5728;&#x5176;&#x63A5;&#x53E3;&#x6CE8;&#x91CA;&#x4E2D;&#x8FDB;&#x884C;&#x4E86;&#x63CF;&#x8FF0;&#xFF0C;&#x56E0;&#x6B64;&#x4E0D;&#x9700;&#x8981;&#x5B9E;&#x73B0;&#x6CE8;&#x91CA;&#x3002;&#x8F83;&#x957F;&#x7684;&#x65B9;&#x6CD5;&#x5177;&#x6709;&#x591A;&#x4E2A;&#x4EE3;&#x7801;&#x5757;&#xFF0C;&#x8FD9;&#x4E9B;&#x4EE3;&#x7801;&#x5757;&#x4F5C;&#x4E3A;&#x65B9;&#x6CD5;&#x7684;&#x6574;&#x4F53;&#x4EFB;&#x52A1;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x6267;&#x884C;&#x4E0D;&#x540C;&#x7684;&#x64CD;&#x4F5C;&#x3002;&#x5728;&#x6BCF;&#x4E2A;&#x4E3B;&#x8981;&#x5757;&#x4E4B;&#x524D;&#x6DFB;&#x52A0;&#x6CE8;&#x91CA;&#xFF0C;&#x4EE5;&#x63D0;&#x4F9B;&#x5BF9;&#x8BE5;&#x5757;&#x7684;&#x4F5C;&#x7528;&#x7684;&#x9AD8;&#x7EA7;&#xFF08;&#x66F4;&#x62BD;&#x8C61;&#xFF09;&#x63CF;&#x8FF0;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF1A;</p>
</blockquote>
<pre><code class="lang-java"><span class="hljs-comment">// Phase 1: Scan active RPCs to see if any have completed.</span>
</code></pre>
<p>For loops, it&#x2019;s helpful to have a comment before the loop that describes what happens in each iteration:</p>
<blockquote>
<p>&#x5BF9;&#x4E8E;&#x5FAA;&#x73AF;&#xFF0C;&#x5728;&#x5FAA;&#x73AF;&#x524D;&#x52A0;&#x4E00;&#x4E2A;&#x6CE8;&#x91CA;&#x6765;&#x63CF;&#x8FF0;&#x6BCF;&#x6B21;&#x8FED;&#x4EE3;&#x4E2D;&#x53D1;&#x751F;&#x7684;&#x4E8B;&#x60C5;&#x662F;&#x6709;&#x5E2E;&#x52A9;&#x7684;&#xFF1A;</p>
</blockquote>
<pre><code class="lang-java"><span class="hljs-comment">// Each iteration of the following loop extracts one request from</span>
<span class="hljs-comment">// the request message, increments the corresponding object, and</span>
<span class="hljs-comment">// appends a response to the response message.</span>
</code></pre>
<p>Notice how this comment describes the loop at a more abstract and intuitive level; it doesn&#x2019;t go into any details about how a request is extracted from the request message or how the object is incremented. Loop comments are only needed for longer or more complex loops, where it may not be obvious what the loop is doing; many loops are short and simple enough that their behavior is already obvious.</p>
<blockquote>
<p>&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x6B64;&#x6CE8;&#x91CA;&#x5982;&#x4F55;&#x66F4;&#x62BD;&#x8C61;&#x548C;&#x76F4;&#x89C2;&#x5730;&#x63CF;&#x8FF0;&#x5FAA;&#x73AF;&#x3002;&#x5B83;&#x6CA1;&#x6709;&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;&#x5982;&#x4F55;&#x4ECE;&#x8BF7;&#x6C42;&#x6D88;&#x606F;&#x4E2D;&#x63D0;&#x53D6;&#x8BF7;&#x6C42;&#x6216;&#x5BF9;&#x8C61;&#x5982;&#x4F55;&#x9012;&#x589E;&#x3002;&#x4EC5;&#x5BF9;&#x4E8E;&#x66F4;&#x957F;&#x6216;&#x66F4;&#x590D;&#x6742;&#x7684;&#x5FAA;&#x73AF;&#x624D;&#x9700;&#x8981;&#x5FAA;&#x73AF;&#x6CE8;&#x91CA;&#xFF0C;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5FAA;&#x73AF;&#x7684;&#x4F5C;&#x7528;&#x53EF;&#x80FD;&#x5E76;&#x4E0D;&#x660E;&#x663E;&#x3002;&#x8BB8;&#x591A;&#x5FAA;&#x73AF;&#x8DB3;&#x591F;&#x77ED;&#x4E14;&#x7B80;&#x5355;&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;&#x5176;&#x884C;&#x4E3A;&#x5DF2;&#x7ECF;&#x5F88;&#x660E;&#x663E;&#x3002;</p>
</blockquote>
<p>In addition to describing what the code is doing, implementation comments are also useful to explain why. If there are tricky aspects to the code that won&#x2019;t be obvious from reading it, you should document them. For example, if a bug fix requires the addition of code whose purpose isn&#x2019;t totally obvious, add a comment describing why the code is needed. For bug fixes where there is a well-written bug report describing the problem, the comment can refer to the issue in the bug tracking database rather than repeating all its details (&#x201C;Fixes RAM-436, related to device driver crashes in Linux 2.4.x&#x201D;). Developers can look in the bug database for more details (this is an example of avoiding duplication in comments, which will be discussed in Chapter 16).</p>
<blockquote>
<p>&#x9664;&#x4E86;&#x63CF;&#x8FF0;&#x4EE3;&#x7801;&#x5728;&#x505A;&#x4EC0;&#x4E48;&#x4E4B;&#x5916;&#xFF0C;&#x5B9E;&#x73B0;&#x6CE8;&#x91CA;&#x8FD8;&#x6709;&#x52A9;&#x4E8E;&#x89E3;&#x91CA;&#x539F;&#x56E0;&#x3002;&#x5982;&#x679C;&#x4EE3;&#x7801;&#x4E2D;&#x6709;&#x4E9B;&#x68D8;&#x624B;&#x7684;&#x65B9;&#x9762;&#x4ECE;&#x9605;&#x8BFB;&#x4E2D;&#x770B;&#x4E0D;&#x51FA;&#x6765;&#xFF0C;&#x5219;&#x5E94;&#x5C06;&#x5B83;&#x4EEC;&#x8BB0;&#x5F55;&#x4E0B;&#x6765;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x9519;&#x8BEF;&#x4FEE;&#x590D;&#x7A0B;&#x5E8F;&#x9700;&#x8981;&#x6DFB;&#x52A0;&#x76EE;&#x7684;&#x4E0D;&#x662F;&#x5F88;&#x660E;&#x663E;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x8BF7;&#x6DFB;&#x52A0;&#x6CE8;&#x91CA;&#x4EE5;&#x8BF4;&#x660E;&#x4E3A;&#x4EC0;&#x4E48;&#x9700;&#x8981;&#x8BE5;&#x4EE3;&#x7801;&#x3002;&#x5BF9;&#x4E8E;&#x9519;&#x8BEF;&#x4FEE;&#x590D;&#xFF0C;&#x5176;&#x4E2D;&#x6709;&#x5199;&#x5F97;&#x5F88;&#x597D;&#x7684;&#x9519;&#x8BEF;&#x62A5;&#x544A;&#x6765;&#x63CF;&#x8FF0;&#x95EE;&#x9898;&#xFF0C;&#x8BE5;&#x6CE8;&#x91CA;&#x53EF;&#x4EE5;&#x5F15;&#x7528;&#x9519;&#x8BEF;&#x8DDF;&#x8E2A;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x91CD;&#x590D;&#x5176;&#x6240;&#x6709;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#xFF08;&#x201C;&#x4FEE;&#x590D; RAM-436&#xFF0C;&#x4E0E; Linux 2.4 &#x4E2D;&#x7684;&#x8BBE;&#x5907;&#x9A71;&#x52A8;&#x7A0B;&#x5E8F;&#x5D29;&#x6E83;&#x6709;&#x5173;&#x3002;&#x201D; X&#x201D;&#xFF09;&#x3002;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x53EF;&#x4EE5;&#x5728; bug &#x6570;&#x636E;&#x5E93;&#x4E2D;&#x67E5;&#x627E;&#x66F4;&#x591A;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#xFF08;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x907F;&#x514D;&#x6CE8;&#x91CA;&#x91CD;&#x590D;&#x7684;&#x793A;&#x4F8B;&#xFF0C;&#x8FD9;&#x5C06;&#x5728;&#x7B2C; 16 &#x7AE0;&#x4E2D;&#x8FDB;&#x884C;&#x8BA8;&#x8BBA;&#xFF09;&#x3002;</p>
</blockquote>
<p>For longer methods, it can be helpful to write comments for a few of the most important local variables. However, most local variables don&#x2019;t need documentation if they have good names. If all of the uses of a variable are visible within a few lines of each other, it&#x2019;s usually easy to understand the variable&#x2019;s purpose without a comment. In this case it&#x2019;s OK to let readers read the code to figure out the meaning of the variable. However, if the variable is used over a large span of code, then you should consider adding a comment to describe the variable. When documenting variables, focus on what the variable represents, not how it is manipulated in the code.</p>
<blockquote>
<p>&#x5BF9;&#x4E8E;&#x66F4;&#x957F;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x4E3A;&#x4E00;&#x4E9B;&#x6700;&#x91CD;&#x8981;&#x7684;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x5199;&#x6CE8;&#x91CA;&#x4F1A;&#x5F88;&#x6709;&#x5E2E;&#x52A9;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x5927;&#x591A;&#x6570;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x5177;&#x6709;&#x597D;&#x540D;&#x5B57;&#xFF0C;&#x5219;&#x4E0D;&#x9700;&#x8981;&#x6587;&#x6863;&#x3002;&#x5982;&#x679C;&#x53D8;&#x91CF;&#x7684;&#x6240;&#x6709;&#x7528;&#x6CD5;&#x5728;&#x51E0;&#x884C;&#x4E4B;&#x5185;&#x90FD;&#x662F;&#x53EF;&#x89C1;&#x7684;&#xFF0C;&#x5219;&#x901A;&#x5E38;&#x65E0;&#x9700;&#x6CE8;&#x91CA;&#x5373;&#x53EF;&#x8F7B;&#x677E;&#x7406;&#x89E3;&#x53D8;&#x91CF;&#x7684;&#x7528;&#x9014;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x53EF;&#x4EE5;&#x8BA9;&#x8BFB;&#x8005;&#x9605;&#x8BFB;&#x4EE3;&#x7801;&#x6765;&#x5F04;&#x6E05;&#x695A;&#x53D8;&#x91CF;&#x7684;&#x542B;&#x4E49;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x5728;&#x5927;&#x91CF;&#x4EE3;&#x7801;&#x4E2D;&#x4F7F;&#x7528;&#x4E86;&#x8BE5;&#x53D8;&#x91CF;&#xFF0C;&#x5219;&#x5E94;&#x8003;&#x8651;&#x6DFB;&#x52A0;&#x6CE8;&#x91CA;&#x4EE5;&#x63CF;&#x8FF0;&#x8BE5;&#x53D8;&#x91CF;&#x3002;&#x5728;&#x8BB0;&#x5F55;&#x53D8;&#x91CF;&#x65F6;&#xFF0C;&#x5E94;&#x5173;&#x6CE8;&#x53D8;&#x91CF;&#x8868;&#x793A;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4EE3;&#x7801;&#x4E2D;&#x5982;&#x4F55;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#x3002;</p>
</blockquote>
<h2 id="137-cross-module-design-decisions-&#x8DE8;&#x6A21;&#x5757;&#x8BBE;&#x8BA1;&#x51B3;&#x7B56;">13.7 Cross-module design decisions &#x8DE8;&#x6A21;&#x5757;&#x8BBE;&#x8BA1;&#x51B3;&#x7B56;</h2>
<p>In a perfect world, every important design decision would be encapsulated within a single class. Unfortunately, real systems inevitably end up with design decisions that affect multiple classes. For example, the design of a network protocol will affect both the sender and the receiver, and these may be implemented in different places. Cross-module decisions are often complex and subtle, and they account for many bugs, so good documentation for them is crucial.</p>
<blockquote>
<p>&#x5728;&#x7406;&#x60F3;&#x73AF;&#x5883;&#x4E2D;&#xFF0C;&#x6BCF;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x8BBE;&#x8BA1;&#x51B3;&#x7B56;&#x90FD;&#x5C06;&#x5C01;&#x88C5;&#x5728;&#x4E00;&#x4E2A;&#x7C7B;&#x4E2D;&#x3002;&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x771F;&#x5B9E;&#x7684;&#x7CFB;&#x7EDF;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#x5730;&#x6700;&#x7EC8;&#x4F1A;&#x5F71;&#x54CD;&#x5230;&#x591A;&#x4E2A;&#x7C7B;&#x7684;&#x8BBE;&#x8BA1;&#x51B3;&#x7B56;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x7F51;&#x7EDC;&#x534F;&#x8BAE;&#x7684;&#x8BBE;&#x8BA1;&#x5C06;&#x5F71;&#x54CD;&#x53D1;&#x9001;&#x65B9;&#x548C;&#x63A5;&#x6536;&#x65B9;&#xFF0C;&#x5E76;&#x4E14;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x5730;&#x65B9;&#x5B9E;&#x73B0;&#x3002;&#x8DE8;&#x6A21;&#x5757;&#x51B3;&#x7B56;&#x901A;&#x5E38;&#x662F;&#x590D;&#x6742;&#x800C;&#x5FAE;&#x5999;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x4F1A;&#x5BFC;&#x81F4;&#x8BB8;&#x591A;&#x9519;&#x8BEF;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x4E3A;&#x5B83;&#x4EEC;&#x63D0;&#x4F9B;&#x826F;&#x597D;&#x7684;&#x6587;&#x6863;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x3002;</p>
</blockquote>
<p>The biggest challenge with cross-module documentation is finding a place to put it where it will naturally be discovered by developers. Sometimes there is an obvious central place to put such documentation. For example, the RAMCloud storage system defines a Status value, which is returned by each request to indicate success or failure. Adding a Status for a new error condition requires modifying many different files (one file maps Status values to exceptions, another provides a human-readable message for each Status, and so on). Fortunately, there is one obvious place where developers will have to go when adding a new status value, which is the declaration of the Status enum. We took advantage of this by adding comments in that enum to identify all of the other places that must also be modified:</p>
<blockquote>
<p>&#x8DE8;&#x6A21;&#x5757;&#x6587;&#x6863;&#x7684;&#x6700;&#x5927;&#x6311;&#x6218;&#x662F;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x653E;&#x7F6E;&#x5B83;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x4EE5;&#x4FBF;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x81EA;&#x7136;&#x5730;&#x53D1;&#x73B0;&#x5B83;&#x3002;&#x6709;&#x65F6;&#xFF0C;&#x653E;&#x7F6E;&#x6B64;&#x7C7B;&#x6587;&#x6863;&#x7684;&#x4E2D;&#x5FC3;&#x4F4D;&#x7F6E;&#x5F88;&#x660E;&#x663E;&#x3002;&#x4F8B;&#x5982;&#xFF0C;RAMCloud &#x5B58;&#x50A8;&#x7CFB;&#x7EDF;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x72B6;&#x6001;&#x503C;&#xFF0C;&#x6BCF;&#x4E2A;&#x8BF7;&#x6C42;&#x5747;&#x8FD4;&#x56DE;&#x8BE5;&#x72B6;&#x6001;&#x503C;&#x4EE5;&#x6307;&#x793A;&#x6210;&#x529F;&#x6216;&#x5931;&#x8D25;&#x3002;&#x4E3A;&#x65B0;&#x7684;&#x9519;&#x8BEF;&#x72B6;&#x51B5;&#x6DFB;&#x52A0;&#x72B6;&#x6001;&#x9700;&#x8981;&#x4FEE;&#x6539;&#x8BB8;&#x591A;&#x4E0D;&#x540C;&#x7684;&#x6587;&#x4EF6;&#xFF08;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x5C06;&#x72B6;&#x6001;&#x503C;&#x6620;&#x5C04;&#x5230;&#x5F02;&#x5E38;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x4E3A;&#x6BCF;&#x4E2A;&#x72B6;&#x6001;&#x63D0;&#x4F9B;&#x4EBA;&#x7C7B;&#x53EF;&#x8BFB;&#x7684;&#x6D88;&#x606F;&#xFF0C;&#x4F9D;&#x6B64;&#x7C7B;&#x63A8;&#xFF09;&#x3002;&#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;&#x6DFB;&#x52A0;&#x65B0;&#x7684;&#x72B6;&#x6001;&#x503C;&#xFF08;&#x5373; Status &#x679A;&#x4E3E;&#x7684;&#x58F0;&#x660E;&#xFF09;&#x65F6;&#xFF0C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5FC5;&#x987B;&#x53BB;&#x4E00;&#x4E2A;&#x660E;&#x663E;&#x7684;&#x5730;&#x65B9;&#x3002;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x5728;&#x8BE5;&#x679A;&#x4E3E;&#x4E2D;&#x6DFB;&#x52A0;&#x6CE8;&#x91CA;&#x6765;&#x6807;&#x8BC6;&#x6240;&#x6709;&#x5176;&#x4ED6;&#x5FC5;&#x987B;&#x4FEE;&#x6539;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x4ECE;&#x800C;&#x5229;&#x7528;&#x4E86;&#x8FD9;&#x4E00;&#x70B9;&#xFF1A;&#x5728;&#x7406;&#x60F3;&#x73AF;&#x5883;&#x4E2D;&#xFF0C;&#x6BCF;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x8BBE;&#x8BA1;&#x51B3;&#x7B56;&#x90FD;&#x5C06;&#x5C01;&#x88C5;&#x5728;&#x4E00;&#x4E2A;&#x7C7B;&#x4E2D;&#x3002;&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x771F;&#x5B9E;&#x7684;&#x7CFB;&#x7EDF;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#x5730;&#x6700;&#x7EC8;&#x4F1A;&#x5F71;&#x54CD;&#x5230;&#x591A;&#x4E2A;&#x7C7B;&#x7684;&#x8BBE;&#x8BA1;&#x51B3;&#x7B56;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x7F51;&#x7EDC;&#x534F;&#x8BAE;&#x7684;&#x8BBE;&#x8BA1;&#x5C06;&#x5F71;&#x54CD;&#x53D1;&#x9001;&#x65B9;&#x548C;&#x63A5;&#x6536;&#x65B9;&#xFF0C;&#x5E76;&#x4E14;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x5730;&#x65B9;&#x5B9E;&#x73B0;&#x3002;&#x8DE8;&#x6A21;&#x5757;&#x51B3;&#x7B56;&#x901A;&#x5E38;&#x662F;&#x590D;&#x6742;&#x800C;&#x5FAE;&#x5999;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x4F1A;&#x5BFC;&#x81F4;&#x8BB8;&#x591A;&#x9519;&#x8BEF;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x4E3A;&#x5B83;&#x4EEC;&#x63D0;&#x4F9B;&#x826F;&#x597D;&#x7684;&#x6587;&#x6863;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x3002;</p>
</blockquote>
<pre><code class="lang-cpp"><span class="hljs-keyword">typedef</span> <span class="hljs-keyword">enum</span> Status {
    STATUS_OK = <span class="hljs-number">0</span>,
    STATUS_UNKNOWN_TABLET                = <span class="hljs-number">1</span>,
    STATUS_WRONG_VERSION                 = <span class="hljs-number">2</span>,
    ...
    STATUS_INDEX_DOESNT_EXIST            = <span class="hljs-number">29</span>,
    STATUS_INVALID_PARAMETER             = <span class="hljs-number">30</span>,
    STATUS_MAX_VALUE                     = <span class="hljs-number">30</span>,
    <span class="hljs-comment">// Note: if you add a new status value you must make the following</span>
    <span class="hljs-comment">// additional updates:</span>
    <span class="hljs-comment">// (1)  Modify STATUS_MAX_VALUE to have a value equal to the</span>
    <span class="hljs-comment">//      largest defined status value, and make sure its definition</span>
    <span class="hljs-comment">//      is the last one in the list. STATUS_MAX_VALUE is used</span>
    <span class="hljs-comment">//      primarily for testing.</span>
    <span class="hljs-comment">// (2)  Add new entries in the tables &quot;messages&quot; and &quot;symbols&quot; in</span>
    <span class="hljs-comment">//      Status.cc.</span>
    <span class="hljs-comment">// (3)  Add a new exception class to ClientException.h</span>
    <span class="hljs-comment">// (4)  Add a new &quot;case&quot; to ClientException::throwException to map</span>
    <span class="hljs-comment">//      from the status value to a status-specific ClientException</span>
    <span class="hljs-comment">//      subclass.</span>
    <span class="hljs-comment">// (5)  In the Java bindings, add a static class for the exception</span>
    <span class="hljs-comment">//      to ClientException.java</span>
    <span class="hljs-comment">// (6)  Add a case for the status of the exception to throw the</span>
    <span class="hljs-comment">//      exception in ClientException.java</span>
    <span class="hljs-comment">// (7)  Add the exception to the Status enum in Status.java, making</span>
    <span class="hljs-comment">//      sure the status is in the correct position corresponding to</span>
    <span class="hljs-comment">//      its status code.</span>
}
</code></pre>
<p>New status values will be added at the end of the existing list, so the comments are also placed at the end, where they are most likely to be seen.</p>
<blockquote>
<p>&#x65B0;&#x72B6;&#x6001;&#x503C;&#x5C06;&#x6DFB;&#x52A0;&#x5230;&#x73B0;&#x6709;&#x5217;&#x8868;&#x7684;&#x672B;&#x5C3E;&#xFF0C;&#x56E0;&#x6B64;&#x6CE8;&#x91CA;&#x4E5F;&#x5C06;&#x653E;&#x7F6E;&#x5728;&#x6700;&#x6709;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x7684;&#x672B;&#x5C3E;&#x3002;</p>
</blockquote>
<p>Unfortunately, in many cases there is not an obvious central place to put cross-module documentation. One example from the RAMCloud storage system was the code for dealing with zombie servers, which are servers that the system believes have crashed, but in fact are still running. Neutralizing zombie servers required code in several different modules, and these pieces of code all depend on each other. None of the pieces of code is an obvious central place to put documentation. One possibility is to duplicate parts of the documentation in each location that depends on it. However, this is awkward, and it is difficult to keep such documentation up to date as the system evolves. Alternatively, the documentation can be located in one of the places where it is needed, but in this case it&#x2019;s unlikely that developers will see the documentation or know where to look for it.</p>
<blockquote>
<p>&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x5728;&#x8BB8;&#x591A;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5E76;&#x6CA1;&#x6709;&#x4E00;&#x4E2A;&#x660E;&#x663E;&#x7684;&#x4E2D;&#x5FC3;&#x4F4D;&#x7F6E;&#x6765;&#x653E;&#x7F6E;&#x8DE8;&#x6A21;&#x5757;&#x6587;&#x6863;&#x3002;RAMCloud &#x5B58;&#x50A8;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x662F;&#x5904;&#x7406;&#x50F5;&#x5C38;&#x670D;&#x52A1;&#x5668;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x50F5;&#x5C38;&#x670D;&#x52A1;&#x5668;&#x662F;&#x7CFB;&#x7EDF;&#x8BA4;&#x4E3A;&#x5DF2;&#x7ECF;&#x5D29;&#x6E83;&#x4F46;&#x5B9E;&#x9645;&#x4E0A;&#x4ECD;&#x5728;&#x8FD0;&#x884C;&#x7684;&#x670D;&#x52A1;&#x5668;&#x3002;&#x4E2D;&#x548C; zombie server &#x9700;&#x8981;&#x51E0;&#x4E2A;&#x4E0D;&#x540C;&#x6A21;&#x5757;&#x4E2D;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x8FD9;&#x4E9B;&#x4EE3;&#x7801;&#x90FD;&#x76F8;&#x4E92;&#x4F9D;&#x8D56;&#x3002;&#x6CA1;&#x6709;&#x4E00;&#x6BB5;&#x4EE3;&#x7801;&#x660E;&#x663E;&#x662F;&#x653E;&#x7F6E;&#x6587;&#x6863;&#x7684;&#x4E2D;&#x5FC3;&#x4F4D;&#x7F6E;&#x3002;&#x4E00;&#x79CD;&#x53EF;&#x80FD;&#x6027;&#x662F;&#x5728;&#x6BCF;&#x4E2A;&#x4F9D;&#x8D56;&#x6587;&#x6863;&#x7684;&#x4F4D;&#x7F6E;&#x590D;&#x5236;&#x6587;&#x6863;&#x7684;&#x90E8;&#x5206;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x8FD9;&#x662F;&#x4EE4;&#x4EBA;&#x5C34;&#x5C2C;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x968F;&#x7740;&#x7CFB;&#x7EDF;&#x7684;&#x53D1;&#x5C55;&#xFF0C;&#x5F88;&#x96BE;&#x4F7F;&#x8FD9;&#x6837;&#x7684;&#x6587;&#x6863;&#x4FDD;&#x6301;&#x6700;&#x65B0;&#x3002;&#x6216;&#x8005;&#xFF0C;&#x6587;&#x6863;&#x53EF;&#x4EE5;&#x4F4D;&#x4E8E;&#x9700;&#x8981;&#x5B83;&#x7684;&#x4F4D;&#x7F6E;&#x4E4B;&#x4E00;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x4E0D;&#x592A;&#x53EF;&#x80FD;&#x770B;&#x5230;&#x6587;&#x6863;&#x6216;&#x8005;&#x77E5;&#x9053;&#x5728;&#x54EA;&#x91CC;&#x67E5;&#x627E;&#x5B83;&#x3002;</p>
</blockquote>
<p>I have recently been experimenting with an approach where cross-module issues are documented in a central file called designNotes. The file is divided up into clearly labeled sections, one for each major topic. For example, here is an excerpt from the file:</p>
<blockquote>
<p>&#x6211;&#x6700;&#x8FD1;&#x4E00;&#x76F4;&#x5728;&#x5C1D;&#x8BD5;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#xFF0C;&#x8BE5;&#x65B9;&#x6CD5;&#x5C06;&#x8DE8;&#x6A21;&#x5757;&#x95EE;&#x9898;&#x8BB0;&#x5F55;&#x5728;&#x4E00;&#x4E2A;&#x540D;&#x4E3A; designNotes &#x7684;&#x4E2D;&#x592E;&#x6587;&#x4EF6;&#x4E2D;&#x3002;&#x8BE5;&#x6587;&#x4EF6;&#x5206;&#x4E3A;&#x6E05;&#x695A;&#x6807;&#x8BB0;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x6BCF;&#x4E2A;&#x4E3B;&#x8981;&#x4E3B;&#x9898;&#x4E00;&#x4E2A;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4EE5;&#x4E0B;&#x662F;&#x8BE5;&#x6587;&#x4EF6;&#x7684;&#x6458;&#x5F55;&#xFF1A;</p>
</blockquote>
<pre><code>...
Zombies
-------
A zombie is a server that is considered dead by the rest of the
cluster; any data stored on the server has been recovered and will
be managed by other servers. However, if a zombie is not actually
dead (e.g., it was just disconnected from the other servers for a
while) two forms of inconsistency can arise:
* A zombie server must not serve read requests once replacement servers have taken over; otherwise it may return stale data that does not reflect writes accepted by the replacement servers.
* The zombie server must not accept write requests once replacement servers have begun replaying its log during recovery; if it does, these writes may be lost (the new values may not be stored on the replacement servers and thus will not be returned by reads).

RAMCloud uses two techniques to neutralize zombies. First,
...
</code></pre><p>Then, in any piece of code that relates to one of these issues there is a short comment referring to the designNotes file:</p>
<blockquote>
<p>&#x7136;&#x540E;&#xFF0C;&#x5728;&#x4E0E;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x4E4B;&#x4E00;&#x76F8;&#x5173;&#x7684;&#x4EFB;&#x4F55;&#x4EE3;&#x7801;&#x6BB5;&#x4E2D;&#xFF0C;&#x90FD;&#x6709;&#x4E00;&#x6761;&#x7B80;&#x77ED;&#x7684;&#x6CE8;&#x91CA;&#x5F15;&#x7528;&#x4E86; designNotes &#x6587;&#x4EF6;&#xFF1A;</p>
</blockquote>
<pre><code class="lang-c"><span class="hljs-comment">// See &quot;Zombies&quot; in designNotes.</span>
</code></pre>
<p>With this approach, there is only a single copy of the documentation and it is relatively easy for developers to find it when they need it. However, this has the disadvantage that the documentation is not near any of the pieces of code that depend on it, so it may be difficult to keep up-to-date as the system evolves.</p>
<blockquote>
<p>&#x4F7F;&#x7528;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#xFF0C;&#x6587;&#x6863;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x526F;&#x672C;&#xFF0C;&#x56E0;&#x6B64;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5728;&#x9700;&#x8981;&#x65F6;&#x53EF;&#x4EE5;&#x76F8;&#x5BF9;&#x5BB9;&#x6613;&#x5730;&#x627E;&#x5230;&#x5B83;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x8FD9;&#x6837;&#x505A;&#x7684;&#x7F3A;&#x70B9;&#x662F;&#xFF0C;&#x6587;&#x6863;&#x79BB;&#x5B83;&#x4F9D;&#x8D56;&#x7684;&#x4EFB;&#x4F55;&#x4EE3;&#x7801;&#x6BB5;&#x90FD;&#x4E0D;&#x8FD1;&#xFF0C;&#x56E0;&#x6B64;&#x968F;&#x7740;&#x7CFB;&#x7EDF;&#x7684;&#x53D1;&#x5C55;&#xFF0C;&#x53EF;&#x80FD;&#x96BE;&#x4EE5;&#x4FDD;&#x6301;&#x6700;&#x65B0;&#x3002;</p>
</blockquote>
<h2 id="138-conclusion-&#x7ED3;&#x8BBA;">13.8 Conclusion &#x7ED3;&#x8BBA;</h2>
<p>The goal of comments is to ensure that the structure and behavior of the system is obvious to readers, so they can quickly find the information they need and make modifications to the system with confidence that they will work. Some of this information can be represented in the code in a way that will already be obvious to readers, but there is a significant amount of information that can&#x2019;t easily be deduced from the code. Comments fill in this information.</p>
<blockquote>
<p>&#x8BC4;&#x8BBA;&#x7684;&#x76EE;&#x7684;&#x662F;&#x786E;&#x4FDD;&#x7CFB;&#x7EDF;&#x7684;&#x7ED3;&#x6784;&#x548C;&#x884C;&#x4E3A;&#x5BF9;&#x8BFB;&#x8005;&#x6765;&#x8BF4;&#x662F;&#x663E;&#x800C;&#x6613;&#x89C1;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x4ED6;&#x4EEC;&#x53EF;&#x4EE5;&#x5FEB;&#x901F;&#x627E;&#x5230;&#x6240;&#x9700;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x5E76;&#x6709;&#x4FE1;&#x5FC3;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x4FEE;&#x6539;&#xFF0C;&#x4EE5;&#x5BF9;&#x7CFB;&#x7EDF;&#x8FDB;&#x884C;&#x4FEE;&#x6539;&#x3002;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x4E2D;&#x7684;&#x67D0;&#x4E9B;&#x4FE1;&#x606F;&#x53EF;&#x4EE5;&#x4EE5;&#x5BF9;&#x8BFB;&#x8005;&#x6765;&#x8BF4;&#x663E;&#x800C;&#x6613;&#x89C1;&#x7684;&#x65B9;&#x5F0F;&#x8868;&#x793A;&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#xFF0C;&#x4F46;&#x662F;&#x6709;&#x5927;&#x91CF;&#x4FE1;&#x606F;&#x65E0;&#x6CD5;&#x4ECE;&#x4EE3;&#x7801;&#x4E2D;&#x8F7B;&#x6613;&#x63A8;&#x5BFC;&#x51FA;&#x3002;&#x6CE8;&#x91CA;&#x5C06;&#x586B;&#x5199;&#x6B64;&#x4FE1;&#x606F;&#x3002;</p>
</blockquote>
<p>When following the rule that comments should describe things that aren&#x2019;t obvious from the code, &#x201C;obvious&#x201D; is from the perspective of someone reading your code for the first time (not you). When writing comments, try to put yourself in the mindset of the reader and ask yourself what are the key things he or she will need to know. If your code is undergoing review and a reviewer tells you that something is not obvious, don&#x2019;t argue with them; if a reader thinks it&#x2019;s not obvious, then it&#x2019;s not obvious. Instead of arguing, try to understand what they found confusing and see if you can clarify that, either with better comments or better code.</p>
<blockquote>
<p>&#x5F53;&#x9075;&#x5FAA;&#x6CE8;&#x91CA;&#x5E94;&#x63CF;&#x8FF0;&#x4EE3;&#x7801;&#x4E2D;&#x4E0D;&#x660E;&#x663E;&#x7684;&#x5185;&#x5BB9;&#x7684;&#x89C4;&#x5219;&#x65F6;&#xFF0C;&#x201C;&#x660E;&#x663E;&#x201D;&#x662F;&#x4ECE;&#x7B2C;&#x4E00;&#x6B21;&#x8BFB;&#x53D6;&#x60A8;&#x7684;&#x4EE3;&#x7801;&#x7684;&#x4EBA;&#xFF08;&#x4E0D;&#x662F;&#x60A8;&#xFF09;&#x7684;&#x89D2;&#x5EA6;&#x51FA;&#x53D1;&#x3002;&#x5728;&#x64B0;&#x5199;&#x8BC4;&#x8BBA;&#x65F6;&#xFF0C;&#x8BF7;&#x5C1D;&#x8BD5;&#x4F7F;&#x81EA;&#x5DF1;&#x8FDB;&#x5165;&#x8BFB;&#x8005;&#x7684;&#x5FC3;&#x6001;&#xFF0C;&#x5E76;&#x95EE;&#x81EA;&#x5DF1;&#x4ED6;&#x6216;&#x5979;&#x9700;&#x8981;&#x77E5;&#x9053;&#x54EA;&#x4E9B;&#x5173;&#x952E;&#x4E8B;&#x9879;&#x3002;&#x5982;&#x679C;&#x60A8;&#x7684;&#x4EE3;&#x7801;&#x6B63;&#x5728;&#x63A5;&#x53D7;&#x5BA1;&#x6838;&#xFF0C;&#x5E76;&#x4E14;&#x5BA1;&#x6838;&#x8005;&#x544A;&#x8BC9;&#x60A8;&#x67D0;&#x4E9B;&#x4E0D;&#x660E;&#x663E;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x8BF7;&#x4E0D;&#x8981;&#x4E0E;&#x4ED6;&#x4EEC;&#x4E89;&#x8BBA;&#x3002;&#x5982;&#x679C;&#x8BFB;&#x8005;&#x8BA4;&#x4E3A;&#x5B83;&#x4E0D;&#x660E;&#x663E;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x5C31;&#x4E0D;&#x660E;&#x663E;&#x3002;&#x4E0D;&#x7528;&#x4E89;&#x8BBA;&#xFF0C;&#x800C;&#x662F;&#x5C1D;&#x8BD5;&#x4E86;&#x89E3;&#x4ED6;&#x4EEC;&#x53D1;&#x73B0;&#x7684;&#x4EE4;&#x4EBA;&#x56F0;&#x60D1;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x5E76;&#x67E5;&#x770B;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x66F4;&#x597D;&#x7684;&#x6CE8;&#x91CA;&#x6216;&#x66F4;&#x597D;&#x7684;&#x4EE3;&#x7801;&#x6765;&#x6F84;&#x6E05;&#x5B83;&#x4EEC;&#x3002;</p>
</blockquote>
<h2 id="139-answers-to-questions-from-section-135-&#x56DE;&#x7B54;&#x7B2C;-135-&#x8282;&#x4E2D;&#x7684;&#x95EE;&#x9898;">13.9 Answers to questions from Section 13.5 &#x56DE;&#x7B54;&#x7B2C; 13.5 &#x8282;&#x4E2D;&#x7684;&#x95EE;&#x9898;</h2>
<p>Does a developer need to know each of the following pieces of information in order to use the IndexLookup class?</p>
<blockquote>
<p>&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x662F;&#x5426;&#x9700;&#x8981;&#x4E86;&#x89E3;&#x4EE5;&#x4E0B;&#x6BCF;&#x6761;&#x4FE1;&#x606F;&#x624D;&#x80FD;&#x4F7F;&#x7528; IndexLookup &#x7C7B;&#xFF1F;</p>
</blockquote>
<ol>
<li>The format of messages that the IndexLookup class sends to the servers holding indexes and objects. No: this is an implementation detail that should be hidden within the class.</li>
<li>The comparison function used to determine whether a particular object falls in the desired range (is comparison done using integers, floating-point numbers, or strings?). Yes: users of the class need to know this information.</li>
<li>The data structure used to store indexes on servers. No: this information should be encapsulated on the servers; not even the implementation of IndexLookup should need to know this.</li>
<li>Whether or not IndexLookup issues multiple requests to different servers concurrently. Possibly: if IndexLookup uses special techniques to improve performance, then the documentation should provide some high-level information about this, since users may care about performance.</li>
<li>The mechanism for handling server crashes. No: RAMCloud recovers automatically from server crashes, so crashes are not visible to application-level software; thus, there is no need to mention crashes in the interface documentation for IndexLookup. If crashes were reflected up to applications, then the interface documentation would need to describe how they manifest themselves (but not the details of how crash recovery works).</li>
</ol>
<hr>
<blockquote>
<ol>
<li>IndexLookup &#x7C7B;&#x53D1;&#x9001;&#x7ED9;&#x5305;&#x542B;&#x7D22;&#x5F15;&#x548C;&#x5BF9;&#x8C61;&#x7684;&#x670D;&#x52A1;&#x5668;&#x7684;&#x6D88;&#x606F;&#x683C;&#x5F0F;&#x3002;&#x5426;&#xFF1A;&#x8FD9;&#x662F;&#x5E94;&#x9690;&#x85CF;&#x5728;&#x7C7B;&#x4E2D;&#x7684;&#x5B9E;&#x73B0;&#x7EC6;&#x8282;&#x3002;</li>
<li>&#x7528;&#x4E8E;&#x786E;&#x5B9A;&#x7279;&#x5B9A;&#x5BF9;&#x8C61;&#x662F;&#x5426;&#x5728;&#x6240;&#x9700;&#x8303;&#x56F4;&#x5185;&#x7684;&#x6BD4;&#x8F83;&#x529F;&#x80FD;&#xFF08;&#x4F7F;&#x7528;&#x6574;&#x6570;&#xFF0C;&#x6D6E;&#x70B9;&#x6570;&#x6216;&#x5B57;&#x7B26;&#x4E32;&#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#x5417;&#xFF1F;&#xFF09;&#x3002;&#x662F;&#xFF1A;&#x8BE5;&#x8BFE;&#x7A0B;&#x7684;&#x7528;&#x6237;&#x9700;&#x8981;&#x4E86;&#x89E3;&#x6B64;&#x4FE1;&#x606F;&#x3002;</li>
<li>&#x7528;&#x4E8E;&#x5728;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x5B58;&#x50A8;&#x7D22;&#x5F15;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;&#x5426;&#xFF1A;&#x6B64;&#x4FE1;&#x606F;&#x5E94;&#x5C01;&#x88C5;&#x5728;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#xFF1B;&#x751A;&#x81F3; IndexLookup &#x7684;&#x5B9E;&#x73B0;&#x90FD;&#x4E0D;&#x9700;&#x8981;&#x77E5;&#x9053;&#x8FD9;&#x4E00;&#x70B9;&#x3002;</li>
<li>IndexLookup &#x662F;&#x5426;&#x540C;&#x65F6;&#x5411;&#x591A;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#x53D1;&#x51FA;&#x591A;&#x4E2A;&#x8BF7;&#x6C42;&#x3002;&#x53EF;&#x80FD;&#xFF1A;&#x5982;&#x679C; IndexLookup &#x4F7F;&#x7528;&#x7279;&#x6B8A;&#x6280;&#x672F;&#x6765;&#x63D0;&#x9AD8;&#x6027;&#x80FD;&#xFF0C;&#x5219;&#x6587;&#x6863;&#x5E94;&#x63D0;&#x4F9B;&#x6709;&#x5173;&#x6B64;&#x95EE;&#x9898;&#x7684;&#x4E00;&#x4E9B;&#x9AD8;&#x7EA7;&#x4FE1;&#x606F;&#xFF0C;&#x56E0;&#x4E3A;&#x7528;&#x6237;&#x53EF;&#x80FD;&#x4F1A;&#x5728;&#x610F;&#x6027;&#x80FD;&#x3002;</li>
<li>&#x5904;&#x7406;&#x670D;&#x52A1;&#x5668;&#x5D29;&#x6E83;&#x7684;&#x673A;&#x5236;&#x3002;&#x5426;&#xFF1A;RAMCloud &#x53EF;&#x4ECE;&#x670D;&#x52A1;&#x5668;&#x5D29;&#x6E83;&#x4E2D;&#x81EA;&#x52A8;&#x6062;&#x590D;&#xFF0C;&#x56E0;&#x6B64;&#x5D29;&#x6E83;&#x5BF9;&#x4E8E;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7EA7;&#x8F6F;&#x4EF6;&#x4E0D;&#x53EF;&#x89C1;&#xFF1B;&#x56E0;&#x6B64;&#xFF0C;&#x5728; IndexLookup &#x7684;&#x63A5;&#x53E3;&#x6587;&#x6863;&#x4E2D;&#x65E0;&#x9700;&#x63D0;&#x53CA;&#x5D29;&#x6E83;&#x3002;&#x5982;&#x679C;&#x5D29;&#x6E83;&#x53CD;&#x6620;&#x5230;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#xFF0C;&#x5219;&#x63A5;&#x53E3;&#x6587;&#x6863;&#x5C06;&#x9700;&#x8981;&#x63CF;&#x8FF0;&#x5B83;&#x4EEC;&#x5982;&#x4F55;&#x8868;&#x73B0;&#x51FA;&#x6765;&#xFF08;&#x800C;&#x4E0D;&#x662F;&#x5D29;&#x6E83;&#x6062;&#x590D;&#x5982;&#x4F55;&#x5DE5;&#x4F5C;&#x7684;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#xFF09;&#x3002;</li>
</ol>
</blockquote>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="ch12.html" class="navigation navigation-prev " aria-label="Previous page: 第十二章: 为什么写注释？四个理由">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="ch14.html" class="navigation navigation-next " aria-label="Next page: 第十四章: 选择的名字">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第十三章: 注释应该描述代码中不明显的内容","level":"1.16","depth":1,"next":{"title":"第十四章: 选择的名字","level":"1.17","depth":1,"path":"docs/ch14.md","ref":"./docs/ch14.md","articles":[]},"previous":{"title":"第十二章: 为什么写注释？四个理由","level":"1.15","depth":1,"path":"docs/ch12.md","ref":"./docs/ch12.md","articles":[]},"dir":"ltr"},"config":{"plugins":["back-to-top-button","expandable-chapters-small","page-toc-button","livereload"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"livereload":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"page-toc-button":{},"back-to-top-button":{},"expandable-chapters-small":{},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"John Ousterhout","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"软件设计哲学","language":"zh-hans","gitbook":"*","description":"书中讨论了软件设计的主题：如何将复杂的软件系统分解成可以相对独立实现的模块(如类和方法)"},"file":{"path":"docs/ch13.md","mtime":"2020-08-06T16:26:19.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-02-06T04:55:41.669Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-page-toc-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

