
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第十五章: 先写注释 · 软件设计哲学</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="John Ousterhout">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-page-toc-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="ch16.html" />
    
    
    <link rel="prev" href="ch14.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    首页
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="preface">
            
                <span>
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="ch1.html">
            
                <a href="ch1.html">
            
                    
                    第一章：介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="ch2.html">
            
                <a href="ch2.html">
            
                    
                    第二章：复杂性的本质
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="ch3.html">
            
                <a href="ch3.html">
            
                    
                    第三章：工作代码是不够的（战略与战术编程）
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="ch4.html">
            
                <a href="ch4.html">
            
                    
                    第四章：模块应该是深的
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="ch5.html">
            
                <a href="ch5.html">
            
                    
                    第五章：信息隐藏(和泄露)
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="ch6.html">
            
                <a href="ch6.html">
            
                    
                    第六章：通用模块更深入
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="ch7.html">
            
                <a href="ch7.html">
            
                    
                    第七章: 不同的层，不同的抽象
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="ch8.html">
            
                <a href="ch8.html">
            
                    
                    第八章: 降低复杂性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="ch9.html">
            
                <a href="ch9.html">
            
                    
                    第九章: 在一起更好还是分开更好？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="ch10.html">
            
                <a href="ch10.html">
            
                    
                    第十章: 定义不存在的错误
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="ch11.html">
            
                <a href="ch11.html">
            
                    
                    第十一章: 设计它两次
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="ch12.html">
            
                <a href="ch12.html">
            
                    
                    第十二章: 为什么写注释？四个理由
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="ch13.html">
            
                <a href="ch13.html">
            
                    
                    第十三章: 注释应该描述代码中不明显的内容
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="ch14.html">
            
                <a href="ch14.html">
            
                    
                    第十四章: 选择的名字
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.18" data-path="ch15.html">
            
                <a href="ch15.html">
            
                    
                    第十五章: 先写注释
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="ch16.html">
            
                <a href="ch16.html">
            
                    
                    第十六章: 修改现有的代码
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.20" data-path="ch17.html">
            
                <a href="ch17.html">
            
                    
                    第十七章: 一致性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.21" data-path="ch18.html">
            
                <a href="ch18.html">
            
                    
                    第十八章: 代码应该是显而易见的
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.22" data-path="ch19.html">
            
                <a href="ch19.html">
            
                    
                    第十九章: 软件发展趋势
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.23" data-path="ch20.html">
            
                <a href="ch20.html">
            
                    
                    第二十章: 设计性能
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.24" data-path="ch21.html">
            
                <a href="ch21.html">
            
                    
                    第二十一章: 结论
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.25" data-path="summary.html">
            
                <a href="summary.html">
            
                    
                    总结
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >第十五章: 先写注释</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7B2C;-15-&#x7AE0;-&#x5148;&#x5199;&#x6CE8;&#x91CA;">&#x7B2C; 15 &#x7AE0; &#x5148;&#x5199;&#x6CE8;&#x91CA;</h1>
<blockquote>
<p>Chapter 15 Write The Comments First(Use Comments As Part Of The Design Process)</p>
</blockquote>
<p>Many developers put off writing documentation until the end of the development process, after coding and unit testing are complete. This is one of the surest ways to produce poor quality documentation. The best time to write comments is at the beginning of the process, as you write the code. Writing the comments first makes documentation part of the design process. Not only does this produce better documentation, but it also produces better designs and it makes the process of writing documentation more enjoyable.</p>
<blockquote>
<p>&#x5728;&#x5B8C;&#x6210;&#x7F16;&#x7801;&#x548C;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x4E4B;&#x540E;&#xFF0C;&#x8BB8;&#x591A;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x63A8;&#x8FDF;&#x7F16;&#x5199;&#x6587;&#x6863;&#xFF0C;&#x76F4;&#x5230;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x7ED3;&#x675F;&#x3002;&#x8FD9;&#x662F;&#x4EA7;&#x751F;&#x8D28;&#x91CF;&#x5DEE;&#x7684;&#x6587;&#x6863;&#x7684;&#x6700;&#x53EF;&#x9760;&#x65B9;&#x6CD5;&#x4E4B;&#x4E00;&#x3002;&#x7F16;&#x5199;&#x6CE8;&#x91CA;&#x7684;&#x6700;&#x4F73;&#x65F6;&#x95F4;&#x662F;&#x5728;&#x8FC7;&#x7A0B;&#x5F00;&#x59CB;&#x65F6;&#x3002;&#x9996;&#x5148;&#x7F16;&#x5199;&#x6CE8;&#x91CA;&#x4F7F;&#x6587;&#x6863;&#x6210;&#x4E3A;&#x8BBE;&#x8BA1;&#x8FC7;&#x7A0B;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;&#x8FD9;&#x4E0D;&#x4EC5;&#x53EF;&#x4EE5;&#x4EA7;&#x751F;&#x66F4;&#x597D;&#x7684;&#x6587;&#x6863;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x4EA7;&#x751F;&#x66F4;&#x597D;&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x5E76;&#x4F7F;&#x7F16;&#x5199;&#x6587;&#x6863;&#x7684;&#x8FC7;&#x7A0B;&#x66F4;&#x52A0;&#x6109;&#x5FEB;&#x3002;</p>
</blockquote>
<h2 id="151-delayed-comments-are-bad-comments-&#x8FDF;&#x5230;&#x7684;&#x6CE8;&#x91CA;&#x4E0D;&#x662F;&#x597D;&#x6CE8;&#x91CA;">15.1 Delayed comments are bad comments &#x8FDF;&#x5230;&#x7684;&#x6CE8;&#x91CA;&#x4E0D;&#x662F;&#x597D;&#x6CE8;&#x91CA;</h2>
<p>Almost every developer I have ever met puts off writing comments. When asked why they don&#x2019;t write documentation earlier, they say that the code is still changing. If they write documentation early, they say, they&#x2019;ll have to rewrite it when the code changes; better to wait until the code stabilizes. However, I suspect that there is also another reason, which is that they view documentation as drudge work; thus, they put it off as long as possible.</p>
<blockquote>
<p>&#x6211;&#x89C1;&#x8FC7;&#x7684;&#x51E0;&#x4E4E;&#x6BCF;&#x4E2A;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x90FD;&#x4F1A;&#x63A8;&#x8FDF;&#x7F16;&#x5199;&#x6CE8;&#x91CA;&#x3002;&#x5F53;&#x88AB;&#x95EE;&#x53CA;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x66F4;&#x65E9;&#x7F16;&#x5199;&#x6587;&#x6863;&#x65F6;&#xFF0C;&#x4ED6;&#x4EEC;&#x8BF4;&#x4EE3;&#x7801;&#x4ECD;&#x5728;&#x66F4;&#x6539;&#x3002;&#x4ED6;&#x4EEC;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x4ED6;&#x4EEC;&#x5C3D;&#x65E9;&#x7F16;&#x5199;&#x6587;&#x6863;&#xFF0C;&#x5219;&#x5FC5;&#x987B;&#x5728;&#x4EE3;&#x7801;&#x66F4;&#x6539;&#x65F6;&#x91CD;&#x65B0;&#x7F16;&#x5199;&#x6587;&#x6863;&#x3002;&#x6700;&#x597D;&#x7B49;&#x5230;&#x4EE3;&#x7801;&#x7A33;&#x5B9A;&#x4E0B;&#x6765;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x6211;&#x6000;&#x7591;&#x8FD8;&#x6709;&#x53E6;&#x4E00;&#x4E2A;&#x539F;&#x56E0;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x4ED6;&#x4EEC;&#x5C06;&#x6587;&#x6863;&#x89C6;&#x4E3A;&#x7E41;&#x7410;&#x7684;&#x5DE5;&#x4F5C;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x4ED6;&#x4EEC;&#x5C3D;&#x53EF;&#x80FD;&#x5730;&#x63A8;&#x8FDF;&#x4E86;&#x3002;</p>
</blockquote>
<p>Unfortunately, this approach has several negative consequences. First, delaying documentation often means that it never gets written at all. Once you start delaying, it&#x2019;s easy to delay a bit more; after all, the code will be even more stable in a few more weeks. By the time the code has inarguably stabilized, there is a lot of it, which means the task of writing documentation has become huge and even less attractive. There&#x2019;s never a convenient time to stop for a few days and fill in all of the missing comments, and it&#x2019;s easy to rationalize that the best thing for the project is to move on and fix bugs or write the next new feature. This will create even more undocumented code.</p>
<blockquote>
<p>&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x6709;&#x51E0;&#x4E2A;&#x8D1F;&#x9762;&#x5F71;&#x54CD;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x5EF6;&#x8FDF;&#x6587;&#x6863;&#x901A;&#x5E38;&#x610F;&#x5473;&#x7740;&#x6839;&#x672C;&#x65E0;&#x6CD5;&#x7F16;&#x5199;&#x6587;&#x6863;&#x3002;&#x4E00;&#x65E6;&#x5F00;&#x59CB;&#x5EF6;&#x8FDF;&#xFF0C;&#x5C31;&#x5BB9;&#x6613;&#x518D;&#x5EF6;&#x8FDF;&#x4E00;&#x4E9B;&#x3002;&#x6BD5;&#x7ADF;&#xFF0C;&#x4EE3;&#x7801;&#x5C06;&#x5728;&#x51E0;&#x5468;&#x540E;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x7A33;&#x5B9A;&#x3002;&#x5230;&#x4E86;&#x4EE3;&#x7801;&#x6BEB;&#x65E0;&#x7591;&#x95EE;&#x5730;&#x7A33;&#x5B9A;&#x4E0B;&#x6765;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4EE3;&#x7801;&#x5DF2;&#x7ECF;&#x5F88;&#x591A;&#x4E86;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x7F16;&#x5199;&#x6587;&#x6863;&#x7684;&#x4EFB;&#x52A1;&#x53D8;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x5E9E;&#x5927;&#xFF0C;&#x5438;&#x5F15;&#x529B;&#x4E5F;&#x8D8A;&#x6765;&#x8D8A;&#x5C0F;&#x3002;&#x4ECE;&#x6765;&#x6CA1;&#x6709;&#x4E00;&#x4E2A;&#x65B9;&#x4FBF;&#x7684;&#x65F6;&#x95F4;&#x53EF;&#x4EE5;&#x505C;&#x4E0B;&#x6765;&#x51E0;&#x5929;&#x5E76;&#x586B;&#x5199;&#x6240;&#x6709;&#x9057;&#x6F0F;&#x7684;&#x6CE8;&#x91CA;&#xFF0C;&#x5E76;&#x4E14;&#x5F88;&#x5BB9;&#x6613;&#x4F7F;&#x8BE5;&#x9879;&#x76EE;&#x7684;&#x6700;&#x4F73;&#x9009;&#x62E9;&#x5408;&#x7406;&#x5316;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x7EE7;&#x7EED;&#x5E76;&#x4FEE;&#x590D;&#x9519;&#x8BEF;&#x6216;&#x7F16;&#x5199;&#x4E0B;&#x4E00;&#x4E2A;&#x65B0;&#x529F;&#x80FD;&#x3002;&#x8FD9;&#x5C06;&#x521B;&#x5EFA;&#x66F4;&#x591A;&#x672A;&#x8BB0;&#x5F55;&#x7684;&#x4EE3;&#x7801;&#x3002;</p>
</blockquote>
<p>Even if you do have the self-discipline to go back and write the comments (and don&#x2019;t fool yourself: you probably don&#x2019;t), the comments won&#x2019;t be very good. By this time in the process, you have checked out mentally. In your mind, this piece of code is done; you are eager to move on to your next project. You know that writing comments is the right thing to do, but it&#x2019;s no fun. You just want to get through it as quickly as possible. Thus, you make a quick pass over the code, adding just enough comments to look respectable. By now, it&#x2019;s been a while since you designed the code, so your memories of the design process are becoming fuzzy. You look at the code as you are writing the comments, so the comments repeat the code. Even if you try to reconstruct the design ideas that aren&#x2019;t obvious from the code, there will be things you don&#x2019;t remember. Thus, the comments are missing some of the most important things they should describe.</p>
<blockquote>
<p>&#x5373;&#x4F7F;&#x4F60;&#x6709;&#x81EA;&#x5F8B;&#x6027;&#x56DE;&#x53BB;&#x5199;&#x6CE8;&#x91CA;(&#x4E0D;&#x8981;&#x6B3A;&#x9A97;&#x4F60;&#x81EA;&#x5DF1;:&#x4F60;&#x53EF;&#x80FD;&#x6CA1;&#x6709;)&#xFF0C;&#x6CE8;&#x91CA;&#x4E5F;&#x4E0D;&#x4F1A;&#x5F88;&#x597D;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x7684;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x5DF2;&#x7ECF;&#x5728;&#x7CBE;&#x795E;&#x4E0A;&#x79BB;&#x5F00;&#x4E86;&#x3002;&#x5728;&#x4F60;&#x7684;&#x8111;&#x6D77;&#x4E2D;&#xFF0C;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x5DF2;&#x7ECF;&#x5B8C;&#x6210;&#x4E86;;&#x4F60;&#x6025;&#x4E8E;&#x5F00;&#x59CB;&#x4E0B;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x3002;&#x4F60;&#x77E5;&#x9053;&#x5199;&#x6CE8;&#x91CA;&#x662F;&#x6B63;&#x786E;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x4F46;&#x5B83;&#x6CA1;&#x6709;&#x4E50;&#x8DA3;&#x3002;&#x4F60;&#x53EA;&#x60F3;&#x5C3D;&#x5FEB;&#x5EA6;&#x8FC7;&#x96BE;&#x5173;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x5FEB;&#x901F;&#x5730;&#x6D4F;&#x89C8;&#x4EE3;&#x7801;&#xFF0C;&#x6DFB;&#x52A0;&#x8DB3;&#x591F;&#x7684;&#x6CE8;&#x91CA;&#x4EE5;&#x4F7F;&#x5176;&#x770B;&#x8D77;&#x6765;&#x4EE4;&#x4EBA;&#x6EE1;&#x610F;&#x3002;&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#xFF0C;&#x60A8;&#x5DF2;&#x7ECF;&#x6709;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x6CA1;&#x6709;&#x8BBE;&#x8BA1;&#x4EE3;&#x7801;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x60A8;&#x5BF9;&#x8BBE;&#x8BA1;&#x8FC7;&#x7A0B;&#x7684;&#x8BB0;&#x5FC6;&#x53D8;&#x5F97;&#x6A21;&#x7CCA;&#x4E86;&#x3002;&#x60A8;&#x5728;&#x7F16;&#x5199;&#x6CE8;&#x91CA;&#x65F6;&#x67E5;&#x770B;&#x4EE3;&#x7801;&#xFF0C;&#x56E0;&#x6B64;&#x6CE8;&#x91CA;&#x91CD;&#x590D;&#x4E86;&#x4EE3;&#x7801;&#x3002;&#x5373;&#x4F7F;&#x60A8;&#x8BD5;&#x56FE;&#x91CD;&#x6784;&#x4EE3;&#x7801;&#x4E2D;&#x4E0D;&#x660E;&#x663E;&#x7684;&#x8BBE;&#x8BA1;&#x601D;&#x60F3;&#xFF0C;&#x4E5F;&#x4F1A;&#x6709;&#x60A8;&#x4E0D;&#x8BB0;&#x5F97;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x8FD9;&#x4E9B;&#x6CE8;&#x91CA;&#x5FFD;&#x7565;&#x4E86;&#x4ED6;&#x4EEC;&#x5E94;&#x8BE5;&#x63CF;&#x8FF0;&#x7684;&#x4E00;&#x4E9B;&#x6700;&#x91CD;&#x8981;&#x7684;&#x4E8B;&#x60C5;&#x3002;</p>
</blockquote>
<h2 id="152-write-the-comments-first-&#x9996;&#x5148;&#x5199;&#x6CE8;&#x91CA;">15.2 Write the comments first &#x9996;&#x5148;&#x5199;&#x6CE8;&#x91CA;</h2>
<p>I use a different approach to writing comments, where I write the comments at the very beginning:</p>
<blockquote>
<p>&#x6211;&#x4F7F;&#x7528;&#x4E00;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x65B9;&#x6CD5;&#x6765;&#x7F16;&#x5199;&#x6CE8;&#x91CA;&#xFF0C;&#x5728;&#x5F00;&#x59CB;&#x65F6;&#x5C31;&#x5199;&#x6CE8;&#x91CA;&#xFF1A;</p>
</blockquote>
<ul>
<li>For a new class, I start by writing the class interface comment.</li>
<li>Next, I write interface comments and signatures for the most important public methods, but I leave the method bodies empty.</li>
<li>I iterate a bit over these comments until the basic structure feels about right.</li>
<li>At this point I write declarations and comments for the most important class instance variables in the class.</li>
<li>Finally, I fill in the bodies of the methods, adding implementation comments as needed.</li>
<li>While writing method bodies, I usually discover the need for additional methods and instance variables. For each new method I write the interface comment before the body of the method; for instance variables I fill in the comment at the same time that I write the variable declaration.</li>
</ul>
<hr>
<blockquote>
<ul>
<li>&#x5BF9;&#x4E8E;&#x65B0;&#x7C7B;&#xFF0C;&#x6211;&#x9996;&#x5148;&#x7F16;&#x5199;&#x7C7B;&#x63A5;&#x53E3;&#x6CE8;&#x91CA;&#x3002;</li>
<li>&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x6211;&#x4E3A;&#x6700;&#x91CD;&#x8981;&#x7684;&#x516C;&#x5171;&#x65B9;&#x6CD5;&#x7F16;&#x5199;&#x63A5;&#x53E3;&#x6CE8;&#x91CA;&#x548C;&#x7B7E;&#x540D;&#xFF0C;&#x4F46;&#x5C06;&#x65B9;&#x6CD5;&#x4E3B;&#x4F53;&#x4FDD;&#x7559;&#x4E3A;&#x7A7A;&#x3002;</li>
<li>&#x6211;&#x5BF9;&#x8FD9;&#x4E9B;&#x6CE8;&#x91CA;&#x8FDB;&#x884C;&#x4E86;&#x8FED;&#x4EE3;&#xFF0C;&#x76F4;&#x5230;&#x57FA;&#x672C;&#x7ED3;&#x6784;&#x611F;&#x89C9;&#x6B63;&#x786E;&#x4E3A;&#x6B62;&#x3002;</li>
<li>&#x5728;&#x8FD9;&#x4E00;&#x70B9;&#x4E0A;&#xFF0C;&#x6211;&#x4E3A;&#x7C7B;&#x4E2D;&#x6700;&#x91CD;&#x8981;&#x7684;&#x7C7B;&#x5B9E;&#x4F8B;&#x53D8;&#x91CF;&#x7F16;&#x5199;&#x4E86;&#x58F0;&#x660E;&#x548C;&#x6CE8;&#x91CA;&#x3002;</li>
<li>&#x6700;&#x540E;&#xFF0C;&#x6211;&#x586B;&#x5199;&#x65B9;&#x6CD5;&#x7684;&#x4E3B;&#x4F53;&#xFF0C;&#x5E76;&#x6839;&#x636E;&#x9700;&#x8981;&#x6DFB;&#x52A0;&#x5B9E;&#x73B0;&#x6CE8;&#x91CA;&#x3002;</li>
<li>&#x5728;&#x7F16;&#x5199;&#x65B9;&#x6CD5;&#x4E3B;&#x4F53;&#x65F6;&#xFF0C;&#x6211;&#x901A;&#x5E38;&#x4F1A;&#x53D1;&#x73B0;&#x9700;&#x8981;&#x5176;&#x4ED6;&#x65B9;&#x6CD5;&#x548C;&#x5B9E;&#x4F8B;&#x53D8;&#x91CF;&#x3002;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E2A;&#x65B0;&#x65B9;&#x6CD5;&#xFF0C;&#x6211;&#x5728;&#x65B9;&#x6CD5;&#x4E3B;&#x4F53;&#x4E4B;&#x524D;&#x7F16;&#x5199;&#x63A5;&#x53E3;&#x6CE8;&#x91CA;&#x3002;&#x4F8B;&#x5982;&#x53D8;&#x91CF;&#xFF0C;&#x6211;&#x5728;&#x7F16;&#x5199;&#x53D8;&#x91CF;&#x58F0;&#x660E;&#x7684;&#x540C;&#x65F6;&#x586B;&#x5199;&#x4E86;&#x6CE8;&#x91CA;&#x3002;</li>
</ul>
</blockquote>
<p>When the code is done, the comments are also done. There is never a backlog of unwritten comments.</p>
<blockquote>
<p>&#x4EE3;&#x7801;&#x5B8C;&#x6210;&#x540E;&#xFF0C;&#x6CE8;&#x91CA;&#x4E5F;&#x5C06;&#x5B8C;&#x6210;&#x3002;&#x4ECE;&#x6765;&#x6CA1;&#x6709;&#x79EF;&#x538B;&#x7684;&#x4E66;&#x9762;&#x6CE8;&#x91CA;&#x3002;</p>
</blockquote>
<p>The comments-first approach has three benefits. First, it produces better comments. If you write the comments as you are designing the class, the key design issues will be fresh in your mind, so it&#x2019;s easy to record them. It&#x2019;s better to write the interface comment for each method before its body, so you can focus on the method&#x2019;s abstraction and interface without being distracted by its implementation. During the coding and testing process you will notice and fix problems with the comments. As a result, the comments improve over the course of development.</p>
<blockquote>
<p>&#x6CE8;&#x91CA;&#x4F18;&#x5148;&#x7684;&#x65B9;&#x6CD5;&#x5177;&#x6709;&#x4E09;&#x4E2A;&#x597D;&#x5904;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x5B83;&#x4F1A;&#x4EA7;&#x751F;&#x66F4;&#x597D;&#x7684;&#x6CE8;&#x91CA;&#x3002;&#x5982;&#x679C;&#x60A8;&#x5728;&#x8BBE;&#x8BA1;&#x8BFE;&#x7A0B;&#x65F6;&#x5199;&#x6CE8;&#x91CA;&#xFF0C;&#x90A3;&#x4E48;&#x5173;&#x952E;&#x7684;&#x8BBE;&#x8BA1;&#x95EE;&#x9898;&#x5C06;&#x5728;&#x60A8;&#x7684;&#x8111;&#x6D77;&#x4E2D;&#x6D6E;&#x73B0;&#xFF0C;&#x56E0;&#x6B64;&#x5F88;&#x5BB9;&#x6613;&#x8BB0;&#x5F55;&#x4E0B;&#x6765;&#x3002;&#x6700;&#x597D;&#x5728;&#x6BCF;&#x4E2A;&#x65B9;&#x6CD5;&#x7684;&#x4E3B;&#x4F53;&#x4E4B;&#x524D;&#x7F16;&#x5199;&#x63A5;&#x53E3;&#x6CE8;&#x91CA;&#xFF0C;&#x8FD9;&#x6837;&#x60A8;&#x5C31;&#x53EF;&#x4EE5;&#x4E13;&#x6CE8;&#x4E8E;&#x65B9;&#x6CD5;&#x7684;&#x62BD;&#x8C61;&#x548C;&#x63A5;&#x53E3;&#xFF0C;&#x800C;&#x4E0D;&#x4F1A;&#x56E0;&#x5176;&#x5B9E;&#x73B0;&#x800C;&#x5206;&#x5FC3;&#x3002;&#x5728;&#x7F16;&#x7801;&#x548C;&#x6D4B;&#x8BD5;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x60A8;&#x4F1A;&#x6CE8;&#x610F;&#x5230;&#x5E76;&#x4FEE;&#x590D;&#x6CE8;&#x91CA;&#x95EE;&#x9898;&#x3002;&#x7ED3;&#x679C;&#xFF0C;&#x6CE8;&#x91CA;&#x5728;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#x5F97;&#x5230;&#x4E86;&#x6539;&#x5584;&#x3002;</p>
</blockquote>
<h2 id="153-comments-are-a-design-tool-&#x6CE8;&#x91CA;&#x662F;&#x4E00;&#x79CD;&#x8BBE;&#x8BA1;&#x5DE5;&#x5177;">15.3 Comments are a design tool &#x6CE8;&#x91CA;&#x662F;&#x4E00;&#x79CD;&#x8BBE;&#x8BA1;&#x5DE5;&#x5177;</h2>
<p>The second, and most important, benefit of writing the comments at the beginning is that it improves the system design. Comments provide the only way to fully capture abstractions, and good abstractions are fundamental to good system design. If you write comments describing the abstractions at the beginning, you can review and tune them before writing implementation code. To write a good comment, you must identify the essence of a variable or piece of code: what are the most important aspects of this thing? It&#x2019;s important to do this early in the design process; otherwise you are just hacking code.</p>
<blockquote>
<p>&#x5728;&#x5F00;&#x59CB;&#x65F6;&#x7F16;&#x5199;&#x6CE8;&#x91CA;&#x7684;&#x7B2C;&#x4E8C;&#x4E2A;&#x4E5F;&#x662F;&#x6700;&#x91CD;&#x8981;&#x7684;&#x597D;&#x5904;&#x662F;&#x53EF;&#x4EE5;&#x6539;&#x5584;&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;&#x3002;&#x6CE8;&#x91CA;&#x63D0;&#x4F9B;&#x4E86;&#x5B8C;&#x5168;&#x6355;&#x83B7;&#x62BD;&#x8C61;&#x7684;&#x552F;&#x4E00;&#x65B9;&#x6CD5;&#xFF0C;&#x597D;&#x7684;&#x62BD;&#x8C61;&#x662F;&#x597D;&#x7684;&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;&#x7684;&#x57FA;&#x7840;&#x3002;&#x5982;&#x679C;&#x60A8;&#x5728;&#x4E00;&#x5F00;&#x59CB;&#x5C31;&#x5199;&#x4E86;&#x63CF;&#x8FF0;&#x62BD;&#x8C61;&#x7684;&#x6CE8;&#x91CA;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x5728;&#x7F16;&#x5199;&#x5B9E;&#x73B0;&#x4EE3;&#x7801;&#x4E4B;&#x524D;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x68C0;&#x67E5;&#x548C;&#x8C03;&#x6574;&#x3002;&#x8981;&#x5199;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x6CE8;&#x91CA;&#xFF0C;&#x60A8;&#x5FC5;&#x987B;&#x786E;&#x5B9A;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x6216;&#x4E00;&#x6BB5;&#x4EE3;&#x7801;&#x7684;&#x672C;&#x8D28;&#xFF1A;&#x8FD9;&#x4EF6;&#x4E8B;&#x6700;&#x91CD;&#x8981;&#x7684;&#x65B9;&#x9762;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x5728;&#x8BBE;&#x8BA1;&#x8FC7;&#x7A0B;&#x7684;&#x65E9;&#x671F;&#x8FDB;&#x884C;&#x6B64;&#x64CD;&#x4F5C;&#x5F88;&#x91CD;&#x8981;&#xFF1B;&#x5426;&#x5219;&#xFF0C;&#x60A8;&#x53EA;&#x662F;&#x5728;&#x7834;&#x89E3;&#x4EE3;&#x7801;&#x3002;</p>
</blockquote>
<p>Comments serve as a canary in the coal mine of complexity. If a method or variable requires a long comment, it is a red flag that you don&#x2019;t have a good abstraction. Remember from Chapter 4 that classes should be deep: the best classes have very simple interfaces yet implement powerful functions. The best way to judge the complexity of an interface is from the comments that describe it. If the interface comment for a method provides all the information needed to use the method and is also short and simple, that indicates that the method has a simple interface. Conversely, if there&#x2019;s no way to describe a method completely without a long and complicated comment, then the method has a complex interface. You can compare a method&#x2019;s interface comment with the implementation to get a sense of how deep the method is: if the interface comment must describe all the major features of the implementation, then the method is shallow. The same idea applies to variables: if it takes a long comment to fully describe a variable, it&#x2019;s a red flag that suggests you may not have chosen the right variable decomposition. Overall, the act of writing comments allows you to evaluate your design decisions early, so you can discover and fix problems.</p>
<blockquote>
<p>&#x6CE8;&#x91CA;&#x662F;&#x590D;&#x6742;&#x7164;&#x77FF;&#x4E2D;&#x7684;&#x91D1;&#x4E1D;&#x96C0;&#x3002;&#x5982;&#x679C;&#x65B9;&#x6CD5;&#x6216;&#x53D8;&#x91CF;&#x9700;&#x8981;&#x8F83;&#x957F;&#x7684;&#x6CE8;&#x91CA;&#xFF0C;&#x5219;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x5371;&#x9669;&#x4FE1;&#x53F7;&#xFF0C;&#x8868;&#x660E;&#x60A8;&#x6CA1;&#x6709;&#x5F88;&#x597D;&#x7684;&#x62BD;&#x8C61;&#x3002;&#x8BF7;&#x8BB0;&#x4F4F;&#xFF0C;&#x5728;&#x7B2C; 4 &#x7AE0;&#x4E2D;&#xFF0C;&#x7C7B;&#x5E94;&#x8BE5;&#x5F88;&#x6DF1;&#xFF1A;&#x6700;&#x597D;&#x7684;&#x7C7B;&#x5177;&#x6709;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x4F46;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x5F3A;&#x5927;&#x7684;&#x529F;&#x80FD;&#x3002;&#x5224;&#x65AD;&#x63A5;&#x53E3;&#x590D;&#x6742;&#x6027;&#x7684;&#x6700;&#x4F73;&#x65B9;&#x6CD5;&#x662F;&#x4ECE;&#x63CF;&#x8FF0;&#x63A5;&#x53E3;&#x7684;&#x6CE8;&#x91CA;&#x4E2D;&#x8FDB;&#x884C;&#x3002;&#x5982;&#x679C;&#x67D0;&#x4E2A;&#x65B9;&#x6CD5;&#x7684;&#x63A5;&#x53E3;&#x6CE8;&#x91CA;&#x63D0;&#x4F9B;&#x4E86;&#x4F7F;&#x7528;&#x8BE5;&#x65B9;&#x6CD5;&#x6240;&#x9700;&#x7684;&#x6240;&#x6709;&#x4FE1;&#x606F;&#xFF0C;&#x5E76;&#x4E14;&#x53C8;&#x7B80;&#x77ED;&#x53C8;&#x7B80;&#x5355;&#xFF0C;&#x5219;&#x8868;&#x660E;&#x8BE5;&#x65B9;&#x6CD5;&#x5177;&#x6709;&#x7B80;&#x5355;&#x7684;&#x63A5;&#x53E3;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x5197;&#x957F;&#x800C;&#x590D;&#x6742;&#x7684;&#x6CE8;&#x91CA;&#x65E0;&#x6CD5;&#x5B8C;&#x5168;&#x63CF;&#x8FF0;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#xFF0C;&#x5219;&#x8BE5;&#x65B9;&#x6CD5;&#x5177;&#x6709;&#x590D;&#x6742;&#x7684;&#x63A5;&#x53E3;&#x3002;&#x60A8;&#x53EF;&#x4EE5;&#x5C06;&#x65B9;&#x6CD5;&#x7684;&#x63A5;&#x53E3;&#x6CE8;&#x91CA;&#x4E0E;&#x5B9E;&#x73B0;&#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#xFF0C;&#x4EE5;&#x4E86;&#x89E3;&#x8BE5;&#x65B9;&#x6CD5;&#x7684;&#x6DF1;&#x5EA6;&#xFF1A;&#x5982;&#x679C;&#x63A5;&#x53E3;&#x6CE8;&#x91CA;&#x5FC5;&#x987B;&#x63CF;&#x8FF0;&#x5B9E;&#x73B0;&#x7684;&#x6240;&#x6709;&#x4E3B;&#x8981;&#x529F;&#x80FD;&#xFF0C;&#x5219;&#x8BE5;&#x65B9;&#x6CD5;&#x5F88;&#x6D45;&#x3002;&#x540C;&#x6837;&#x7684;&#x60F3;&#x6CD5;&#x4E5F;&#x9002;&#x7528;&#x4E8E;&#x53D8;&#x91CF;&#xFF1A;&#x5982;&#x679C;&#x8981;&#x82B1;&#x5F88;&#x957F;&#x7684;&#x65F6;&#x95F4;&#x6765;&#x5B8C;&#x6574;&#x63CF;&#x8FF0;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#xFF0C;&#x90A3;&#x662F;&#x4E00;&#x4E2A;&#x5371;&#x9669;&#x4FE1;&#x53F7;&#xFF0C;&#x8868;&#x660E;&#x60A8;&#x53EF;&#x80FD;&#x6CA1;&#x6709;&#x9009;&#x62E9;&#x6B63;&#x786E;&#x7684;&#x53D8;&#x91CF;&#x5206;&#x89E3;&#x3002;&#x603B;&#x4F53;&#x800C;&#x8A00;&#xFF0C;&#x7F16;&#x5199;&#x6CE8;&#x91CA;&#x7684;&#x884C;&#x4E3A;&#x4F7F;&#x60A8;&#x53EF;&#x4EE5;&#x53CA;&#x65E9;&#x8BC4;&#x4F30;&#x8BBE;&#x8BA1;&#x51B3;&#x7B56;&#xFF0C;&#x4EE5;&#x4FBF;&#x53D1;&#x73B0;&#x5E76;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x3002;</p>
</blockquote>
<p>img Red Flag: Hard to Describe img</p>
<p>The comment that describes a method or variable should be simple and yet complete. If you find it difficult to write such a comment, that&#x2019;s an indicator that there may be a problem with the design of the thing you are describing.</p>
<blockquote>
<p>&#x63CF;&#x8FF0;&#x65B9;&#x6CD5;&#x6216;&#x53D8;&#x91CF;&#x7684;&#x6CE8;&#x91CA;&#x5E94;&#x8BE5;&#x7B80;&#x5355;&#x800C;&#x5B8C;&#x6574;&#x3002;&#x5982;&#x679C;&#x60A8;&#x53D1;&#x73B0;&#x5F88;&#x96BE;&#x5199;&#x8FD9;&#x6837;&#x7684;&#x6CE8;&#x91CA;&#xFF0C;&#x5219;&#x8868;&#x660E;&#x60A8;&#x6240;&#x63CF;&#x8FF0;&#x7684;&#x5185;&#x5BB9;&#x7684;&#x8BBE;&#x8BA1;&#x53EF;&#x80FD;&#x5B58;&#x5728;&#x95EE;&#x9898;&#x3002;</p>
</blockquote>
<p>Of course, comments are only a good indicator of complexity if they are complete and clear. If you write a method interface comment that doesn&#x2019;t provide all the information needed to invoke the method, or one that is so cryptic that it&#x2019;s hard to understand, then that comment doesn&#x2019;t provide a good measure of the method&#x2019;s depth.</p>
<blockquote>
<p>&#x5F53;&#x7136;&#xFF0C;&#x5982;&#x679C;&#x6CE8;&#x91CA;&#x5B8C;&#x6574;&#x800C;&#x6E05;&#x6670;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x4EEC;&#x4EC5;&#x662F;&#x590D;&#x6742;&#x6027;&#x7684;&#x826F;&#x597D;&#x6307;&#x6807;&#x3002;&#x5982;&#x679C;&#x7F16;&#x5199;&#x7684;&#x65B9;&#x6CD5;&#x63A5;&#x53E3;&#x6CE8;&#x91CA;&#x672A;&#x63D0;&#x4F9B;&#x8C03;&#x7528;&#x8BE5;&#x65B9;&#x6CD5;&#x6240;&#x9700;&#x7684;&#x5168;&#x90E8;&#x4FE1;&#x606F;&#xFF0C;&#x6216;&#x8005;&#x7F16;&#x5199;&#x7684;&#x6CE8;&#x91CA;&#x8FC7;&#x4E8E;&#x795E;&#x79D8;&#x4EE5;&#x81F3;&#x4E8E;&#x96BE;&#x4EE5;&#x7406;&#x89E3;&#xFF0C;&#x5219;&#x8BE5;&#x6CE8;&#x91CA;&#x4E0D;&#x80FD;&#x5F88;&#x597D;&#x5730;&#x8861;&#x91CF;&#x8BE5;&#x65B9;&#x6CD5;&#x7684;&#x6DF1;&#x5EA6;&#x3002;</p>
</blockquote>
<h2 id="154-early-comments-are-fun-comments-&#x65E9;&#x671F;&#x6CE8;&#x91CA;&#x5F88;&#x6709;&#x8DA3;">15.4 Early comments are fun comments &#x65E9;&#x671F;&#x6CE8;&#x91CA;&#x5F88;&#x6709;&#x8DA3;</h2>
<p>The third and final benefit of writing comments early is that it makes comment-writing more fun. For me, one of the most enjoyable parts of programming is the early design phase for a new class, where I&#x2019;m fleshing out the abstractions and structure for the class. Most of my comments are written during this phase, and the comments are how I record and test the quality of my design decisions. I&#x2019;m looking for the design that can be expressed completely and clearly in the fewest words. The simpler the comments, the better I feel about my design, so finding simple comments is a source of pride. If you are programming strategically, where your main goal is a great design rather than just writing code that works, then writing comments should be fun, since that&#x2019;s how you identify the best designs.</p>
<blockquote>
<p>&#x5C3D;&#x65E9;&#x7F16;&#x5199;&#x6CE8;&#x91CA;&#x7684;&#x7B2C;&#x4E09;&#x4E2A;&#x4E5F;&#x662F;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x597D;&#x5904;&#x662F;&#xFF0C;&#x5B83;&#x4F7F;&#x7F16;&#x5199;&#x6CE8;&#x91CA;&#x66F4;&#x52A0;&#x6709;&#x8DA3;&#x3002;&#x5BF9;&#x6211;&#x6765;&#x8BF4;&#xFF0C;&#x7F16;&#x7A0B;&#x4E2D;&#x6700;&#x6709;&#x8DA3;&#x7684;&#x90E8;&#x5206;&#x4E4B;&#x4E00;&#x662F;&#x65B0;&#x7C7B;&#x7684;&#x65E9;&#x671F;&#x8BBE;&#x8BA1;&#x9636;&#x6BB5;&#xFF0C;&#x5728;&#x90A3;&#x91CC;&#xFF0C;&#x6211;&#x5C06;&#x5145;&#x5B9E;&#x8BE5;&#x7C7B;&#x7684;&#x62BD;&#x8C61;&#x548C;&#x7ED3;&#x6784;&#x3002;&#x6211;&#x7684;&#x5927;&#x90E8;&#x5206;&#x6CE8;&#x91CA;&#x90FD;&#x662F;&#x5728;&#x6B64;&#x9636;&#x6BB5;&#x7F16;&#x5199;&#x7684;&#xFF0C;&#x8FD9;&#x4E9B;&#x6CE8;&#x91CA;&#x662F;&#x6211;&#x8BB0;&#x5F55;&#x548C;&#x6D4B;&#x8BD5;&#x8BBE;&#x8BA1;&#x51B3;&#x7B56;&#x8D28;&#x91CF;&#x7684;&#x65B9;&#x5F0F;&#x3002;&#x6211;&#x6B63;&#x5728;&#x5BFB;&#x627E;&#x53EF;&#x4EE5;&#x7528;&#x6700;&#x5C11;&#x7684;&#x8BCD;&#x6765;&#x5B8C;&#x6574;&#x800C;&#x6E05;&#x6670;&#x5730;&#x8868;&#x8FBE;&#x7684;&#x8BBE;&#x8BA1;&#x3002;&#x6CE8;&#x91CA;&#x8D8A;&#x7B80;&#x5355;&#xFF0C;&#x6211;&#x5BF9;&#x8BBE;&#x8BA1;&#x7684;&#x611F;&#x89C9;&#x5C31;&#x8D8A;&#x597D;&#xFF0C;&#x56E0;&#x6B64;&#x627E;&#x5230;&#x7B80;&#x5355;&#x7684;&#x6CE8;&#x91CA;&#x662F;&#x4E00;&#x79CD;&#x81EA;&#x8C6A;&#x611F;&#x3002;&#x5982;&#x679C;&#x60A8;&#x662F;&#x7B56;&#x7565;&#x6027;&#x7F16;&#x7A0B;&#xFF0C;&#x800C;&#x60A8;&#x7684;&#x4E3B;&#x8981;&#x76EE;&#x6807;&#x662F;&#x4E00;&#x4E2A;&#x51FA;&#x8272;&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x800C;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x7F16;&#x5199;&#x6709;&#x6548;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x90A3;&#x4E48;&#x7F16;&#x5199;&#x6CE8;&#x91CA;&#x5E94;&#x8BE5;&#x5F88;&#x6709;&#x8DA3;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x662F;&#x60A8;&#x786E;&#x5B9A;&#x6700;&#x4F73;&#x8BBE;&#x8BA1;&#x7684;&#x65B9;&#x5F0F;&#x3002;</p>
</blockquote>
<h2 id="155-are-early-comments-expensive-&#x65E9;&#x671F;&#x6CE8;&#x91CA;&#x662F;&#x5426;&#x6602;&#x8D35;&#xFF1F;">15.5 Are early comments expensive? &#x65E9;&#x671F;&#x6CE8;&#x91CA;&#x662F;&#x5426;&#x6602;&#x8D35;&#xFF1F;</h2>
<p>Now let&#x2019;s revisit the argument for delaying comments, which is that it avoids the cost of reworking the comments as the code evolves. A simple back-of-the-envelope calculation will show that this doesn&#x2019;t save much. First, estimate the total fraction of development time that you spend typing in code and comments together, including time to revise code and comments; it&#x2019;s unlikely that this will be more than about 10% of all development time. Even if half of your total code lines are comments, writing comments probably doesn&#x2019;t account for more than about 5% of your total development time. Delaying the comments until the end will save only a fraction of this, which isn&#x2019;t very much.</p>
<blockquote>
<p>&#x73B0;&#x5728;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x91CD;&#x65B0;&#x8BA8;&#x8BBA;&#x5EF6;&#x8FDF;&#x6CE8;&#x91CA;&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x5B83;&#x907F;&#x514D;&#x4E86;&#x5728;&#x4EE3;&#x7801;&#x6F14;&#x53D8;&#x65F6;&#x91CD;&#x65B0;&#x5904;&#x7406;&#x6CE8;&#x91CA;&#x7684;&#x5F00;&#x9500;&#x3002;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x4FE1;&#x5C01;&#x8BA1;&#x7B97;&#x5C06;&#x663E;&#x793A;&#x8FD9;&#x5E76;&#x4E0D;&#x80FD;&#x8282;&#x7701;&#x5F88;&#x591A;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x4F30;&#x7B97;&#x60A8;&#x4E00;&#x8D77;&#x952E;&#x5165;&#x4EE3;&#x7801;&#x548C;&#x6CE8;&#x91CA;&#x6240;&#x82B1;&#x8D39;&#x7684;&#x5F00;&#x53D1;&#x65F6;&#x95F4;&#x7684;&#x603B;&#x548C;&#xFF0C;&#x5305;&#x62EC;&#x4FEE;&#x6539;&#x4EE3;&#x7801;&#x548C;&#x6CE8;&#x91CA;&#x7684;&#x65F6;&#x95F4;&#xFF1B;&#x8FD9;&#x4E0D;&#x592A;&#x53EF;&#x80FD;&#x8D85;&#x8FC7;&#x6240;&#x6709;&#x5F00;&#x53D1;&#x65F6;&#x95F4;&#x7684; 10&#xFF05;&#x3002;&#x5373;&#x4F7F;&#x60A8;&#x7684;&#x5168;&#x90E8;&#x4EE3;&#x7801;&#x884C;&#x4E2D;&#x6709;&#x4E00;&#x534A;&#x662F;&#x6CE8;&#x91CA;&#xFF0C;&#x7F16;&#x5199;&#x6CE8;&#x91CA;&#x4E5F;&#x53EF;&#x80FD;&#x4E0D;&#x4F1A;&#x5360;&#x5F00;&#x53D1;&#x603B;&#x65F6;&#x95F4;&#x7684; 5&#xFF05;&#x4EE5;&#x4E0A;&#x3002;&#x5C06;&#x6CE8;&#x91CA;&#x5EF6;&#x8FDF;&#x5230;&#x6700;&#x540E;&#x53EA;&#x4F1A;&#x8282;&#x7701;&#x5176;&#x4E2D;&#x7684;&#x4E00;&#x5C0F;&#x90E8;&#x5206;&#xFF0C;&#x8FD9;&#x4E0D;&#x662F;&#x5F88;&#x591A;&#x3002;</p>
</blockquote>
<p>Writing the comments first will mean that the abstractions will be more stable before you start writing code. This will probably save time during coding. In contrast, if you write the code first, the abstractions will probably evolve as you code, which will require more code revisions than the comments-first approach. When you consider all of these factors, it&#x2019;s possible that it might be faster overall to write the comments first.</p>
<blockquote>
<p>&#x9996;&#x5148;&#x7F16;&#x5199;&#x6CE8;&#x91CA;&#x5C06;&#x610F;&#x5473;&#x7740;&#x5728;&#x5F00;&#x59CB;&#x7F16;&#x5199;&#x4EE3;&#x7801;&#x4E4B;&#x524D;&#xFF0C;&#x62BD;&#x8C61;&#x5C06;&#x66F4;&#x52A0;&#x7A33;&#x5B9A;&#x3002;&#x8FD9;&#x53EF;&#x80FD;&#x4F1A;&#x8282;&#x7701;&#x7F16;&#x7801;&#x65F6;&#x95F4;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x5982;&#x679C;&#x60A8;&#x9996;&#x5148;&#x7F16;&#x5199;&#x4EE3;&#x7801;&#xFF0C;&#x5219;&#x62BD;&#x8C61;&#x53EF;&#x80FD;&#x4F1A;&#x968F;&#x4EE3;&#x7801;&#x7684;&#x53D1;&#x5C55;&#x800C;&#x53D8;&#x5316;&#xFF0C;&#x4E0E;&#x6CE8;&#x91CA;&#x4F18;&#x5148;&#x65B9;&#x6CD5;&#x76F8;&#x6BD4;&#xFF0C;&#x5C06;&#x9700;&#x8981;&#x66F4;&#x591A;&#x7684;&#x4EE3;&#x7801;&#x4FEE;&#x8BA2;&#x3002;&#x5F53;&#x60A8;&#x8003;&#x8651;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x56E0;&#x7D20;&#x65F6;&#xFF0C;&#x53EF;&#x80FD;&#x9996;&#x5148;&#x6574;&#x4F53;&#x7F16;&#x5199;&#x6CE8;&#x91CA;&#x53EF;&#x80FD;&#x4F1A;&#x66F4;&#x5FEB;&#x3002;</p>
</blockquote>
<h2 id="156-conclusion-&#x7ED3;&#x8BBA;">15.6 Conclusion &#x7ED3;&#x8BBA;</h2>
<p>If you haven&#x2019;t ever tried writing the comments first, give it a try. Stick with it long enough to get used to it. Then think about how it affects the quality of your comments, the quality of your design, and your overall enjoyment of software development. After you have tried this for a while, let me know whether your experience matches mine, and why or why not.</p>
<blockquote>
<p>&#x5982;&#x679C;&#x60A8;&#x4ECE;&#x672A;&#x5C1D;&#x8BD5;&#x8FC7;&#x5148;&#x7F16;&#x5199;&#x6CE8;&#x91CA;&#xFF0C;&#x8BF7;&#x5C1D;&#x8BD5;&#x4E00;&#x4E0B;&#x3002;&#x575A;&#x6301;&#x8DB3;&#x591F;&#x957F;&#x7684;&#x65F6;&#x95F4;&#x6765;&#x4E60;&#x60EF;&#x5B83;&#x3002;&#x7136;&#x540E;&#x8003;&#x8651;&#x5B83;&#x5982;&#x4F55;&#x5F71;&#x54CD;&#x60A8;&#x7684;&#x6CE8;&#x91CA;&#x8D28;&#x91CF;&#xFF0C;&#x8BBE;&#x8BA1;&#x8D28;&#x91CF;&#x4EE5;&#x53CA;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x7684;&#x6574;&#x4F53;&#x4E50;&#x8DA3;&#x3002;&#x5728;&#x5C1D;&#x8BD5;&#x4E86;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x4E4B;&#x540E;&#xFF0C;&#x8BA9;&#x6211;&#x77E5;&#x9053;&#x60A8;&#x7684;&#x7ECF;&#x5386;&#x662F;&#x5426;&#x4E0E;&#x6211;&#x7684;&#x76F8;&#x7B26;&#xFF0C;&#x4EE5;&#x53CA;&#x4E3A;&#x4EC0;&#x4E48;&#x6216;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x8FD9;&#x6837;&#x3002;</p>
</blockquote>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="ch14.html" class="navigation navigation-prev " aria-label="Previous page: 第十四章: 选择的名字">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="ch16.html" class="navigation navigation-next " aria-label="Next page: 第十六章: 修改现有的代码">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第十五章: 先写注释","level":"1.18","depth":1,"next":{"title":"第十六章: 修改现有的代码","level":"1.19","depth":1,"path":"docs/ch16.md","ref":"./docs/ch16.md","articles":[]},"previous":{"title":"第十四章: 选择的名字","level":"1.17","depth":1,"path":"docs/ch14.md","ref":"./docs/ch14.md","articles":[]},"dir":"ltr"},"config":{"plugins":["back-to-top-button","expandable-chapters-small","page-toc-button","livereload"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"livereload":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"page-toc-button":{},"back-to-top-button":{},"expandable-chapters-small":{},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"John Ousterhout","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"软件设计哲学","language":"zh-hans","gitbook":"*","description":"书中讨论了软件设计的主题：如何将复杂的软件系统分解成可以相对独立实现的模块(如类和方法)"},"file":{"path":"docs/ch15.md","mtime":"2020-08-06T16:26:19.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-02-06T04:55:41.669Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-page-toc-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

