
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第十六章: 修改现有的代码 · 软件设计哲学</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="John Ousterhout">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-page-toc-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="ch17.html" />
    
    
    <link rel="prev" href="ch15.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    首页
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="preface">
            
                <span>
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="ch1.html">
            
                <a href="ch1.html">
            
                    
                    第一章：介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="ch2.html">
            
                <a href="ch2.html">
            
                    
                    第二章：复杂性的本质
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="ch3.html">
            
                <a href="ch3.html">
            
                    
                    第三章：工作代码是不够的（战略与战术编程）
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="ch4.html">
            
                <a href="ch4.html">
            
                    
                    第四章：模块应该是深的
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="ch5.html">
            
                <a href="ch5.html">
            
                    
                    第五章：信息隐藏(和泄露)
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="ch6.html">
            
                <a href="ch6.html">
            
                    
                    第六章：通用模块更深入
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="ch7.html">
            
                <a href="ch7.html">
            
                    
                    第七章: 不同的层，不同的抽象
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="ch8.html">
            
                <a href="ch8.html">
            
                    
                    第八章: 降低复杂性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="ch9.html">
            
                <a href="ch9.html">
            
                    
                    第九章: 在一起更好还是分开更好？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="ch10.html">
            
                <a href="ch10.html">
            
                    
                    第十章: 定义不存在的错误
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="ch11.html">
            
                <a href="ch11.html">
            
                    
                    第十一章: 设计它两次
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="ch12.html">
            
                <a href="ch12.html">
            
                    
                    第十二章: 为什么写注释？四个理由
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="ch13.html">
            
                <a href="ch13.html">
            
                    
                    第十三章: 注释应该描述代码中不明显的内容
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="ch14.html">
            
                <a href="ch14.html">
            
                    
                    第十四章: 选择的名字
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="ch15.html">
            
                <a href="ch15.html">
            
                    
                    第十五章: 先写注释
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.19" data-path="ch16.html">
            
                <a href="ch16.html">
            
                    
                    第十六章: 修改现有的代码
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.20" data-path="ch17.html">
            
                <a href="ch17.html">
            
                    
                    第十七章: 一致性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.21" data-path="ch18.html">
            
                <a href="ch18.html">
            
                    
                    第十八章: 代码应该是显而易见的
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.22" data-path="ch19.html">
            
                <a href="ch19.html">
            
                    
                    第十九章: 软件发展趋势
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.23" data-path="ch20.html">
            
                <a href="ch20.html">
            
                    
                    第二十章: 设计性能
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.24" data-path="ch21.html">
            
                <a href="ch21.html">
            
                    
                    第二十一章: 结论
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.25" data-path="summary.html">
            
                <a href="summary.html">
            
                    
                    总结
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >第十六章: 修改现有的代码</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7B2C;-16-&#x7AE0;-&#x4FEE;&#x6539;&#x73B0;&#x6709;&#x7684;&#x4EE3;&#x7801;">&#x7B2C; 16 &#x7AE0; &#x4FEE;&#x6539;&#x73B0;&#x6709;&#x7684;&#x4EE3;&#x7801;</h1>
<blockquote>
<p>Chapter 16 Modifying Existing Code</p>
</blockquote>
<p>Chapter 1 described how software development is iterative and incremental. A large software system develops through a series of evolutionary stages, where each stage adds new capabilities and modifies existing modules. This means that a system&#x2019;s design is constantly evolving. It isn&#x2019;t possible to conceive the right design for a system at the outset; the design of a mature system is determined more by changes made during the system&#x2019;s evolution than by any initial conception. Previous chapters described how to squeeze out complexity during the initial design and implementation; this chapter discusses how to keep complexity from creeping in as the system evolves.</p>
<blockquote>
<p>&#x7B2C; 1 &#x7AE0;&#x4ECB;&#x7ECD;&#x4E86;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x662F;&#x5982;&#x4F55;&#x8FED;&#x4EE3;&#x548C;&#x589E;&#x91CF;&#x7684;&#x3002;&#x5927;&#x578B;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x662F;&#x901A;&#x8FC7;&#x4E00;&#x7CFB;&#x5217;&#x6F14;&#x5316;&#x9636;&#x6BB5;&#x5F00;&#x53D1;&#x7684;&#xFF0C;&#x5176;&#x4E2D;&#x6BCF;&#x4E2A;&#x9636;&#x6BB5;&#x90FD;&#x6DFB;&#x52A0;&#x4E86;&#x65B0;&#x529F;&#x80FD;&#x5E76;&#x4FEE;&#x6539;&#x4E86;&#x73B0;&#x6709;&#x6A21;&#x5757;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x7CFB;&#x7EDF;&#x7684;&#x8BBE;&#x8BA1;&#x5728;&#x4E0D;&#x65AD;&#x53D1;&#x5C55;&#x3002;&#x4E00;&#x5F00;&#x59CB;&#x5C31;&#x4E0D;&#x53EF;&#x80FD;&#x4E3A;&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;&#x6B63;&#x786E;&#x7684;&#x8BBE;&#x8BA1;&#x3002;&#x4E00;&#x4E2A;&#x6210;&#x719F;&#x7684;&#x7CFB;&#x7EDF;&#x7684;&#x8BBE;&#x8BA1;&#x66F4;&#x591A;&#x5730;&#x53D6;&#x51B3;&#x4E8E;&#x7CFB;&#x7EDF;&#x6F14;&#x5316;&#x8FC7;&#x7A0B;&#x4E2D;&#x6240;&#x505A;&#x7684;&#x66F4;&#x6539;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4EFB;&#x4F55;&#x521D;&#x59CB;&#x6982;&#x5FF5;&#x3002;&#x524D;&#x9762;&#x7684;&#x7AE0;&#x8282;&#x63CF;&#x8FF0;&#x4E86;&#x5982;&#x4F55;&#x5728;&#x521D;&#x59CB;&#x8BBE;&#x8BA1;&#x548C;&#x5B9E;&#x73B0;&#x8FC7;&#x7A0B;&#x4E2D;&#x964D;&#x4F4E;&#x590D;&#x6742;&#x6027;&#x3002;&#x672C;&#x7AE0;&#x8BA8;&#x8BBA;&#x5982;&#x4F55;&#x9632;&#x6B62;&#x968F;&#x7740;&#x7CFB;&#x7EDF;&#x7684;&#x53D1;&#x5C55;&#x800C;&#x589E;&#x52A0;&#x590D;&#x6742;&#x6027;&#x3002;</p>
</blockquote>
<h2 id="161-stay-strategic-&#x4FDD;&#x6301;&#x6218;&#x7565;">16.1 Stay strategic &#x4FDD;&#x6301;&#x6218;&#x7565;</h2>
<p>Chapter 3 introduced the distinction between tactical programming and strategic programming: in tactical programming, the primary goal is to get something working quickly, even if that results in additional complexity; in strategic programming, the most important goal is to produce a great system design. The tactical approach very quickly leads to a messy system design. If you want to have a system that is easy to maintain and enhance, then &#x201C;working&#x201D; isn&#x2019;t a high enough standard; you have to prioritize design and think strategically. This idea also applies when you are modifying existing code.</p>
<blockquote>
<p>&#x7B2C; 3 &#x7AE0;&#x4ECB;&#x7ECD;&#x4E86;&#x6218;&#x672F;&#x7F16;&#x7A0B;&#x548C;&#x6218;&#x7565;&#x7F16;&#x7A0B;&#x4E4B;&#x95F4;&#x7684;&#x533A;&#x522B;&#xFF1A;&#x5728;&#x6218;&#x672F;&#x7F16;&#x7A0B;&#x4E2D;&#xFF0C;&#x4E3B;&#x8981;&#x76EE;&#x6807;&#x662F;&#x4F7F;&#x67D0;&#x4E9B;&#x4E8B;&#x7269;&#x5FEB;&#x901F;&#x5DE5;&#x4F5C;&#xFF0C;&#x5373;&#x4F7F;&#x8FD9;&#x4F1A;&#x5BFC;&#x81F4;&#x989D;&#x5916;&#x7684;&#x590D;&#x6742;&#x6027;&#xFF1B;&#x5728;&#x6218;&#x7565;&#x7F16;&#x7A0B;&#x4E2D;&#xFF0C;&#x6700;&#x91CD;&#x8981;&#x7684;&#x76EE;&#x6807;&#x662F;&#x8FDB;&#x884C;&#x51FA;&#x8272;&#x7684;&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;&#x3002;&#x6218;&#x672F;&#x65B9;&#x6CD5;&#x5F88;&#x5FEB;&#x5BFC;&#x81F4;&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;&#x6DF7;&#x4E71;&#x3002;&#x5982;&#x679C;&#x60A8;&#x60F3;&#x8981;&#x4E00;&#x4E2A;&#x6613;&#x4E8E;&#x7EF4;&#x62A4;&#x548C;&#x589E;&#x5F3A;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x90A3;&#x4E48;&#x201C;&#x5DE5;&#x4F5C;&#x201D;&#x8FD8;&#x4E0D;&#x591F;&#x9AD8;&#x3002;&#x60A8;&#x5FC5;&#x987B;&#x4F18;&#x5148;&#x8003;&#x8651;&#x8BBE;&#x8BA1;&#x5E76;&#x8FDB;&#x884C;&#x6218;&#x7565;&#x601D;&#x8003;&#x3002;&#x5F53;&#x60A8;&#x4FEE;&#x6539;&#x73B0;&#x6709;&#x4EE3;&#x7801;&#x65F6;&#xFF0C;&#x6B64;&#x60F3;&#x6CD5;&#x4E5F;&#x9002;&#x7528;&#x3002;</p>
</blockquote>
<p>Unfortunately, when developers go into existing code to make changes such as bug fixes or new features, they don&#x2019;t usually think strategically. A typical mindset is &#x201C;what is the smallest possible change I can make that does what I need?&#x201D; Sometimes developers justify this because they are not comfortable with the code being modified; they worry that larger changes carry a greater risk of introducing new bugs. However, this results in tactical programming. Each one of these minimal changes introduces a few special cases, dependencies, or other forms of complexity. As a result, the system design gets just a bit worse, and the problems accumulate with each step in the system&#x2019;s evolution.</p>
<blockquote>
<p>&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x5F53;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x8FDB;&#x5165;&#x73B0;&#x6709;&#x4EE3;&#x7801;&#x4EE5;&#x8FDB;&#x884C;&#x66F4;&#x6539;&#xFF08;&#x4F8B;&#x5982;&#x9519;&#x8BEF;&#x4FEE;&#x590D;&#x6216;&#x65B0;&#x529F;&#x80FD;&#xFF09;&#x65F6;&#xFF0C;&#x4ED6;&#x4EEC;&#x901A;&#x5E38;&#x4E0D;&#x4F1A;&#x4ECE;&#x6218;&#x7565;&#x89D2;&#x5EA6;&#x8FDB;&#x884C;&#x601D;&#x8003;&#x3002;&#x4E00;&#x4E2A;&#x5178;&#x578B;&#x7684;&#x5FC3;&#x6001;&#x662F;&#x201C;&#x6211;&#x80FD;&#x505A;&#x51FA;&#x6211;&#x9700;&#x8981;&#x505A;&#x7684;&#x6700;&#x5C0F;&#x7684;&#x6539;&#x53D8;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x201D; &#x6709;&#x65F6;&#xFF0C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x8BC1;&#x660E;&#x8FD9;&#x662F;&#x5408;&#x7406;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x5BF9;&#x4FEE;&#x6539;&#x7684;&#x4EE3;&#x7801;&#x4E0D;&#x6EE1;&#x610F;&#x3002;&#x4ED6;&#x4EEC;&#x62C5;&#x5FC3;&#x8F83;&#x5927;&#x7684;&#x66F4;&#x6539;&#x4F1A;&#x5E26;&#x6765;&#x66F4;&#x5927;&#x7684;&#x5F15;&#x5165;&#x65B0;&#x9519;&#x8BEF;&#x7684;&#x98CE;&#x9669;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x8FD9;&#x5BFC;&#x81F4;&#x4E86;&#x6218;&#x672F;&#x7F16;&#x7A0B;&#x3002;&#x8FD9;&#x4E9B;&#x6700;&#x5C0F;&#x7684;&#x53D8;&#x5316;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x90FD;&#x4F1A;&#x5F15;&#x5165;&#x4E00;&#x4E9B;&#x7279;&#x6B8A;&#x60C5;&#x51B5;&#xFF0C;&#x4F9D;&#x8D56;&#x6027;&#x6216;&#x5176;&#x4ED6;&#x5F62;&#x5F0F;&#x7684;&#x590D;&#x6742;&#x6027;&#x3002;&#x7ED3;&#x679C;&#xFF0C;&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;&#x53D8;&#x5F97;&#x66F4;&#x7CDF;&#xFF0C;&#x5E76;&#x4E14;&#x95EE;&#x9898;&#x968F;&#x7740;&#x7CFB;&#x7EDF;&#x53D1;&#x5C55;&#x7684;&#x6BCF;&#x4E2A;&#x6B65;&#x9AA4;&#x800C;&#x7D2F;&#x79EF;&#x3002;</p>
</blockquote>
<p>If you want to maintain a clean design for a system, you must take a strategic approach when modifying existing code. Ideally, when you have finished with each change, the system will have the structure it would have had if you had designed it from the start with that change in mind. To achieve this goal, you must resist the temptation to make a quick fix. Instead, think about whether the current system design is still the best one, in light of the desired change. If not, refactor the system so that you end up with the best possible design. With this approach, the system design improves with every modification.</p>
<blockquote>
<p>&#x5982;&#x679C;&#x8981;&#x7EF4;&#x62A4;&#x7CFB;&#x7EDF;&#x7684;&#x7B80;&#x6D01;&#x8BBE;&#x8BA1;&#xFF0C;&#x5219;&#x5728;&#x4FEE;&#x6539;&#x73B0;&#x6709;&#x4EE3;&#x7801;&#x65F6;&#x5FC5;&#x987B;&#x91C7;&#x53D6;&#x6218;&#x7565;&#x6027;&#x65B9;&#x6CD5;&#x3002;&#x7406;&#x60F3;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5F53;&#x60A8;&#x5B8C;&#x6210;&#x6BCF;&#x6B21;&#x66F4;&#x6539;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x60A8;&#x4ECE;&#x4E00;&#x5F00;&#x59CB;&#x5C31;&#x8003;&#x8651;&#x5230;&#x66F4;&#x6539;&#x5C31;&#x8BBE;&#x8BA1;&#x4E86;&#x7CFB;&#x7EDF;&#xFF0C;&#x90A3;&#x4E48;&#x7CFB;&#x7EDF;&#x5C06;&#x5177;&#x6709;&#x5B83;&#x5E94;&#x8BE5;&#x5177;&#x6709;&#x7684;&#x7ED3;&#x6784;&#x3002;&#x4E3A;&#x4E86;&#x5B9E;&#x73B0;&#x6B64;&#x76EE;&#x6807;&#xFF0C;&#x60A8;&#x5FC5;&#x987B;&#x62B5;&#x5236;&#x8BF1;&#x60D1;&#x4EE5;&#x5FEB;&#x901F;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x8BF7;&#x6839;&#x636E;&#x6240;&#x9700;&#x7684;&#x66F4;&#x6539;&#x6765;&#x8003;&#x8651;&#x5F53;&#x524D;&#x7684;&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;&#x662F;&#x5426;&#x4ECD;&#x7136;&#x662F;&#x6700;&#x4F73;&#x7684;&#x3002;&#x5982;&#x679C;&#x4E0D;&#x662F;&#xFF0C;&#x8BF7;&#x91CD;&#x6784;&#x7CFB;&#x7EDF;&#xFF0C;&#x4EE5;&#x4FBF;&#x6700;&#x7EC8;&#x83B7;&#x5F97;&#x6700;&#x4F73;&#x8BBE;&#x8BA1;&#x3002;&#x901A;&#x8FC7;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#xFF0C;&#x6BCF;&#x6B21;&#x4FEE;&#x6539;&#x90FD;&#x4F1A;&#x6539;&#x5584;&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;&#x3002;</p>
</blockquote>
<p>This is also an example of the investment mindset introduced on page 15: if you invest a little extra time to refactor and improve the system design, you&#x2019;ll end up with a cleaner system. This will speed up development, and you will recoup the effort that you invested in the refactoring. Even if your particular change doesn&#x2019;t require refactoring, you should still be on the lookout for design imperfections that you can fix while you&#x2019;re in the code. Whenever you modify any code, try to find a way to improve the system design at least a little bit in the process. If you&#x2019;re not making the design better, you are probably making it worse.</p>
<blockquote>
<p>&#x8FD9;&#x4E5F;&#x662F;&#x7B2C; 15 &#x9875;&#x4ECB;&#x7ECD;&#x7684;&#x6295;&#x8D44;&#x5FC3;&#x6001;&#x7684;&#x4E00;&#x4E2A;&#x793A;&#x4F8B;&#xFF1A;&#x5982;&#x679C;&#x60A8;&#x82B1;&#x8D39;&#x4E00;&#x4E9B;&#x989D;&#x5916;&#x7684;&#x65F6;&#x95F4;&#x6765;&#x91CD;&#x6784;&#x548C;&#x6539;&#x5584;&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;&#xFF0C;&#x60A8;&#x5C06;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x66F4;&#x5E72;&#x51C0;&#x7684;&#x7CFB;&#x7EDF;&#x3002;&#x8FD9;&#x5C06;&#x52A0;&#x5FEB;&#x5F00;&#x53D1;&#x901F;&#x5EA6;&#xFF0C;&#x60A8;&#x5C06;&#x6536;&#x56DE;&#x5728;&#x91CD;&#x6784;&#x65B9;&#x9762;&#x6295;&#x5165;&#x7684;&#x7CBE;&#x529B;&#x3002;&#x5373;&#x4F7F;&#x60A8;&#x7684;&#x7279;&#x5B9A;&#x66F4;&#x6539;&#x4E0D;&#x9700;&#x8981;&#x91CD;&#x6784;&#xFF0C;&#x60A8;&#x4ECD;&#x7136;&#x5E94;&#x8BE5;&#x6CE8;&#x610F;&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#x53EF;&#x4EE5;&#x4FEE;&#x590D;&#x7684;&#x8BBE;&#x8BA1;&#x7F3A;&#x9677;&#x3002;&#x6BCF;&#x5F53;&#x60A8;&#x4FEE;&#x6539;&#x4EFB;&#x4F55;&#x4EE3;&#x7801;&#x65F6;&#xFF0C;&#x90FD;&#x5C1D;&#x8BD5;&#x5728;&#x8BE5;&#x8FC7;&#x7A0B;&#x4E2D;&#x81F3;&#x5C11;&#x627E;&#x5230;&#x4E00;&#x70B9;&#x65B9;&#x6CD5;&#x6765;&#x6539;&#x8FDB;&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;&#x3002;&#x5982;&#x679C;&#x60A8;&#x6CA1;&#x6709;&#x4F7F;&#x8BBE;&#x8BA1;&#x66F4;&#x597D;&#xFF0C;&#x5219;&#x53EF;&#x80FD;&#x4F1A;&#x4F7F;&#x5B83;&#x53D8;&#x5F97;&#x66F4;&#x7CDF;&#x3002;</p>
</blockquote>
<p>As discussed in Chapter 3, an investment mindset sometimes conflicts with the realities of commercial software development. If refactoring the system &#x201C;the right way&#x201D; would take three months but a quick and dirty fix would take only two hours, you may have to take the quick and dirty approach, particularly if you are working against a tight deadline. Or, if refactoring the system would create incompatibilities that affect many other people and teams, then the refactoring may not be practical.</p>
<blockquote>
<p>&#x5982;&#x7B2C; 3 &#x7AE0;&#x6240;&#x8FF0;&#xFF0C;&#x6295;&#x8D44;&#x5FC3;&#x6001;&#x6709;&#x65F6;&#x4E0E;&#x5546;&#x4E1A;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x7684;&#x73B0;&#x5B9E;&#x76F8;&#x51B2;&#x7A81;&#x3002;&#x5982;&#x679C;&#x201C;&#x6B63;&#x786E;&#x7684;&#x65B9;&#x5F0F;&#x201D;&#x91CD;&#x6784;&#x7CFB;&#x7EDF;&#x9700;&#x8981;&#x4E09;&#x4E2A;&#x6708;&#xFF0C;&#x800C;&#x5FEB;&#x901F;&#x4E14;&#x80AE;&#x810F;&#x7684;&#x4FEE;&#x590D;&#x4EC5;&#x9700;&#x4E24;&#x4E2A;&#x5C0F;&#x65F6;&#xFF0C;&#x5219;&#x60A8;&#x53EF;&#x80FD;&#x5FC5;&#x987B;&#x91C7;&#x53D6;&#x5FEB;&#x901F;&#x800C;&#x80AE;&#x810F;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x5728;&#x7D27;&#x8FEB;&#x7684;&#x671F;&#x9650;&#x5185;&#x5DE5;&#x4F5C;&#x65F6;&#x3002;&#x6216;&#x8005;&#xFF0C;&#x5982;&#x679C;&#x91CD;&#x6784;&#x7CFB;&#x7EDF;&#x4F1A;&#x9020;&#x6210;&#x5F71;&#x54CD;&#x8BB8;&#x591A;&#x5176;&#x4ED6;&#x4EBA;&#x5458;&#x548C;&#x56E2;&#x961F;&#x7684;&#x4E0D;&#x517C;&#x5BB9;&#x6027;&#xFF0C;&#x5219;&#x91CD;&#x6784;&#x53EF;&#x80FD;&#x4E0D;&#x5207;&#x5B9E;&#x9645;&#x3002;</p>
</blockquote>
<p>Nonetheless, you should resist these compromises as much as possible. Ask yourself &#x201C;Is this the best I can possibly do to create a clean system design, given my current constraints?&#x201D; Perhaps there&#x2019;s an alternative approach that would be almost as clean as the 3-month refactoring but could be done in a couple of days? Or, if you can&#x2019;t afford to do a large refactoring now, get your boss to allocate time for you to come back to it after the current deadline. Every development organization should plan to spend a small fraction of its total effort on cleanup and refactoring; this work will pay for itself over the long run.</p>
<blockquote>
<p>&#x4F46;&#x662F;&#xFF0C;&#x60A8;&#x5E94;&#x5C3D;&#x53EF;&#x80FD;&#x62B5;&#x5236;&#x8FD9;&#x4E9B;&#x59A5;&#x534F;&#x3002;&#x95EE;&#x95EE;&#x81EA;&#x5DF1;&#xFF1A;&#x201C;&#x8003;&#x8651;&#x5230;&#x6211;&#x76EE;&#x524D;&#x7684;&#x9650;&#x5236;&#xFF0C;&#x8FD9;&#x662F;&#x5426;&#x662F;&#x6211;&#x80FD;&#x505A;&#x7684;&#x6700;&#x597D;&#x7684;&#x5DE5;&#x4F5C;&#x6765;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5E72;&#x51C0;&#x7684;&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;&#xFF1F;&#x201D; &#x4E5F;&#x8BB8;&#x6709;&#x4E00;&#x79CD;&#x66FF;&#x4EE3;&#x65B9;&#x6CD5;&#x51E0;&#x4E4E;&#x53EF;&#x4EE5;&#x50CF; 3 &#x4E2A;&#x6708;&#x7684;&#x91CD;&#x6784;&#x4E00;&#x6837;&#x5E72;&#x51C0;&#xFF0C;&#x4F46;&#x662F;&#x53EF;&#x4EE5;&#x5728;&#x51E0;&#x5929;&#x5185;&#x5B8C;&#x6210;&#xFF1F;&#x6216;&#x8005;&#xFF0C;&#x5982;&#x679C;&#x60A8;&#x73B0;&#x5728;&#x8D1F;&#x62C5;&#x4E0D;&#x8D77;&#x5927;&#x578B;&#x91CD;&#x6784;&#xFF0C;&#x8BF7;&#x8BA9;&#x60A8;&#x7684;&#x8001;&#x677F;&#x4E3A;&#x60A8;&#x5206;&#x914D;&#x65F6;&#x95F4;&#xFF0C;&#x8BA9;&#x60A8;&#x5728;&#x5F53;&#x524D;&#x622A;&#x6B62;&#x65E5;&#x671F;&#x4E4B;&#x540E;&#x6062;&#x590D;&#x5230;&#x539F;&#x6765;&#x7684;&#x6C34;&#x5E73;&#x3002;&#x6BCF;&#x4E2A;&#x5F00;&#x53D1;&#x7EC4;&#x7EC7;&#x90FD;&#x5E94;&#x8BA1;&#x5212;&#x5C06;&#x5176;&#x5168;&#x90E8;&#x5DE5;&#x4F5C;&#x7684;&#x4E00;&#x5C0F;&#x90E8;&#x5206;&#x7528;&#x4E8E;&#x6E05;&#x7406;&#x548C;&#x91CD;&#x6784;&#xFF1B;&#x4ECE;&#x957F;&#x8FDC;&#x6765;&#x770B;&#xFF0C;&#x8FD9;&#x9879;&#x5DE5;&#x4F5C;&#x5C06;&#x6536;&#x56DE;&#x6210;&#x672C;&#x3002;</p>
</blockquote>
<h2 id="162-maintaining-comments-keep-the-comments-near-the-code-&#x7EF4;&#x62A4;&#x6CE8;&#x91CA;&#xFF1A;&#x5C06;&#x6CE8;&#x91CA;&#x4FDD;&#x7559;&#x5728;&#x4EE3;&#x7801;&#x9644;&#x8FD1;">16.2 Maintaining comments: keep the comments near the code &#x7EF4;&#x62A4;&#x6CE8;&#x91CA;&#xFF1A;&#x5C06;&#x6CE8;&#x91CA;&#x4FDD;&#x7559;&#x5728;&#x4EE3;&#x7801;&#x9644;&#x8FD1;</h2>
<p>When you change existing code, there&#x2019;s a good chance that the changes will invalidate some of the existing comments. It&#x2019;s easy to forget to update comments when you modify code, which results in comments that are no longer accurate. Inaccurate comments are frustrating to readers, and if there are very many of them, readers begin to distrust all of the comments. Fortunately, with a little discipline and a couple of guiding rules, it&#x2019;s possible to keep comments up-to-date without a huge effort. This section and the following ones put forth some specific techniques.</p>
<blockquote>
<p>&#x5F53;&#x60A8;&#x66F4;&#x6539;&#x73B0;&#x6709;&#x4EE3;&#x7801;&#x65F6;&#xFF0C;&#x66F4;&#x6539;&#x5F88;&#x6709;&#x53EF;&#x80FD;&#x4F1A;&#x4F7F;&#x67D0;&#x4E9B;&#x73B0;&#x6709;&#x6CE8;&#x91CA;&#x65E0;&#x6548;&#x3002;&#x4FEE;&#x6539;&#x4EE3;&#x7801;&#x65F6;&#xFF0C;&#x5F88;&#x5BB9;&#x6613;&#x5FD8;&#x8BB0;&#x66F4;&#x65B0;&#x6CE8;&#x91CA;&#xFF0C;&#x4ECE;&#x800C;&#x5BFC;&#x81F4;&#x6CE8;&#x91CA;&#x4E0D;&#x518D;&#x51C6;&#x786E;&#x3002;&#x4E0D;&#x51C6;&#x786E;&#x7684;&#x8BC4;&#x8BBA;&#x4F7F;&#x8BFB;&#x8005;&#x611F;&#x5230;&#x6CAE;&#x4E27;&#xFF0C;&#x5982;&#x679C;&#x8BC4;&#x8BBA;&#x592A;&#x591A;&#xFF0C;&#x8BFB;&#x8005;&#x5C31;&#x4F1A;&#x5F00;&#x59CB;&#x4E0D;&#x4FE1;&#x4EFB;&#x6240;&#x6709;&#x8BC4;&#x8BBA;&#x3002;&#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;&#x53EA;&#x8981;&#x6709;&#x4E00;&#x70B9;&#x7EAA;&#x5F8B;&#x548C;&#x4E00;&#x4E9B;&#x6307;&#x5BFC;&#x89C4;&#x5219;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x4ED8;&#x51FA;&#x5DE8;&#x5927;&#x52AA;&#x529B;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x4F7F;&#x8BC4;&#x8BBA;&#x4FDD;&#x6301;&#x6700;&#x65B0;&#x3002;&#x672C;&#x8282;&#x53CA;&#x968F;&#x540E;&#x7684;&#x90E8;&#x5206;&#x63D0;&#x51FA;&#x4E86;&#x4E00;&#x4E9B;&#x7279;&#x5B9A;&#x7684;&#x6280;&#x672F;&#x3002;</p>
</blockquote>
<p>The best way to ensure that comments get updated is to position them close to the code they describe, so developers will see them when they change the code. The farther a comment is from its associated code, the less likely it is that it will be updated properly. For example, the best place for a method&#x2019;s interface comment is in the code file, right next to the body of the method. Any changes to the method will involve this code, so the developer is likely to see the interface comments and update them if needed.</p>
<blockquote>
<p>&#x786E;&#x4FDD;&#x6CE8;&#x91CA;&#x66F4;&#x65B0;&#x7684;&#x6700;&#x4F73;&#x65B9;&#x6CD5;&#x662F;&#x5C06;&#x6CE8;&#x91CA;&#x653E;&#x7F6E;&#x5728;&#x5B83;&#x4EEC;&#x63CF;&#x8FF0;&#x7684;&#x4EE3;&#x7801;&#x9644;&#x8FD1;&#xFF0C;&#x4EE5;&#x4FBF;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5728;&#x66F4;&#x6539;&#x4EE3;&#x7801;&#x65F6;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x5B83;&#x4EEC;&#x3002;&#x6CE8;&#x91CA;&#x79BB;&#x5176;&#x5173;&#x8054;&#x7684;&#x4EE3;&#x7801;&#x8D8A;&#x8FDC;&#xFF0C;&#x6B63;&#x786E;&#x66F4;&#x65B0;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x5C31;&#x8D8A;&#x5C0F;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x65B9;&#x6CD5;&#x754C;&#x9762;&#x6CE8;&#x91CA;&#x7684;&#x6700;&#x4F73;&#x4F4D;&#x7F6E;&#x662F;&#x5728;&#x4EE3;&#x7801;&#x6587;&#x4EF6;&#x4E2D;&#xFF0C;&#x7D27;&#x9760;&#x8BE5;&#x65B9;&#x6CD5;&#x4E3B;&#x4F53;&#x7684;&#x4F4D;&#x7F6E;&#x3002;&#x5BF9;&#x65B9;&#x6CD5;&#x7684;&#x4EFB;&#x4F55;&#x66F4;&#x6539;&#x90FD;&#x5C06;&#x6D89;&#x53CA;&#x6B64;&#x4EE3;&#x7801;&#xFF0C;&#x56E0;&#x6B64;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5F88;&#x53EF;&#x80FD;&#x4F1A;&#x770B;&#x5230;&#x754C;&#x9762;&#x6CE8;&#x91CA;&#xFF0C;&#x5E76;&#x5728;&#x9700;&#x8981;&#x65F6;&#x8FDB;&#x884C;&#x66F4;&#x65B0;&#x3002;</p>
</blockquote>
<p>An alternative for languages like C and C++ that have separate code and header files, is to place the interface comments next to the method&#x2019;s declaration in the .h file. However, this is a long way from the code; developers won&#x2019;t see those comments when modifying the method&#x2019;s body, and it takes additional work to open a different file and find the interface comments to update them. Some might argue that interface comments should go in header files so that users can learn how to use an abstraction without having to look at the code file. However, users should not need to read either code or header files; they should get their information from documentation compiled by tools such as Doxygen or Javadoc. In addition, many IDEs will extract and present documentation to users, such as by displaying a method&#x2019;s documentation when the method&#x2019;s name is typed. Given tools such as these, the documentation should be located in the place that is most convenient for developers working on the code.</p>
<blockquote>
<p>&#x5BF9;&#x4E8E; C &#x548C; C ++&#x7B49;&#x5177;&#x6709;&#x5355;&#x72EC;&#x7684;&#x4EE3;&#x7801;&#x548C;&#x5934;&#x6587;&#x4EF6;&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x4E00;&#x79CD;&#x66FF;&#x4EE3;&#x65B9;&#x6CD5;&#x662F;&#x5C06;&#x63A5;&#x53E3;&#x6CE8;&#x91CA;&#x653E;&#x5728;.h &#x6587;&#x4EF6;&#x4E2D;&#x65B9;&#x6CD5;&#x58F0;&#x660E;&#x7684;&#x65C1;&#x8FB9;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x8FD9;&#x8DDD;&#x79BB;&#x4EE3;&#x7801;&#x8FD8;&#x6709;&#x5F88;&#x957F;&#x7684;&#x8DEF;&#x8981;&#x8D70;&#x3002;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5728;&#x4FEE;&#x6539;&#x65B9;&#x6CD5;&#x7684;&#x4E3B;&#x4F53;&#x65F6;&#x5C06;&#x770B;&#x4E0D;&#x5230;&#x8FD9;&#x4E9B;&#x6CE8;&#x91CA;&#xFF0C;&#x56E0;&#x6B64;&#x9700;&#x8981;&#x6253;&#x5F00;&#x5176;&#x4ED6;&#x6587;&#x4EF6;&#x5E76;&#x67E5;&#x627E;&#x63A5;&#x53E3;&#x6CE8;&#x91CA;&#x6765;&#x66F4;&#x65B0;&#x5B83;&#x4EEC;&#xFF0C;&#x8FD9;&#x9700;&#x8981;&#x989D;&#x5916;&#x7684;&#x5DE5;&#x4F5C;&#x3002;&#x6709;&#x4EBA;&#x53EF;&#x80FD;&#x4F1A;&#x4E89;&#x8FA9;&#x8BF4;&#x63A5;&#x53E3;&#x6CE8;&#x91CA;&#x5E94;&#x8BE5;&#x653E;&#x5728;&#x5934;&#x6587;&#x4EF6;&#x4E2D;&#xFF0C;&#x4EE5;&#x4FBF;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x4E0D;&#x5FC5;&#x770B;&#x4EE3;&#x7801;&#x6587;&#x4EF6;&#x5C31;&#x53EF;&#x4EE5;&#x5B66;&#x4E60;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x62BD;&#x8C61;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x7528;&#x6237;&#x65E0;&#x9700;&#x8BFB;&#x53D6;&#x4EE3;&#x7801;&#x6216;&#x5934;&#x6587;&#x4EF6;&#xFF1B;&#x4ED6;&#x4EEC;&#x5E94;&#x8BE5;&#x4ECE;&#x7531; Doxygen &#x6216; Javadoc &#x7B49;&#x5DE5;&#x5177;&#x7F16;&#x8BD1;&#x7684;&#x6587;&#x6863;&#x4E2D;&#x83B7;&#x53D6;&#x4FE1;&#x606F;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x8BB8;&#x591A; IDE &#x90FD;&#x4F1A;&#x63D0;&#x53D6;&#x6587;&#x6863;&#x5E76;&#x5C06;&#x5176;&#x5448;&#x73B0;&#x7ED9;&#x7528;&#x6237;&#xFF0C;&#x4F8B;&#x5982;&#x5728;&#x952E;&#x5165;&#x65B9;&#x6CD5;&#x540D;&#x79F0;&#x65F6;&#x663E;&#x793A;&#x65B9;&#x6CD5;&#x7684;&#x6587;&#x6863;&#x3002;&#x7ED9;&#x5B9A;&#x8BF8;&#x5982;&#x6B64;&#x7C7B;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x6587;&#x6863;&#x5E94;&#x4F4D;&#x4E8E;&#x5BF9;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x8FDB;&#x884C;&#x4EE3;&#x7801;&#x5F00;&#x53D1;&#x6700;&#x65B9;&#x4FBF;&#x7684;&#x4F4D;&#x7F6E;&#x3002;</p>
</blockquote>
<p>When writing implementation comments, don&#x2019;t put all the comments for an entire method at the top of the method. Spread them out, pushing each comment down to the narrowest scope that includes all of the code referred to by the comment. For example, if a method has three major phases, don&#x2019;t write one comment at the top of the method that describes all of the phases in detail. Instead, write a separate comment for each phase and position that comment just above the first line of code in that phase. On the other hand, it can also be helpful to have a comment at the top of a method&#x2019;s implementation that describes the overall strategy, like this:</p>
<blockquote>
<p>&#x5728;&#x7F16;&#x5199;&#x5B9E;&#x73B0;&#x6CE8;&#x91CA;&#x65F6;&#xFF0C;&#x4E0D;&#x8981;&#x5C06;&#x6574;&#x4E2A;&#x65B9;&#x6CD5;&#x7684;&#x6240;&#x6709;&#x6CE8;&#x91CA;&#x653E;&#x5728;&#x65B9;&#x6CD5;&#x7684;&#x9876;&#x90E8;&#x3002;&#x5C55;&#x5F00;&#x5B83;&#x4EEC;&#xFF0C;&#x5C06;&#x6BCF;&#x4E2A;&#x6CE8;&#x91CA;&#x63A8;&#x5230;&#x6700;&#x72ED;&#x7A84;&#x7684;&#x8303;&#x56F4;&#xFF0C;&#x5176;&#x4E2D;&#x5305;&#x62EC;&#x8BE5;&#x6CE8;&#x91CA;&#x6240;&#x5F15;&#x7528;&#x7684;&#x6240;&#x6709;&#x4EE3;&#x7801;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x5177;&#x6709;&#x4E09;&#x4E2A;&#x4E3B;&#x8981;&#x9636;&#x6BB5;&#xFF0C;&#x5219;&#x4E0D;&#x8981;&#x5728;&#x65B9;&#x6CD5;&#x7684;&#x9876;&#x90E8;&#x5199;&#x4E00;&#x4E2A;&#x8BE6;&#x7EC6;&#x63CF;&#x8FF0;&#x6240;&#x6709;&#x9636;&#x6BB5;&#x7684;&#x6CE8;&#x91CA;&#x3002;&#x800C;&#x662F;&#x4E3A;&#x6BCF;&#x4E2A;&#x9636;&#x6BB5;&#x7F16;&#x5199;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x6CE8;&#x91CA;&#xFF0C;&#x5E76;&#x5C06;&#x8BE5;&#x6CE8;&#x91CA;&#x653E;&#x7F6E;&#x5728;&#x8BE5;&#x9636;&#x6BB5;&#x7684;&#x7B2C;&#x4E00;&#x884C;&#x4EE3;&#x7801;&#x7684;&#x6B63;&#x4E0A;&#x65B9;&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x5728;&#x63CF;&#x8FF0;&#x603B;&#x4F53;&#x7B56;&#x7565;&#x7684;&#x65B9;&#x6CD5;&#x5B9E;&#x73B0;&#x7684;&#x9876;&#x90E8;&#x6DFB;&#x52A0;&#x6CE8;&#x91CA;&#x4E5F;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x6240;&#x5E2E;&#x52A9;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;</p>
</blockquote>
<pre><code class="lang-java"><span class="hljs-comment">//  We proceed in three phases:</span>
<span class="hljs-comment">//  Phase 1: Find feasible candidates</span>
<span class="hljs-comment">//  Phase 2: Assign each candidate a score</span>
<span class="hljs-comment">//  Phase 3: Choose the best, and remove it</span>
</code></pre>
<p>Additional details can be documented just above the code for each phase.</p>
<blockquote>
<p>&#x6BCF;&#x4E2A;&#x9636;&#x6BB5;&#x7684;&#x4EE3;&#x7801;&#x4E0A;&#x65B9;&#x90FD;&#x53EF;&#x4EE5;&#x8BB0;&#x5F55;&#x5176;&#x4ED6;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#x3002;</p>
</blockquote>
<p>In general, the farther a comment is from the code it describes, the more abstract it should be (this reduces the likelihood that the comment will be invalidated by code changes).</p>
<blockquote>
<p>&#x901A;&#x5E38;&#xFF0C;&#x6CE8;&#x91CA;&#x79BB;&#x63CF;&#x8FF0;&#x7684;&#x4EE3;&#x7801;&#x8D8A;&#x8FDC;&#xFF0C;&#x6CE8;&#x91CA;&#x5E94;&#x8BE5;&#x8D8A;&#x62BD;&#x8C61;&#xFF08;&#x8FD9;&#x51CF;&#x5C11;&#x4E86;&#x6CE8;&#x91CA;&#x56E0;&#x4EE3;&#x7801;&#x66F4;&#x6539;&#x800C;&#x65E0;&#x6548;&#x7684;&#x53EF;&#x80FD;&#x6027;&#xFF09;&#x3002;</p>
</blockquote>
<h2 id="163-comments-belong-in-the-code-not-the-commit-log-&#x6CE8;&#x91CA;&#x5C5E;&#x4E8E;&#x4EE3;&#x7801;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x63D0;&#x4EA4;&#x65E5;&#x5FD7;">16.3 Comments belong in the code, not the commit log &#x6CE8;&#x91CA;&#x5C5E;&#x4E8E;&#x4EE3;&#x7801;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x63D0;&#x4EA4;&#x65E5;&#x5FD7;</h2>
<p>A common mistake when modifying code is to put detailed information about the change in the commit message for the source code repository, but then not to document it in the code. Although commit messages can be browsed in the future by scanning the repository&#x2019;s log, a developer who needs the information is unlikely to think of scanning the repository log. Even if they do scan the log, it will be tedious to find the right log message.</p>
<blockquote>
<p>&#x4FEE;&#x6539;&#x4EE3;&#x7801;&#x65F6;&#xFF0C;&#x5E38;&#x89C1;&#x7684;&#x9519;&#x8BEF;&#x662F;&#x5C06;&#x6709;&#x5173;&#x66F4;&#x6539;&#x7684;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#x653E;&#x5165;&#x6E90;&#x4EE3;&#x7801;&#x5B58;&#x50A8;&#x5E93;&#x7684;&#x63D0;&#x4EA4;&#x6D88;&#x606F;&#x4E2D;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5C06;&#x5176;&#x8BB0;&#x5F55;&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#x3002;&#x5C3D;&#x7BA1;&#x5C06;&#x6765;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x626B;&#x63CF;&#x5B58;&#x50A8;&#x5E93;&#x7684;&#x65E5;&#x5FD7;&#x6765;&#x6D4F;&#x89C8;&#x63D0;&#x4EA4;&#x6D88;&#x606F;&#xFF0C;&#x4F46;&#x662F;&#x9700;&#x8981;&#x8BE5;&#x4FE1;&#x606F;&#x7684;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x4E0D;&#x592A;&#x53EF;&#x80FD;&#x8003;&#x8651;&#x626B;&#x63CF;&#x5B58;&#x50A8;&#x5E93;&#x7684;&#x65E5;&#x5FD7;&#x3002;&#x5373;&#x4F7F;&#x4ED6;&#x4EEC;&#x786E;&#x5B9E;&#x626B;&#x63CF;&#x4E86;&#x65E5;&#x5FD7;&#xFF0C;&#x4E5F;&#x5F88;&#x96BE;&#x627E;&#x5230;&#x6B63;&#x786E;&#x7684;&#x65E5;&#x5FD7;&#x6D88;&#x606F;&#x3002;</p>
</blockquote>
<p>When writing a commit message, ask yourself whether developers will need to use that information in the future. If so, then document this information in the code. An example is a commit message describing a subtle problem that motivated a code change. If this isn&#x2019;t documented in the code, then a developer might come along later and undo the change without realizing that they have re-created a bug. If you want to include a copy of this information in the commit message as well, that&#x2019;s fine, but the most important thing is to get it in the code. This illustrates the principle of placing documentation in the place where developers are most likely to see it; the commit log is rarely that place.</p>
<blockquote>
<p>&#x5728;&#x7F16;&#x5199;&#x63D0;&#x4EA4;&#x6D88;&#x606F;&#x65F6;&#xFF0C;&#x8BF7;&#x95EE;&#x81EA;&#x5DF1;&#x5C06;&#x6765;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x662F;&#x5426;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x8BE5;&#x4FE1;&#x606F;&#x3002;&#x5982;&#x679C;&#x662F;&#x8FD9;&#x6837;&#xFF0C;&#x5219;&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#x8BB0;&#x5F55;&#x6B64;&#x4FE1;&#x606F;&#x3002;&#x4E00;&#x4E2A;&#x793A;&#x4F8B;&#x662F;&#x63D0;&#x4EA4;&#x6D88;&#x606F;&#xFF0C;&#x63CF;&#x8FF0;&#x4E86;&#x5BFC;&#x81F4;&#x4EE3;&#x7801;&#x66F4;&#x6539;&#x7684;&#x7EC6;&#x5FAE;&#x95EE;&#x9898;&#x3002;&#x5982;&#x679C;&#x4EE3;&#x7801;&#x4E2D;&#x672A;&#x5BF9;&#x6B64;&#x8FDB;&#x884C;&#x8BB0;&#x5F55;&#xFF0C;&#x5219;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x53EF;&#x80FD;&#x4F1A;&#x7A0D;&#x540E;&#x518D;&#x63D0;&#x51FA;&#x5E76;&#x64A4;&#x6D88;&#x66F4;&#x6539;&#xFF0C;&#x800C;&#x4E0D;&#x4F1A;&#x610F;&#x8BC6;&#x5230;&#x4ED6;&#x4EEC;&#x5DF2;&#x7ECF;&#x91CD;&#x65B0;&#x521B;&#x5EFA;&#x4E86;&#x9519;&#x8BEF;&#x3002;&#x5982;&#x679C;&#x60A8;&#x4E5F;&#x60F3;&#x5728;&#x63D0;&#x4EA4;&#x6D88;&#x606F;&#x4E2D;&#x5305;&#x542B;&#x6B64;&#x4FE1;&#x606F;&#x7684;&#x526F;&#x672C;&#xFF0C;&#x90A3;&#x5F88;&#x597D;&#xFF0C;&#x4F46;&#x662F;&#x6700;&#x91CD;&#x8981;&#x7684;&#x662F;&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#x83B7;&#x53D6;&#x5B83;&#x3002;&#x8FD9;&#x8BF4;&#x660E;&#x4E86;&#x5C06;&#x6587;&#x6863;&#x653E;&#x7F6E;&#x5728;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x6700;&#x6709;&#x53EF;&#x80FD;&#x770B;&#x5230;&#x5B83;&#x7684;&#x5730;&#x65B9;&#x7684;&#x539F;&#x7406;&#xFF1B;&#x63D0;&#x4EA4;&#x65E5;&#x5FD7;&#x5F88;&#x5C11;&#x5728;&#x90A3;&#x4E2A;&#x5730;&#x65B9;&#x3002;</p>
</blockquote>
<h2 id="164-maintaining-comments-avoid-duplication-&#x7EF4;&#x62A4;&#x6CE8;&#x91CA;&#xFF1A;&#x907F;&#x514D;&#x91CD;&#x590D;">16.4 Maintaining comments: avoid duplication &#x7EF4;&#x62A4;&#x6CE8;&#x91CA;&#xFF1A;&#x907F;&#x514D;&#x91CD;&#x590D;</h2>
<p>The second technique for keeping comments up to date is to avoid duplication. If documentation is duplicated, it is more difficult for developers to find and update all of the relevant copies. Instead, try to document each design decision exactly once. If there are multiple places in the code that are affected by a particular decision, don&#x2019;t repeat the documentation at each of these points. Instead, find the most obvious single place to put the documentation. For example, suppose there is tricky behavior related to a variable, which affects several different places where the variable is used. You can document that behavior in the comment next to the variable&#x2019;s declaration. This is a natural place that developers are likely to check if they&#x2019;re having trouble understanding code that uses the variable.</p>
<blockquote>
<p>&#x4FDD;&#x6301;&#x8BC4;&#x8BBA;&#x6700;&#x65B0;&#x7684;&#x7B2C;&#x4E8C;&#x79CD;&#x6280;&#x672F;&#x662F;&#x907F;&#x514D;&#x91CD;&#x590D;&#x3002;&#x5982;&#x679C;&#x6587;&#x6863;&#x91CD;&#x590D;&#xFF0C;&#x90A3;&#x4E48;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5C06;&#x5F88;&#x96BE;&#x627E;&#x5230;&#x5E76;&#x66F4;&#x65B0;&#x6240;&#x6709;&#x76F8;&#x5173;&#x526F;&#x672C;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x8BF7;&#x5C1D;&#x8BD5;&#x4EC5;&#x4E00;&#x6B21;&#x8BB0;&#x5F55;&#x6BCF;&#x4E2A;&#x8BBE;&#x8BA1;&#x51B3;&#x7B56;&#x3002;&#x5982;&#x679C;&#x4EE3;&#x7801;&#x4E2D;&#x6709;&#x591A;&#x4E2A;&#x5730;&#x65B9;&#x53D7;&#x67D0;&#x4E2A;&#x7279;&#x5B9A;&#x51B3;&#x5B9A;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x8BF7;&#x4E0D;&#x8981;&#x5728;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x5730;&#x65B9;&#x91CD;&#x590D;&#x6587;&#x6863;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x627E;&#x5230;&#x653E;&#x7F6E;&#x6587;&#x6863;&#x6700;&#x660E;&#x663E;&#x7684;&#x4F4D;&#x7F6E;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5047;&#x8BBE;&#x5B58;&#x5728;&#x4E0E;&#x53D8;&#x91CF;&#x76F8;&#x5173;&#x7684;&#x68D8;&#x624B;&#x884C;&#x4E3A;&#xFF0C;&#x8FD9;&#x4F1A;&#x5F71;&#x54CD;&#x4F7F;&#x7528;&#x53D8;&#x91CF;&#x7684;&#x51E0;&#x4E2A;&#x4E0D;&#x540C;&#x4F4D;&#x7F6E;&#x3002;&#x60A8;&#x53EF;&#x4EE5;&#x5728;&#x53D8;&#x91CF;&#x58F0;&#x660E;&#x65C1;&#x8FB9;&#x7684;&#x6CE8;&#x91CA;&#x4E2D;&#x8BB0;&#x5F55;&#x8BE5;&#x884C;&#x4E3A;&#x3002;&#x8FD9;&#x662F;&#x5F88;&#x81EA;&#x7136;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x53EF;&#x80FD;&#x4F1A;&#x68C0;&#x67E5;&#x4ED6;&#x4EEC;&#x662F;&#x5426;&#x5728;&#x7406;&#x89E3;&#x4F7F;&#x7528;&#x8BE5;&#x53D8;&#x91CF;&#x7684;&#x4EE3;&#x7801;&#x65F6;&#x9047;&#x5230;&#x9EBB;&#x70E6;&#x3002;</p>
</blockquote>
<p>If there is no &#x201C;obvious&#x201D; single place to put a particular piece of documentation where developers will find it, create a designNotes file as described in Section 13.7. Or, pick the best of the available places and put the documentation there. In addition, add short comments in the other places that refer to the central location: &#x201C;See the comment in xyz for an explanation of the code below.&#x201D; If the reference becomes obsolete because the master comment was moved or deleted, this inconsistency will be self-evident because developers won&#x2019;t find the comment at the indicated place; they can use revision control history to find out what happened to the comment and then update the reference. In contrast, if the documentation is duplicated and some of the copies don&#x2019;t get updated, there will be no indication to developers that they are using stale information.</p>
<blockquote>
<p>&#x5982;&#x679C;&#x6CA1;&#x6709;&#x4E00;&#x4E2A;&#x201C;&#x660E;&#x663E;&#x7684;&#x201D;&#x5730;&#x65B9;&#x6765;&#x653E;&#x7F6E;&#x7279;&#x5B9A;&#x7684;&#x6587;&#x6863;&#xFF0C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x53EF;&#x4EE5;&#x627E;&#x5230;&#x5B83;&#xFF0C;&#x90A3;&#x4E48;&#x521B;&#x5EFA;&#x4E00;&#x4E2A; designNotes &#x6587;&#x4EF6;&#xFF0C;&#x5982;&#x7B2C; 13.7 &#x8282;&#x6240;&#x8FF0;&#x3002;&#x6216;&#x8005;&#xFF0C;&#x9009;&#x62E9;&#x6700;&#x597D;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x628A;&#x6587;&#x6863;&#x653E;&#x5728;&#x90A3;&#x91CC;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x5728;&#x5F15;&#x7528;&#x4E2D;&#x5FC3;&#x4F4D;&#x7F6E;&#x7684;&#x5176;&#x4ED6;&#x5730;&#x65B9;&#x6DFB;&#x52A0;&#x7B80;&#x77ED;&#x7684;&#x6CE8;&#x91CA;:&#x201C;&#x67E5;&#x770B; xyz &#x4E2D;&#x7684;&#x6CE8;&#x91CA;&#x4EE5;&#x4E86;&#x89E3;&#x4E0B;&#x9762;&#x4EE3;&#x7801;&#x7684;&#x89E3;&#x91CA;&#x3002;&#x201C;&#x5982;&#x679C;&#x5F15;&#x7528;&#x56E0;&#x4E3A;&#x4E3B;&#x6CE8;&#x91CA;&#x88AB;&#x79FB;&#x52A8;&#x6216;&#x5220;&#x9664;&#x800C;&#x53D8;&#x5F97;&#x8FC7;&#x65F6;&#xFF0C;&#x8FD9;&#x79CD;&#x4E0D;&#x4E00;&#x81F4;&#x6027;&#x5C06;&#x662F;&#x4E0D;&#x8A00;&#x800C;&#x55BB;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5C06;&#x65E0;&#x6CD5;&#x5728;&#x6307;&#x5B9A;&#x7684;&#x4F4D;&#x7F6E;&#x627E;&#x5230;&#x6CE8;&#x91CA;;&#x4ED6;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4FEE;&#x8BA2;&#x63A7;&#x5236;&#x5386;&#x53F2;&#x8BB0;&#x5F55;&#x6765;&#x67E5;&#x627E;&#x6CE8;&#x91CA;&#x53D1;&#x751F;&#x4E86;&#x4EC0;&#x4E48;&#xFF0C;&#x7136;&#x540E;&#x66F4;&#x65B0;&#x5F15;&#x7528;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x5982;&#x679C;&#x6587;&#x6863;&#x662F;&#x91CD;&#x590D;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x4E00;&#x4E9B;&#x526F;&#x672C;&#x6CA1;&#x6709;&#x5F97;&#x5230;&#x66F4;&#x65B0;&#xFF0C;&#x90A3;&#x4E48;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5C31;&#x4E0D;&#x4F1A;&#x77E5;&#x9053;&#x4ED6;&#x4EEC;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x9648;&#x65E7;&#x7684;&#x4FE1;&#x606F;&#x3002;</p>
</blockquote>
<p>Don&#x2019;t redocument one module&#x2019;s design decisions in another module. For example, don&#x2019;t put comments before a method call that explain what happens in the called method. If readers want to know, they should look at the interface comments for the method. Good development tools will usually provide this information automatically, for example, by displaying the interface comments for a method if you select the method&#x2019;s name or hover the mouse over it. Try to make it easy for developers to find appropriate documentation, but don&#x2019;t do it by repeating the documentation.</p>
<blockquote>
<p>&#x4E0D;&#x8981;&#x5728;&#x53E6;&#x4E00;&#x4E2A;&#x6A21;&#x5757;&#x4E2D;&#x8BB0;&#x5F55;&#x4E00;&#x4E2A;&#x6A21;&#x5757;&#x7684;&#x8BBE;&#x8BA1;&#x51B3;&#x7B56;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4E0D;&#x8981;&#x5728;&#x65B9;&#x6CD5;&#x8C03;&#x7528;&#x524D;&#x6DFB;&#x52A0;&#x6CE8;&#x91CA;&#xFF0C;&#x4EE5;&#x89E3;&#x91CA;&#x88AB;&#x8C03;&#x7528;&#x65B9;&#x6CD5;&#x4E2D;&#x53D1;&#x751F;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x5982;&#x679C;&#x8BFB;&#x8005;&#x60F3;&#x77E5;&#x9053;&#xFF0C;&#x4ED6;&#x4EEC;&#x5E94;&#x8BE5;&#x67E5;&#x770B;&#x8BE5;&#x65B9;&#x6CD5;&#x7684;&#x754C;&#x9762;&#x6CE8;&#x91CA;&#x3002;&#x597D;&#x7684;&#x5F00;&#x53D1;&#x5DE5;&#x5177;&#x901A;&#x5E38;&#x4F1A;&#x81EA;&#x52A8;&#x63D0;&#x4F9B;&#x6B64;&#x4FE1;&#x606F;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x60A8;&#x9009;&#x62E9;&#x4E86;&#x65B9;&#x6CD5;&#x7684;&#x540D;&#x79F0;&#x6216;&#x5C06;&#x9F20;&#x6807;&#x60AC;&#x505C;&#x5728;&#x8BE5;&#x65B9;&#x6CD5;&#x7684;&#x540D;&#x79F0;&#x4E0A;&#xFF0C;&#x5219;&#x5C06;&#x663E;&#x793A;&#x8BE5;&#x65B9;&#x6CD5;&#x7684;&#x754C;&#x9762;&#x6CE8;&#x91CA;&#x3002;&#x5C1D;&#x8BD5;&#x4F7F;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5BB9;&#x6613;&#x627E;&#x5230;&#x5408;&#x9002;&#x7684;&#x6587;&#x6863;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x8981;&#x91CD;&#x590D;&#x6587;&#x6863;&#x3002;</p>
</blockquote>
<p>If information is already documented someplace outside your program, don&#x2019;t repeat the documentation inside the program; just reference the external documentation. For example, if you write a class that implements the HTTP protocol, there&#x2019;s no need for you to describe the HTTP protocol inside your code. There are already numerous sources for this documentation on the Web; just add a short comment to your code with a URL for one of these sources. Another example is features that are already documented in a user manual. Suppose you are writing a program that implements a collection of commands, with one method responsible for implementing each command. If there is a user manual that describes those commands, there&#x2019;s no need to duplicate this information in the code. Instead, include a short note like the following in the interface comment for each command method:</p>
<blockquote>
<p>&#x5982;&#x679C;&#x4FE1;&#x606F;&#x5DF2;&#x7ECF;&#x5728;&#x7A0B;&#x5E8F;&#x4E4B;&#x5916;&#x7684;&#x67D0;&#x4E2A;&#x5730;&#x65B9;&#x8BB0;&#x5F55;&#x4E86;&#xFF0C;&#x4E0D;&#x8981;&#x5728;&#x7A0B;&#x5E8F;&#x5185;&#x90E8;&#x91CD;&#x590D;&#x8BB0;&#x5F55;;&#x53EA;&#x9700;&#x53C2;&#x8003;&#x5916;&#x90E8;&#x6587;&#x6863;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x60A8;&#x7F16;&#x5199;&#x4E00;&#x4E2A;&#x5B9E;&#x73B0; HTTP &#x534F;&#x8BAE;&#x7684;&#x7C7B;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x4E0D;&#x9700;&#x8981;&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#x63CF;&#x8FF0; HTTP &#x534F;&#x8BAE;&#x3002;&#x5728;&#x7F51;&#x4E0A;&#x5DF2;&#x7ECF;&#x6709;&#x5F88;&#x591A;&#x5173;&#x4E8E;&#x8FD9;&#x4E2A;&#x6587;&#x6863;&#x7684;&#x6765;&#x6E90;;&#x53EA;&#x9700;&#x5728;&#x60A8;&#x7684;&#x4EE3;&#x7801;&#x4E2D;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x7B80;&#x77ED;&#x7684;&#x6CE8;&#x91CA;&#xFF0C;&#x5E76;&#x4E3A;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x6E90;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A; URL&#x3002;&#x53E6;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x662F;&#x5DF2;&#x7ECF;&#x5728;&#x7528;&#x6237;&#x624B;&#x518C;&#x4E2D;&#x8BB0;&#x5F55;&#x7684;&#x7279;&#x6027;&#x3002;&#x5047;&#x8BBE;&#x60A8;&#x6B63;&#x5728;&#x7F16;&#x5199;&#x4E00;&#x4E2A;&#x5B9E;&#x73B0;&#x547D;&#x4EE4;&#x96C6;&#x5408;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x5176;&#x4E2D;&#x6709;&#x4E00;&#x4E2A;&#x8D1F;&#x8D23;&#x5B9E;&#x73B0;&#x6BCF;&#x4E2A;&#x547D;&#x4EE4;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x5982;&#x679C;&#x6709;&#x63CF;&#x8FF0;&#x8FD9;&#x4E9B;&#x547D;&#x4EE4;&#x7684;&#x7528;&#x6237;&#x624B;&#x518C;&#xFF0C;&#x5C31;&#x4E0D;&#x9700;&#x8981;&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#x91CD;&#x590D;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x5728;&#x6BCF;&#x4E2A;&#x547D;&#x4EE4;&#x65B9;&#x6CD5;&#x7684;&#x63A5;&#x53E3;&#x6CE8;&#x91CA;&#x4E2D;&#x5305;&#x542B;&#x5982;&#x4E0B;&#x7B80;&#x77ED;&#x8BF4;&#x660E;:</p>
</blockquote>
<pre><code class="lang-java"><span class="hljs-comment">// Implements the Foo command; see the user manual for details.</span>
</code></pre>
<p>It&#x2019;s important that readers can easily find all the documentation needed to understand your code, but that doesn&#x2019;t mean you have to write all of that documentation.</p>
<blockquote>
<p>&#x8BFB;&#x8005;&#x53EF;&#x4EE5;&#x8F7B;&#x677E;&#x627E;&#x5230;&#x7406;&#x89E3;&#x4EE3;&#x7801;&#x6240;&#x9700;&#x7684;&#x6240;&#x6709;&#x6587;&#x6863;&#xFF0C;&#x8FD9;&#x4E00;&#x70B9;&#x5F88;&#x91CD;&#x8981;&#xFF0C;&#x4F46;&#x8FD9;&#x5E76;&#x4E0D;&#x610F;&#x5473;&#x7740;&#x60A8;&#x5FC5;&#x987B;&#x7F16;&#x5199;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x6587;&#x6863;&#x3002;</p>
</blockquote>
<h2 id="165-maintaining-comments-check-the-diffs-&#x7EF4;&#x62A4;&#x6CE8;&#x91CA;&#xFF1A;&#x68C0;&#x67E5;&#x5DEE;&#x5F02;">16.5 Maintaining comments: check the diffs &#x7EF4;&#x62A4;&#x6CE8;&#x91CA;&#xFF1A;&#x68C0;&#x67E5;&#x5DEE;&#x5F02;</h2>
<p>One good way to make sure documentation stays up to date is to take a few minutes before committing a change to your revision control system to scan over all the changes for that commit; make sure that each change is properly reflected in the documentation. These pre-commit scans will also detect several other problems, such as accidentally leaving debugging code in the system or failing to fix TODO items.</p>
<blockquote>
<p>&#x786E;&#x4FDD;&#x6587;&#x6863;&#x4FDD;&#x6301;&#x6700;&#x65B0;&#x72B6;&#x6001;&#x7684;&#x4E00;&#x79CD;&#x597D;&#x65B9;&#x6CD5;&#x662F;&#xFF0C;&#x5728;&#x5C06;&#x66F4;&#x6539;&#x63D0;&#x4EA4;&#x5230;&#x4FEE;&#x8BA2;&#x63A7;&#x5236;&#x7CFB;&#x7EDF;&#x4E4B;&#x524D;&#x9700;&#x8981;&#x82B1;&#x8D39;&#x51E0;&#x5206;&#x949F;&#xFF0C;&#x4EE5;&#x626B;&#x63CF;&#x8BE5;&#x63D0;&#x4EA4;&#x7684;&#x6240;&#x6709;&#x66F4;&#x6539;&#x3002;&#x786E;&#x4FDD;&#x6587;&#x6863;&#x4E2D;&#x6B63;&#x786E;&#x53CD;&#x6620;&#x4E86;&#x6BCF;&#x4E2A;&#x66F4;&#x6539;&#x3002;&#x8FD9;&#x4E9B;&#x9884;&#x5148;&#x63D0;&#x4EA4;&#x7684;&#x626B;&#x63CF;&#x8FD8;&#x5C06;&#x68C0;&#x6D4B;&#x5176;&#x4ED6;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x4F8B;&#x5982;&#x610F;&#x5916;&#x5730;&#x5C06;&#x8C03;&#x8BD5;&#x4EE3;&#x7801;&#x7559;&#x5728;&#x7CFB;&#x7EDF;&#x4E2D;&#x6216;&#x65E0;&#x6CD5;&#x4FEE;&#x590D; TODO &#x9879;&#x76EE;&#x3002;</p>
</blockquote>
<h2 id="166-higher-level-comments-are-easier-to-maintain-&#x66F4;&#x9AD8;&#x7EA7;&#x7684;&#x6CE8;&#x91CA;&#x66F4;&#x6613;&#x4E8E;&#x7EF4;&#x62A4;">16.6 Higher-level comments are easier to maintain &#x66F4;&#x9AD8;&#x7EA7;&#x7684;&#x6CE8;&#x91CA;&#x66F4;&#x6613;&#x4E8E;&#x7EF4;&#x62A4;</h2>
<p>One final thought on maintaining documentation: comments are easier to maintain if they are higher-level and more abstract than the code. These comments do not reflect the details of the code, so they will not be affected by minor code changes; only changes in overall behavior will affect these comments. Of course, as discussed in Chapter 13, some comments do need to be detailed and precise. But in general, the comments that are most useful (they don&#x2019;t simply repeat the code) are also easiest to maintain.</p>
<blockquote>
<p>&#x5173;&#x4E8E;&#x7EF4;&#x62A4;&#x6587;&#x6863;&#x7684;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x60F3;&#x6CD5;&#xFF1A;&#x5982;&#x679C;&#x6CE8;&#x91CA;&#x6BD4;&#x4EE3;&#x7801;&#x66F4;&#x9AD8;&#x7EA7;&#xFF0C;&#x66F4;&#x62BD;&#x8C61;&#xFF0C;&#x5219;&#x6CE8;&#x91CA;&#x66F4;&#x6613;&#x4E8E;&#x7EF4;&#x62A4;&#x3002;&#x8FD9;&#x4E9B;&#x6CE8;&#x91CA;&#x4E0D;&#x53CD;&#x6620;&#x4EE3;&#x7801;&#x7684;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#xFF0C;&#x56E0;&#x6B64;&#x5B83;&#x4EEC;&#x4E0D;&#x4F1A;&#x53D7;&#x5230;&#x4EE3;&#x7801;&#x66F4;&#x6539;&#x7684;&#x5F71;&#x54CD;&#xFF1B;&#x53EA;&#x6709;&#x6574;&#x4F53;&#x884C;&#x4E3A;&#x7684;&#x53D8;&#x5316;&#x624D;&#x4F1A;&#x5F71;&#x54CD;&#x8FD9;&#x4E9B;&#x8BC4;&#x8BBA;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x6B63;&#x5982;&#x7B2C; 13 &#x7AE0;&#x6240;&#x8BA8;&#x8BBA;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x67D0;&#x4E9B;&#x6CE8;&#x91CA;&#x7684;&#x786E;&#x9700;&#x8981;&#x8BE6;&#x7EC6;&#x548C;&#x7CBE;&#x786E;&#x3002;&#x4F46;&#x603B;&#x7684;&#x6765;&#x8BF4;&#xFF0C;&#x6700;&#x6709;&#x7528;&#x7684;&#x6CE8;&#x91CA;&#xFF08;&#x5B83;&#x4EEC;&#x4E0D;&#x53EA;&#x662F;&#x91CD;&#x590D;&#x4EE3;&#x7801;&#xFF09;&#x4E5F;&#x6700;&#x5BB9;&#x6613;&#x7EF4;&#x62A4;&#x3002;</p>
</blockquote>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="ch15.html" class="navigation navigation-prev " aria-label="Previous page: 第十五章: 先写注释">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="ch17.html" class="navigation navigation-next " aria-label="Next page: 第十七章: 一致性">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第十六章: 修改现有的代码","level":"1.19","depth":1,"next":{"title":"第十七章: 一致性","level":"1.20","depth":1,"path":"docs/ch17.md","ref":"./docs/ch17.md","articles":[]},"previous":{"title":"第十五章: 先写注释","level":"1.18","depth":1,"path":"docs/ch15.md","ref":"./docs/ch15.md","articles":[]},"dir":"ltr"},"config":{"plugins":["back-to-top-button","expandable-chapters-small","page-toc-button","livereload"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"livereload":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"page-toc-button":{},"back-to-top-button":{},"expandable-chapters-small":{},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"John Ousterhout","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"软件设计哲学","language":"zh-hans","gitbook":"*","description":"书中讨论了软件设计的主题：如何将复杂的软件系统分解成可以相对独立实现的模块(如类和方法)"},"file":{"path":"docs/ch16.md","mtime":"2020-08-06T16:26:19.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-02-06T04:55:41.669Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-page-toc-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

