
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第十七章: 一致性 · 软件设计哲学</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="John Ousterhout">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-page-toc-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="ch18.html" />
    
    
    <link rel="prev" href="ch16.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    首页
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="preface">
            
                <span>
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="ch1.html">
            
                <a href="ch1.html">
            
                    
                    第一章：介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="ch2.html">
            
                <a href="ch2.html">
            
                    
                    第二章：复杂性的本质
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="ch3.html">
            
                <a href="ch3.html">
            
                    
                    第三章：工作代码是不够的（战略与战术编程）
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="ch4.html">
            
                <a href="ch4.html">
            
                    
                    第四章：模块应该是深的
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="ch5.html">
            
                <a href="ch5.html">
            
                    
                    第五章：信息隐藏(和泄露)
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="ch6.html">
            
                <a href="ch6.html">
            
                    
                    第六章：通用模块更深入
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="ch7.html">
            
                <a href="ch7.html">
            
                    
                    第七章: 不同的层，不同的抽象
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="ch8.html">
            
                <a href="ch8.html">
            
                    
                    第八章: 降低复杂性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="ch9.html">
            
                <a href="ch9.html">
            
                    
                    第九章: 在一起更好还是分开更好？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="ch10.html">
            
                <a href="ch10.html">
            
                    
                    第十章: 定义不存在的错误
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="ch11.html">
            
                <a href="ch11.html">
            
                    
                    第十一章: 设计它两次
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="ch12.html">
            
                <a href="ch12.html">
            
                    
                    第十二章: 为什么写注释？四个理由
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="ch13.html">
            
                <a href="ch13.html">
            
                    
                    第十三章: 注释应该描述代码中不明显的内容
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="ch14.html">
            
                <a href="ch14.html">
            
                    
                    第十四章: 选择的名字
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="ch15.html">
            
                <a href="ch15.html">
            
                    
                    第十五章: 先写注释
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="ch16.html">
            
                <a href="ch16.html">
            
                    
                    第十六章: 修改现有的代码
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.20" data-path="ch17.html">
            
                <a href="ch17.html">
            
                    
                    第十七章: 一致性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.21" data-path="ch18.html">
            
                <a href="ch18.html">
            
                    
                    第十八章: 代码应该是显而易见的
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.22" data-path="ch19.html">
            
                <a href="ch19.html">
            
                    
                    第十九章: 软件发展趋势
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.23" data-path="ch20.html">
            
                <a href="ch20.html">
            
                    
                    第二十章: 设计性能
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.24" data-path="ch21.html">
            
                <a href="ch21.html">
            
                    
                    第二十一章: 结论
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.25" data-path="summary.html">
            
                <a href="summary.html">
            
                    
                    总结
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >第十七章: 一致性</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7B2C;-17-&#x7AE0;-&#x4E00;&#x81F4;&#x6027;">&#x7B2C; 17 &#x7AE0; &#x4E00;&#x81F4;&#x6027;</h1>
<blockquote>
<p>Chapter 17 Consistency</p>
</blockquote>
<p>Consistency is a powerful tool for reducing the complexity of a system and making its behavior more obvious. If a system is consistent, it means that similar things are done in similar ways, and dissimilar things are done in different ways. Consistency creates cognitive leverage: once you have learned how something is done in one place, you can use that knowledge to immediately understand other places that use the same approach. If a system is not implemented in a consistent fashion, developers must learn about each situation separately. This will take more time.</p>
<blockquote>
<p>&#x4E00;&#x81F4;&#x6027;&#x662F;&#x964D;&#x4F4E;&#x7CFB;&#x7EDF;&#x590D;&#x6742;&#x6027;&#x5E76;&#x4F7F;&#x5176;&#x884C;&#x4E3A;&#x66F4;&#x660E;&#x663E;&#x7684;&#x5F3A;&#x5927;&#x5DE5;&#x5177;&#x3002;&#x5982;&#x679C;&#x7CFB;&#x7EDF;&#x662F;&#x4E00;&#x81F4;&#x7684;&#xFF0C;&#x5219;&#x610F;&#x5473;&#x7740;&#x76F8;&#x4F3C;&#x7684;&#x4E8B;&#x60C5;&#x4EE5;&#x76F8;&#x4F3C;&#x7684;&#x65B9;&#x5F0F;&#x5B8C;&#x6210;&#xFF0C;&#x800C;&#x4E0D;&#x540C;&#x7684;&#x4E8B;&#x60C5;&#x5219;&#x4EE5;&#x4E0D;&#x540C;&#x7684;&#x65B9;&#x5F0F;&#x5B8C;&#x6210;&#x3002;&#x4E00;&#x81F4;&#x6027;&#x4F1A;&#x4EA7;&#x751F;&#x8BA4;&#x77E5;&#x5F71;&#x54CD;&#x529B;&#xFF1A;&#x4E00;&#x65E6;&#x60A8;&#x4E86;&#x89E3;&#x4E86;&#x67D0;&#x4E2A;&#x5730;&#x65B9;&#x7684;&#x5DE5;&#x4F5C;&#x65B9;&#x5F0F;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x8BE5;&#x77E5;&#x8BC6;&#x7ACB;&#x5373;&#x4E86;&#x89E3;&#x5176;&#x4ED6;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x65B9;&#x6CD5;&#x7684;&#x5730;&#x65B9;&#x3002;&#x5982;&#x679C;&#x7CFB;&#x7EDF;&#x7684;&#x5B9E;&#x65BD;&#x65B9;&#x5F0F;&#x4E0D;&#x4E00;&#x81F4;&#xFF0C;&#x5219;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5FC5;&#x987B;&#x5206;&#x522B;&#x4E86;&#x89E3;&#x6BCF;&#x79CD;&#x60C5;&#x51B5;&#x3002;&#x8FD9;&#x5C06;&#x82B1;&#x8D39;&#x66F4;&#x591A;&#x65F6;&#x95F4;&#x3002;</p>
</blockquote>
<p>Consistency reduces mistakes. If a system is not consistent, two situations may appear the same when in fact they are different. A developer may see a pattern that looks familiar and make incorrect assumptions based on previous encounters with that pattern. On the other hand, if the system is consistent, assumptions made based on familiar-looking situations will be safe. Consistency allows developers to work more quickly with fewer mistakes.</p>
<blockquote>
<p>&#x4E00;&#x81F4;&#x6027;&#x51CF;&#x5C11;&#x4E86;&#x9519;&#x8BEF;&#x3002;&#x5982;&#x679C;&#x7CFB;&#x7EDF;&#x4E0D;&#x4E00;&#x81F4;&#xFF0C;&#x5219;&#x5B9E;&#x9645;&#x4E0A;&#x4E24;&#x79CD;&#x60C5;&#x51B5;&#x53EF;&#x80FD;&#x4E0D;&#x540C;&#xFF0C;&#x4F46;&#x4E24;&#x79CD;&#x60C5;&#x51B5;&#x53EF;&#x80FD;&#x770B;&#x8D77;&#x6765;&#x76F8;&#x540C;&#x3002;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x53EF;&#x80FD;&#x4F1A;&#x770B;&#x5230;&#x4E00;&#x4E2A;&#x770B;&#x8D77;&#x6765;&#x5F88;&#x719F;&#x6089;&#x7684;&#x6A21;&#x5F0F;&#xFF0C;&#x5E76;&#x6839;&#x636E;&#x4EE5;&#x524D;&#x5BF9;&#x8BE5;&#x6A21;&#x5F0F;&#x7684;&#x906D;&#x9047;&#x505A;&#x51FA;&#x9519;&#x8BEF;&#x7684;&#x5047;&#x8BBE;&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x5982;&#x679C;&#x7CFB;&#x7EDF;&#x662F;&#x4E00;&#x81F4;&#x7684;&#xFF0C;&#x5219;&#x57FA;&#x4E8E;&#x719F;&#x6089;&#x60C5;&#x51B5;&#x7684;&#x5047;&#x8BBE;&#x5C06;&#x662F;&#x5B89;&#x5168;&#x7684;&#x3002;&#x4E00;&#x81F4;&#x6027;&#x5141;&#x8BB8;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x4EE5;&#x66F4;&#x5C11;&#x7684;&#x9519;&#x8BEF;&#x6765;&#x66F4;&#x5FEB;&#x5730;&#x5DE5;&#x4F5C;&#x3002;</p>
</blockquote>
<h2 id="171-examples-of-consistency-&#x4E00;&#x81F4;&#x6027;&#x793A;&#x4F8B;">17.1 Examples of consistency &#x4E00;&#x81F4;&#x6027;&#x793A;&#x4F8B;</h2>
<p>Consistency can be applied at many levels in a system; here are a few examples.</p>
<blockquote>
<p>&#x4E00;&#x81F4;&#x6027;&#x53EF;&#x4EE5;&#x5E94;&#x7528;&#x4E8E;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x8BB8;&#x591A;&#x7EA7;&#x522B;&#x3002;&#x8FD9;&#x91CC;&#x6709;&#x4E00;&#x4E9B;&#x4F8B;&#x5B50;&#x3002;</p>
</blockquote>
<p>Names. Chapter 14 has already discussed the benefits of using names in a consistent way.</p>
<blockquote>
<p>&#x540D;&#x5B57;&#x3002;&#x7B2C; 14 &#x7AE0;&#x5DF2;&#x7ECF;&#x8BA8;&#x8BBA;&#x4E86;&#x4EE5;&#x4E00;&#x81F4;&#x7684;&#x65B9;&#x5F0F;&#x4F7F;&#x7528;&#x540D;&#x79F0;&#x7684;&#x597D;&#x5904;&#x3002;</p>
</blockquote>
<p>Coding style. It is common nowadays for development organizations to have style guides that restrict program structure beyond the rules enforced by compilers. Modern style guides address a range of issues, such as indentation, curly-brace placement, order of declarations, naming, commenting, and restrictions on language features considered dangerous. Style guidelines make code easier to read and can reduce some kinds of errors.</p>
<blockquote>
<p>&#x7F16;&#x7801;&#x6837;&#x5F0F;&#x3002;&#x5982;&#x4ECA;&#xFF0C;&#x5F00;&#x53D1;&#x7EC4;&#x7EC7;&#x901A;&#x5E38;&#x62E5;&#x6709;&#x6837;&#x5F0F;&#x6307;&#x5357;&#xFF0C;&#x8FD9;&#x4E9B;&#x6837;&#x5F0F;&#x6307;&#x5357;&#x5C06;&#x7A0B;&#x5E8F;&#x7ED3;&#x6784;&#x9650;&#x5236;&#x5728;&#x7F16;&#x8BD1;&#x5668;&#x6240;&#x5F3A;&#x5236;&#x6267;&#x884C;&#x7684;&#x89C4;&#x5219;&#x4E4B;&#x5916;&#x3002;&#x73B0;&#x4EE3;&#x98CE;&#x683C;&#x6307;&#x5357;&#x89E3;&#x51B3;&#x4E86;&#x4E00;&#x7CFB;&#x5217;&#x95EE;&#x9898;&#xFF0C;&#x4F8B;&#x5982;&#x7F29;&#x8FDB;&#xFF0C;&#x5927;&#x62EC;&#x53F7;&#x653E;&#x7F6E;&#xFF0C;&#x58F0;&#x660E;&#x987A;&#x5E8F;&#xFF0C;&#x547D;&#x540D;&#xFF0C;&#x6CE8;&#x91CA;&#x4EE5;&#x53CA;&#x5BF9;&#x8BA4;&#x4E3A;&#x5371;&#x9669;&#x7684;&#x8BED;&#x8A00;&#x529F;&#x80FD;&#x7684;&#x9650;&#x5236;&#x3002;&#x6837;&#x5F0F;&#x6307;&#x5357;&#x4F7F;&#x4EE3;&#x7801;&#x66F4;&#x6613;&#x4E8E;&#x9605;&#x8BFB;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x51CF;&#x5C11;&#x67D0;&#x4E9B;&#x7C7B;&#x578B;&#x7684;&#x9519;&#x8BEF;&#x3002;</p>
</blockquote>
<p>Interfaces. An interface with multiple implementations is another example of consistency. Once you understand one implementation of the interface, any other implementation becomes easier to understand because you already know the features it will have to provide.</p>
<blockquote>
<p>&#x63A5;&#x53E3;&#x3002;&#x5177;&#x6709;&#x591A;&#x4E2A;&#x5B9E;&#x73B0;&#x7684;&#x63A5;&#x53E3;&#x662F;&#x4E00;&#x81F4;&#x6027;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x793A;&#x4F8B;&#x3002;&#x4E00;&#x65E6;&#x4E86;&#x89E3;&#x4E86;&#x63A5;&#x53E3;&#x7684;&#x4E00;&#x79CD;&#x5B9E;&#x73B0;&#xFF0C;&#x5176;&#x4ED6;&#x4EFB;&#x4F55;&#x5B9E;&#x73B0;&#x90FD;&#x5C06;&#x53D8;&#x5F97;&#x66F4;&#x6613;&#x4E8E;&#x7406;&#x89E3;&#xFF0C;&#x56E0;&#x4E3A;&#x60A8;&#x5DF2;&#x7ECF;&#x77E5;&#x9053;&#x5B83;&#x5C06;&#x5FC5;&#x987B;&#x63D0;&#x4F9B;&#x7684;&#x529F;&#x80FD;&#x3002;</p>
</blockquote>
<p>Design patterns. Design patterns are generally-accepted solutions to certain common problems, such as the model-view-controller approach to user interface design. If you can use an existing design pattern to solve the problem, the implementation will proceed more quickly, it is more likely to work, and your code will be more obvious to readers. Design patterns are discussed in more detail in Section 19.5.</p>
<p>&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x3002;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x662F;&#x67D0;&#x4E9B;&#x5E38;&#x89C1;&#x95EE;&#x9898;&#x7684;&#x666E;&#x904D;&#x63A5;&#x53D7;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x4F8B;&#x5982;&#x7528;&#x4E8E;&#x7528;&#x6237;&#x754C;&#x9762;&#x8BBE;&#x8BA1;&#x7684;&#x6A21;&#x578B;&#x89C6;&#x56FE;&#x63A7;&#x5236;&#x5668;&#x65B9;&#x6CD5;&#x3002;&#x5982;&#x679C;&#x60A8;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x73B0;&#x6709;&#x7684;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x6765;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#xFF0C;&#x5219;&#x5B9E;&#x73B0;&#x4F1A;&#x66F4;&#x5FEB;&#x5730;&#x8FDB;&#x884C;&#xFF0C;&#x66F4;&#x6709;&#x53EF;&#x80FD;&#x8D77;&#x4F5C;&#x7528;&#xFF0C;&#x5E76;&#x4E14;&#x60A8;&#x7684;&#x4EE3;&#x7801;&#x5BF9;&#x8BFB;&#x8005;&#x6765;&#x8BF4;&#x4E5F;&#x4F1A;&#x66F4;&#x660E;&#x663E;&#x3002;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x5C06;&#x5728; 19.5 &#x8282;&#x4E2D;&#x8BE6;&#x7EC6;&#x8BA8;&#x8BBA;&#x3002;</p>
<p>Invariants. An invariant is a property of a variable or structure that is always true. For example, a data structure storing lines of text might enforce an invariant that each line is terminated by a newline character. Invariants reduce the number of special cases that must be considered in code and make it easier to reason about the code&#x2019;s behavior.</p>
<p>&#x4E0D;&#x53D8;&#x91CF;&#x3002;&#x4E0D;&#x53D8;&#x5F0F;&#x662F;&#x59CB;&#x7EC8;&#x4E3A;&#x771F;&#x7684;&#x53D8;&#x91CF;&#x6216;&#x7ED3;&#x6784;&#x7684;&#x5C5E;&#x6027;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5B58;&#x50A8;&#x6587;&#x672C;&#x884C;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x53EF;&#x80FD;&#x4F1A;&#x5F3A;&#x5236;&#x8981;&#x6C42;&#x6BCF;&#x884C;&#x4EE5;&#x6362;&#x884C;&#x7B26;&#x7EC8;&#x6B62;&#x3002;&#x4E0D;&#x53D8;&#x5F0F;&#x51CF;&#x5C11;&#x4E86;&#x4EE3;&#x7801;&#x4E2D;&#x5FC5;&#x987B;&#x8003;&#x8651;&#x7684;&#x7279;&#x6B8A;&#x60C5;&#x51B5;&#x7684;&#x6570;&#x91CF;&#xFF0C;&#x5E76;&#x4F7F;&#x63A8;&#x7406;&#x884C;&#x4E3A;&#x7684;&#x65B9;&#x5F0F;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x5BB9;&#x6613;&#x3002;</p>
<h2 id="172-ensuring-consistency-&#x786E;&#x4FDD;&#x4E00;&#x81F4;&#x6027;">17.2 Ensuring consistency &#x786E;&#x4FDD;&#x4E00;&#x81F4;&#x6027;</h2>
<p>Consistency is hard to maintain, especially when many people work on a project over a long time. People in one group may not know about conventions established in another group. Newcomers don&#x2019;t know the rules, so they unintentionally violate the conventions and create new conventions that conflict with existing ones. Here are a few tips for establishing and maintaining consistency:</p>
<blockquote>
<p>&#x4E00;&#x81F4;&#x6027;&#x5F88;&#x96BE;&#x7EF4;&#x62A4;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x5F53;&#x8BB8;&#x591A;&#x4EBA;&#x957F;&#x65F6;&#x95F4;&#x4ECE;&#x4E8B;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x65F6;&#x3002;&#x4E00;&#x7EC4;&#x4EBA;&#x53EF;&#x80FD;&#x4E0D;&#x4E86;&#x89E3;&#x53E6;&#x4E00;&#x7EC4;&#x4E2D;&#x5EFA;&#x7ACB;&#x7684;&#x7EA6;&#x5B9A;&#x3002;&#x65B0;&#x6765;&#x8005;&#x4E0D;&#x4E86;&#x89E3;&#x89C4;&#x5219;&#xFF0C;&#x56E0;&#x6B64;&#x4ED6;&#x4EEC;&#x65E0;&#x610F;&#x95F4;&#x8FDD;&#x53CD;&#x4E86;&#x7EA6;&#x5B9A;&#x5E76;&#x521B;&#x5EFA;&#x4E86;&#x4E0E;&#x73B0;&#x6709;&#x7EA6;&#x5B9A;&#x51B2;&#x7A81;&#x7684;&#x65B0;&#x7EA6;&#x5B9A;&#x3002;&#x4EE5;&#x4E0B;&#x662F;&#x5EFA;&#x7ACB;&#x548C;&#x4FDD;&#x6301;&#x4E00;&#x81F4;&#x6027;&#x7684;&#x4E00;&#x4E9B;&#x6280;&#x5DE7;&#xFF1A;</p>
</blockquote>
<p>Document. Create a document that lists the most important overall conventions, such as coding style guidelines. Place the document in a spot where developers are likely to see it, such as a conspicuous place on the project Wiki. Encourage new people joining the group to read the document, and encourage existing people to review it every once in a while. Several style guides from various organizations have been published on the Web; consider starting with one of these.</p>
<blockquote>
<p>&#x6587;&#x732E;&#x3002;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5217;&#x51FA;&#x6700;&#x91CD;&#x8981;&#x7684;&#x603B;&#x4F53;&#x7EA6;&#x5B9A;&#x7684;&#x6587;&#x6863;&#xFF0C;&#x4F8B;&#x5982;&#x7F16;&#x7801;&#x6837;&#x5F0F;&#x51C6;&#x5219;&#x3002;&#x5C06;&#x6587;&#x6863;&#x653E;&#x7F6E;&#x5728;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x53EF;&#x80FD;&#x4F1A;&#x770B;&#x5230;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x4F8B;&#x5982;&#x9879;&#x76EE; Wiki &#x4E0A;&#x7684;&#x663E;&#x773C;&#x4F4D;&#x7F6E;&#x3002;&#x9F13;&#x52B1;&#x65B0;&#x6210;&#x5458;&#x52A0;&#x5165;&#x5C0F;&#x7EC4;&#x9605;&#x8BFB;&#x6587;&#x6863;&#xFF0C;&#x5E76;&#x9F13;&#x52B1;&#x73B0;&#x6709;&#x4EBA;&#x5458;&#x4E0D;&#x65F6;&#x5BA1;&#x9605;&#x8BE5;&#x6587;&#x6863;&#x3002;Web &#x4E0A;&#x5DF2;&#x7ECF;&#x53D1;&#x5E03;&#x4E86;&#x6765;&#x81EA;&#x5404;&#x4E2A;&#x7EC4;&#x7EC7;&#x7684;&#x4E00;&#x4E9B;&#x6837;&#x5F0F;&#x6307;&#x5357;&#xFF1B;&#x8003;&#x8651;&#x4ECE;&#x5176;&#x4E2D;&#x4E4B;&#x4E00;&#x5F00;&#x59CB;&#x3002;</p>
</blockquote>
<p>For conventions that are more localized, such as invariants, find an appropriate spot in the code to document them. If you don&#x2019;t write the conventions down, it&#x2019;s unlikely that other people will follow them.</p>
<blockquote>
<p>&#x5BF9;&#x4E8E;&#x5C40;&#x90E8;&#x6027;&#x66F4;&#x5F3A;&#x7684;&#x7EA6;&#x5B9A;&#xFF0C;&#x4F8B;&#x5982;&#x4E0D;&#x53D8;&#x5F0F;&#xFF0C;&#x8BF7;&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#x627E;&#x5230;&#x5408;&#x9002;&#x7684;&#x4F4D;&#x7F6E;&#x8FDB;&#x884C;&#x8BB0;&#x5F55;&#x3002;&#x5982;&#x679C;&#x60A8;&#x4E0D;&#x5199;&#x4E0B;&#x7EA6;&#x5B9A;&#xFF0C;&#x90A3;&#x4E48;&#x5176;&#x4ED6;&#x4EBA;&#x4E0D;&#x592A;&#x53EF;&#x80FD;&#x4F1A;&#x9075;&#x5FAA;&#x5B83;&#x4EEC;&#x3002;</p>
</blockquote>
<p>Enforce. Even with good documentation, it&#x2019;s hard for developers to remember all of the conventions. The best way to enforce conventions is to write a tool that checks for violations, and make sure that code cannot be committed to the repository unless it passes the checker. Automated checkers work particularly well for low-level syntactic conventions.</p>
<blockquote>
<p>&#x6267;&#x884C;&#x3002;&#x5373;&#x4F7F;&#x6709;&#x597D;&#x7684;&#x6587;&#x6863;&#xFF0C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x4E5F;&#x5F88;&#x96BE;&#x8BB0;&#x4F4F;&#x6240;&#x6709;&#x7EA6;&#x5B9A;&#x3002;&#x5B9E;&#x65BD;&#x7EA6;&#x5B9A;&#x7684;&#x6700;&#x4F73;&#x65B9;&#x6CD5;&#x662F;&#x7F16;&#x5199;&#x4E00;&#x4E2A;&#x68C0;&#x67E5;&#x8FDD;&#x89C4;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x5E76;&#x786E;&#x4FDD;&#x9664;&#x975E;&#x901A;&#x8FC7;&#x68C0;&#x67E5;&#x7A0B;&#x5E8F;&#xFF0C;&#x5426;&#x5219;&#x4EE3;&#x7801;&#x65E0;&#x6CD5;&#x63D0;&#x4EA4;&#x5230;&#x5B58;&#x50A8;&#x5E93;&#x3002;&#x81EA;&#x52A8;&#x68C0;&#x67E5;&#x5668;&#x5BF9;&#x4E8E;&#x5E95;&#x5C42;&#x8BED;&#x6CD5;&#x7EA6;&#x5B9A;&#x7279;&#x522B;&#x6709;&#x7528;&#x3002;</p>
</blockquote>
<p>One of my recent projects had problems with line termination characters. Some developers worked on Unix, where lines are terminated by newlines; others worked on Windows, where lines are normally terminated by a carriage-return followed by a newline. If a developer on one system made a small edit to a file previously edited on the other system, the editor would sometimes replace all of the line terminators with ones appropriate for that system. This gave the appearance that every line of the file had been modified, which made it hard to track the meaningful changes. We established a convention that files should contain newlines only, but it was hard to ensure that every tool used by every developer followed the convention. Every time a new developer joined the project, we would experience a rash of line termination problems while that developer adjusted to the convention.</p>
<blockquote>
<p>&#x6211;&#x6700;&#x8FD1;&#x7684;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x6709;&#x884C;&#x7EC8;&#x6B62;&#x5B57;&#x7B26;&#x7684;&#x95EE;&#x9898;&#x3002;&#x4E00;&#x4E9B;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5728; Unix &#x4E0A;&#x5DE5;&#x4F5C;&#xFF0C;&#x884C;&#x88AB;&#x6362;&#x884C;&#x7EC8;&#x6B62;;&#x5176;&#x4ED6;&#x7684;&#x5DE5;&#x4F5C;&#x5728; Windows &#x4E0A;&#xFF0C;&#x884C;&#x901A;&#x5E38;&#x7531;&#x4E00;&#x4E2A; carriage-return &#x540E;&#x8DDF;&#x4E00;&#x4E2A;&#x6362;&#x884C;&#x7B26;&#x6765;&#x7ED3;&#x675F;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x4E0A;&#x7684;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5BF9;&#x5148;&#x524D;&#x5728;&#x53E6;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x4E0A;&#x7F16;&#x8F91;&#x8FC7;&#x7684;&#x6587;&#x4EF6;&#x8FDB;&#x884C;&#x4E86;&#x5C0F;&#x7684;&#x7F16;&#x8F91;&#xFF0C;&#x90A3;&#x4E48;&#x7F16;&#x8F91;&#x5668;&#x6709;&#x65F6;&#x4F1A;&#x5C06;&#x6240;&#x6709;&#x884C;&#x7EC8;&#x6B62;&#x7B26;&#x66FF;&#x6362;&#x4E3A;&#x9002;&#x5408;&#x8BE5;&#x7CFB;&#x7EDF;&#x7684;&#x884C;&#x7EC8;&#x6B62;&#x7B26;&#x3002;&#x8FD9;&#x7ED9;&#x4EBA;&#x7684;&#x611F;&#x89C9;&#x662F;&#x6587;&#x4EF6;&#x7684;&#x6BCF;&#x4E00;&#x884C;&#x90FD;&#x88AB;&#x4FEE;&#x6539;&#x4E86;&#xFF0C;&#x8FD9;&#x4F7F;&#x5F97;&#x8DDF;&#x8E2A;&#x6709;&#x610F;&#x4E49;&#x7684;&#x66F4;&#x6539;&#x53D8;&#x5F97;&#x5F88;&#x56F0;&#x96BE;&#x3002;&#x6211;&#x4EEC;&#x5EFA;&#x7ACB;&#x4E86;&#x4E00;&#x4E2A;&#x7EA6;&#x5B9A;&#xFF0C;&#x5373;&#x6587;&#x4EF6;&#x5E94;&#x8BE5;&#x53EA;&#x5305;&#x542B;&#x6362;&#x884C;&#xFF0C;&#x4F46;&#x662F;&#x5F88;&#x96BE;&#x786E;&#x4FDD;&#x6BCF;&#x4E2A;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x4F7F;&#x7528;&#x7684;&#x6BCF;&#x4E2A;&#x5DE5;&#x5177;&#x90FD;&#x9075;&#x5FAA;&#x8FD9;&#x4E2A;&#x7EA6;&#x5B9A;&#x3002;&#x6BCF;&#x5F53;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x52A0;&#x5165;&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x4F1A;&#x7ECF;&#x5386;&#x4E00;&#x8FDE;&#x4E32;&#x7684;&#x7EBF;&#x8DEF;&#x7EC8;&#x6B62;&#x95EE;&#x9898;&#xFF0C;&#x800C;&#x90A3;&#x4E2A;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5C31;&#x4F1A;&#x9002;&#x5E94;&#x8FD9;&#x4E2A;&#x7EA6;&#x5B9A;&#x3002;</p>
</blockquote>
<p>We eventually solved this problem by writing a short script that was executed automatically before changes are committed to the source code repository. The script checks all of the files that have been modified and aborts the commit if any of them contain carriage returns. The script can also be run manually to repair damaged files by replacing carriage-return/newline sequences with newlines. This instantly eliminated the problems, and it also helped train new developers.</p>
<blockquote>
<p>&#x6211;&#x4EEC;&#x6700;&#x7EC8;&#x901A;&#x8FC7;&#x7F16;&#x5199;&#x4E00;&#x4E2A;&#x7B80;&#x77ED;&#x7684;&#x811A;&#x672C;&#x89E3;&#x51B3;&#x4E86;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x8BE5;&#x811A;&#x672C;&#x5728;&#x66F4;&#x6539;&#x63D0;&#x4EA4;&#x5230;&#x6E90;&#x4EE3;&#x7801;&#x5B58;&#x50A8;&#x5E93;&#x4E4B;&#x524D;&#x81EA;&#x52A8;&#x6267;&#x884C;&#x3002;&#x8BE5;&#x811A;&#x672C;&#x68C0;&#x67E5;&#x6240;&#x6709;&#x5DF2;&#x4FEE;&#x6539;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x5982;&#x679C;&#x5176;&#x4E2D;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x5305;&#x542B;&#x56DE;&#x8F66;&#x7B26;&#xFF0C;&#x5219;&#x4E2D;&#x6B62;&#x63D0;&#x4EA4;&#x3002;&#x8FD8;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x7528;&#x6362;&#x884C;&#x7B26;&#x66FF;&#x6362;&#x56DE;&#x8F66;/&#x6362;&#x884C;&#x7B26;&#x5E8F;&#x5217;&#x6765;&#x624B;&#x52A8;&#x8FD0;&#x884C;&#x811A;&#x672C;&#x4EE5;&#x4FEE;&#x590D;&#x635F;&#x574F;&#x7684;&#x6587;&#x4EF6;&#x3002;&#x8FD9;&#x7ACB;&#x5373;&#x6D88;&#x9664;&#x4E86;&#x95EE;&#x9898;&#xFF0C;&#x5E76;&#x4E14;&#x8FD8;&#x5E2E;&#x52A9;&#x57F9;&#x8BAD;&#x4E86;&#x65B0;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x3002;</p>
</blockquote>
<p>Code reviews provide another opportunity for enforcing conventions and for educating new developers about the conventions. The more nit-picky that code reviewers are, the more quickly everyone on the team will learn the conventions, and the cleaner the code will be.</p>
<blockquote>
<p>&#x4EE3;&#x7801;&#x5BA1;&#x67E5;&#x4E3A;&#x5B9E;&#x65BD;&#x7EA6;&#x5B9A;&#x548C;&#x5411;&#x65B0;&#x5F00;&#x53D1;&#x8005;&#x63D0;&#x4F9B;&#x6709;&#x5173;&#x7EA6;&#x5B9A;&#x7684;&#x6559;&#x80B2;&#x63D0;&#x4F9B;&#x4E86;&#x53E6;&#x4E00;&#x4E2A;&#x673A;&#x4F1A;&#x3002;&#x4EE3;&#x7801;&#x5BA1;&#x9605;&#x8005;&#x8D8A;&#x6311;&#x5254;&#xFF0C;&#x56E2;&#x961F;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x5C06;&#x66F4;&#x5FEB;&#x5730;&#x5B66;&#x4E60;&#x7EA6;&#x5B9A;&#xFF0C;&#x5E76;&#x4E14;&#x4EE3;&#x7801;&#x8D8A;&#x5E72;&#x51C0;&#x3002;</p>
</blockquote>
<p>When in Rome ... The most important convention of all is that every developer should follow the old adage &#x201C;When in Rome, do as the Romans do.&#x201D; When working in a new file, look around to see how the existing code is structured. Are all public variables and methods declared before private ones? Are the methods in alphabetical order? Do variables use &#x201C;camel case,&#x201D; as in firstServerName, or &#x201C;snake case,&#x201D; as in first_server_name? When you see anything that looks like it might possibly be a convention, follow it. When making a design decision, ask yourself if it&#x2019;s likely that a similar decision was made elsewhere in the project; if so, find an existing example and use the same approach in your new code.</p>
<blockquote>
<p>&#x5728;&#x7F57;&#x9A6C;&#x65F6;&#x2026;&#x2026;&#x6700;&#x91CD;&#x8981;&#x7684;&#x7EA6;&#x5B9A;&#x662F;&#x6BCF;&#x4E2A;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x90FD;&#x5E94;&#x9075;&#x5FAA;&#x53E4;&#x8001;&#x7684;&#x683C;&#x8A00;&#x201C;&#x5728;&#x7F57;&#x9A6C;&#x65F6;&#xFF0C;&#x5C31;&#x50CF;&#x7F57;&#x9A6C;&#x4EBA;&#x4E00;&#x6837;&#x3002;&#x201D; &#x5728;&#x5904;&#x7406;&#x65B0;&#x6587;&#x4EF6;&#x65F6;&#xFF0C;&#x8BF7;&#x73AF;&#x987E;&#x56DB;&#x5468;&#x4EE5;&#x4E86;&#x89E3;&#x73B0;&#x6709;&#x4EE3;&#x7801;&#x7684;&#x7ED3;&#x6784;&#x3002;&#x662F;&#x5426;&#x5728;&#x79C1;&#x6709;&#x53D8;&#x91CF;&#x548C;&#x65B9;&#x6CD5;&#x4E4B;&#x524D;&#x58F0;&#x660E;&#x4E86;&#x6240;&#x6709;&#x516C;&#x5171;&#x53D8;&#x91CF;&#x548C;&#x65B9;&#x6CD5;&#xFF1F;&#x65B9;&#x6CD5;&#x662F;&#x5426;&#x6309;&#x5B57;&#x6BCD;&#x987A;&#x5E8F;&#x6392;&#x5217;&#xFF1F;&#x53D8;&#x91CF;&#x662F;&#x5426;&#x4F7F;&#x7528; firstServerName &#x4E2D;&#x7684;&#x201C; camel case&#x201D;&#x6216;&#x4F7F;&#x7528; first_server_name &#x4E2D;&#x7684;&#x201C; snake case&#x201D;&#xFF1F;&#x5F53;&#x60A8;&#x770B;&#x5230;&#x4EFB;&#x4F55;&#x770B;&#x8D77;&#x6765;&#x53EF;&#x80FD;&#x662F;&#x7EA6;&#x5B9A;&#x7684;&#x5185;&#x5BB9;&#x65F6;&#xFF0C;&#x8BF7;&#x9075;&#x5FAA;&#x8BE5;&#x7EA6;&#x5B9A;&#x3002;&#x5728;&#x505A;&#x51FA;&#x8BBE;&#x8BA1;&#x51B3;&#x7B56;&#x65F6;&#xFF0C;&#x8BF7;&#x95EE;&#x81EA;&#x5DF1;&#x662F;&#x5426;&#x6709;&#x53EF;&#x80FD;&#x5728;&#x9879;&#x76EE;&#x7684;&#x5176;&#x4ED6;&#x5730;&#x65B9;&#x505A;&#x51FA;&#x4E86;&#x7C7B;&#x4F3C;&#x7684;&#x51B3;&#x7B56;&#xFF1B;&#x5982;&#x679C;&#x662F;&#x8FD9;&#x6837;&#xFF0C;&#x8BF7;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x73B0;&#x6709;&#x793A;&#x4F8B;&#xFF0C;&#x5E76;&#x5728;&#x65B0;&#x4EE3;&#x7801;&#x4E2D;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>
</blockquote>
<p>Don&#x2019;t change existing conventions. Resist the urge to &#x201C;improve&#x201D; on existing conventions. Having a &#x201C;better idea&#x201D; is not a sufficient excuse to introduce inconsistencies. Your new idea may indeed be better, but the value of consistency over inconsistency is almost always greater than the value of one approach over another. Before introducing inconsistent behavior, ask yourself two questions. First, do you have significant new information justifying your approach that wasn&#x2019;t available when the old convention was established? Second, is the new approach so much better that it is worth taking the time to update all of the old uses? If your organization agrees that the answers to both questions are &#x201C;yes,&#x201D; then go ahead and make the upgrade; when you are done, there should be no sign of the old convention. However, you still run the risk that other developers will not know about the new convention, so they may reintroduce the old approach in the future. Overall, reconsidering established conventions is rarely a good use of developer time.</p>
<blockquote>
<p>&#x4E0D;&#x8981;&#x66F4;&#x6539;&#x73B0;&#x6709;&#x7EA6;&#x5B9A;&#x3002;&#x62B5;&#x5236;&#x201C;&#x6539;&#x5584;&#x201D;&#x73B0;&#x6709;&#x516C;&#x7EA6;&#x7684;&#x51B2;&#x52A8;&#x3002;&#x62E5;&#x6709;&#x4E00;&#x4E2A;&#x201C;&#x66F4;&#x597D;&#x7684;&#x4E3B;&#x610F;&#x201D;&#x4E0D;&#x8DB3;&#x4EE5;&#x5F15;&#x8D77;&#x77DB;&#x76FE;&#x3002;&#x60A8;&#x7684;&#x65B0;&#x60F3;&#x6CD5;&#x53EF;&#x80FD;&#x786E;&#x5B9E;&#x66F4;&#x597D;&#xFF0C;&#x4F46;&#x662F;&#x4E00;&#x81F4;&#x6027;&#x80DC;&#x4E8E;&#x4E0D;&#x4E00;&#x81F4;&#x7684;&#x4EF7;&#x503C;&#x51E0;&#x4E4E;&#x603B;&#x662F;&#x5927;&#x4E8E;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x80DC;&#x8FC7;&#x53E6;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x7684;&#x4EF7;&#x503C;&#x3002;&#x5728;&#x5F15;&#x5165;&#x4E0D;&#x4E00;&#x81F4;&#x7684;&#x884C;&#x4E3A;&#x4E4B;&#x524D;&#xFF0C;&#x8BF7;&#x95EE;&#x81EA;&#x5DF1;&#x4E24;&#x4E2A;&#x95EE;&#x9898;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x60A8;&#x662F;&#x5426;&#x62E5;&#x6709;&#x5927;&#x91CF;&#x7684;&#x65B0;&#x4FE1;&#x606F;&#x6765;&#x8BC1;&#x660E;&#x60A8;&#x7684;&#x65B9;&#x6CD5;&#x5728;&#x5EFA;&#x7ACB;&#x65E7;&#x7EA6;&#x5B9A;&#x65F6;&#x662F;&#x4E0D;&#x53EF;&#x7528;&#x7684;&#xFF1F;&#x5176;&#x6B21;&#xFF0C;&#x65B0;&#x65B9;&#x6CD5;&#x662F;&#x5426;&#x597D;&#x5F97;&#x591A;&#xFF0C;&#x503C;&#x5F97;&#x82B1;&#x65F6;&#x95F4;&#x66F4;&#x65B0;&#x6240;&#x6709;&#x65E7;&#x7528;&#x6CD5;&#xFF1F;&#x5982;&#x679C;&#x60A8;&#x7684;&#x7EC4;&#x7EC7;&#x540C;&#x610F;&#x5BF9;&#x4E24;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x56DE;&#x7B54;&#x5747;&#x4E3A;&#x201C;&#x662F;&#x201D;&#xFF0C;&#x5219;&#x7EE7;&#x7EED;&#x8FDB;&#x884C;&#x5347;&#x7EA7;&#xFF1B;&#x5426;&#x5219;&#xFF0C;&#x8BF7;&#x8FDB;&#x884C;&#x5347;&#x7EA7;&#x3002;&#x5B8C;&#x6210;&#x540E;&#xFF0C;&#x5E94;&#x8BE5;&#x6CA1;&#x6709;&#x65E7;&#x7EA6;&#x5B9A;&#x7684;&#x8FF9;&#x8C61;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x60A8;&#x4ECD;&#x7136;&#x5192;&#x7740;&#x5176;&#x4ED6;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x4E0D;&#x4E86;&#x89E3;&#x65B0;&#x7EA6;&#x5B9A;&#x7684;&#x98CE;&#x9669;&#xFF0C;&#x56E0;&#x6B64;&#x4ED6;&#x4EEC;&#x5C06;&#x6765;&#x53EF;&#x80FD;&#x4F1A;&#x91CD;&#x65B0;&#x5F15;&#x5165;&#x65E7;&#x65B9;&#x6CD5;&#x3002;&#x603B;&#x4F53;&#x800C;&#x8A00;&#xFF0C;&#x91CD;&#x65B0;&#x8003;&#x8651;&#x5DF2;&#x5EFA;&#x7ACB;&#x7684;&#x7EA6;&#x5B9A;&#x5F88;&#x5C11;&#x4F1A;&#x5F88;&#x597D;&#x5730;&#x5229;&#x7528;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x65F6;&#x95F4;&#x3002;</p>
</blockquote>
<h2 id="173-taking-it-too-far-&#x8D70;&#x5F97;&#x592A;&#x8FDC;">17.3 Taking it too far &#x8D70;&#x5F97;&#x592A;&#x8FDC;</h2>
<p>Consistency means not only that similar things should be done in similar ways, but that dissimilar things should be done in different ways. If you become overzealous about consistency and try to force dissimilar things into the same approach, such as by using the same variable name for things that are really different or using an existing design pattern for a task that doesn&#x2019;t fit the pattern, you&#x2019;ll create complexity and confusion. Consistency only provides benefits when developers have confidence that &#x201C;if it looks like an x, it really is an x.&#x201D;</p>
<blockquote>
<p>&#x4E00;&#x81F4;&#x6027;&#x4E0D;&#x4EC5;&#x610F;&#x5473;&#x7740;&#x76F8;&#x4F3C;&#x7684;&#x4E8B;&#x60C5;&#x5E94;&#x8BE5;&#x4EE5;&#x76F8;&#x4F3C;&#x7684;&#x65B9;&#x5F0F;&#x5B8C;&#x6210;&#xFF0C;&#x800C;&#x4E14;&#x4E0D;&#x540C;&#x7684;&#x4E8B;&#x60C5;&#x4E5F;&#x5E94;&#x8BE5;&#x4EE5;&#x4E0D;&#x540C;&#x7684;&#x65B9;&#x5F0F;&#x5B8C;&#x6210;&#x3002;&#x5982;&#x679C;&#x60A8;&#x5BF9;&#x4E00;&#x81F4;&#x6027;&#x8FC7;&#x4E8E;&#x70ED;&#x8877;&#xFF0C;&#x5E76;&#x8BD5;&#x56FE;&#x5C06;&#x4E0D;&#x540C;&#x7684;&#x4E8B;&#x7269;&#x5F3A;&#x5236;&#x91C7;&#x7528;&#x76F8;&#x540C;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x4F8B;&#x5982;&#x5BF9;&#x786E;&#x5B9E;&#x4E0D;&#x540C;&#x7684;&#x4E8B;&#x7269;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x7684;&#x53D8;&#x91CF;&#x540D;&#xFF0C;&#x6216;&#x8005;&#x5BF9;&#x4E0D;&#x9002;&#x5408;&#x8BE5;&#x6A21;&#x5F0F;&#x7684;&#x4EFB;&#x52A1;&#x4F7F;&#x7528;&#x73B0;&#x6709;&#x7684;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF0C;&#x90A3;&#x4E48;&#x4F1A;&#x9020;&#x6210;&#x590D;&#x6742;&#x6027;&#x548C;&#x6DF7;&#x4E71;&#x3002;&#x4E00;&#x81F4;&#x6027;&#x53EA;&#x6709;&#x5728;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x786E;&#x4FE1;&#x201C;&#x5982;&#x679C;&#x770B;&#x8D77;&#x6765;&#x50CF; x &#x65F6;&#xFF0C;&#x5B83;&#x786E;&#x5B9E;&#x662F; x&#x201D;&#x65F6;&#x624D;&#x6709;&#x597D;&#x5904;&#x3002;</p>
</blockquote>
<h2 id="174-conclusion-&#x7ED3;&#x8BBA;">17.4 Conclusion &#x7ED3;&#x8BBA;</h2>
<p>Consistency is another example of the investment mindset. It will take a bit of extra work to ensure consistency: work to decide on conventions, work to create automated checkers, work to look for similar situations to mimic in new code, and work in code reviews to educate the team. The return on this investment is that your code will be more obvious. Developers will be able to understand the code&#x2019;s behavior more quickly and accurately, and this will allow them to work faster, with fewer bugs.</p>
<blockquote>
<p>&#x4E00;&#x81F4;&#x6027;&#x662F;&#x6295;&#x8D44;&#x5FC3;&#x6001;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x3002;&#x786E;&#x4FDD;&#x4E00;&#x81F4;&#x6027;&#x7684;&#x5DE5;&#x4F5C;&#x5C06;&#x9700;&#x8981;&#x4E00;&#x4E9B;&#x989D;&#x5916;&#x7684;&#x5DE5;&#x4F5C;&#xFF1A;&#x786E;&#x5B9A;&#x7EA6;&#x5B9A;&#xFF0C;&#x521B;&#x5EFA;&#x81EA;&#x52A8;&#x68C0;&#x67E5;&#x7A0B;&#x5E8F;&#xFF0C;&#x5BFB;&#x627E;&#x7C7B;&#x4F3C;&#x60C5;&#x51B5;&#x4EE5;&#x6A21;&#x4EFF;&#x65B0;&#x4EE3;&#x7801;&#xFF0C;&#x4EE5;&#x53CA;&#x8FDB;&#x884C;&#x4EE3;&#x7801;&#x5BA1;&#x67E5;&#x4EE5;&#x6559;&#x80B2;&#x56E2;&#x961F;&#x3002;&#x8FD9;&#x9879;&#x6295;&#x8D44;&#x7684;&#x56DE;&#x62A5;&#x662F;&#x60A8;&#x7684;&#x4EE3;&#x7801;&#x5C06;&#x66F4;&#x52A0;&#x660E;&#x663E;&#x3002;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5C06;&#x80FD;&#x591F;&#x66F4;&#x5FEB;&#xFF0C;&#x66F4;&#x51C6;&#x786E;&#x5730;&#x4E86;&#x89E3;&#x4EE3;&#x7801;&#x7684;&#x884C;&#x4E3A;&#xFF0C;&#x8FD9;&#x5C06;&#x4F7F;&#x4ED6;&#x4EEC;&#x80FD;&#x591F;&#x4EE5;&#x66F4;&#x5C11;&#x7684;&#x9519;&#x8BEF;&#x6765;&#x66F4;&#x5FEB;&#x5730;&#x5DE5;&#x4F5C;&#x3002;</p>
</blockquote>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="ch16.html" class="navigation navigation-prev " aria-label="Previous page: 第十六章: 修改现有的代码">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="ch18.html" class="navigation navigation-next " aria-label="Next page: 第十八章: 代码应该是显而易见的">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第十七章: 一致性","level":"1.20","depth":1,"next":{"title":"第十八章: 代码应该是显而易见的","level":"1.21","depth":1,"path":"docs/ch18.md","ref":"./docs/ch18.md","articles":[]},"previous":{"title":"第十六章: 修改现有的代码","level":"1.19","depth":1,"path":"docs/ch16.md","ref":"./docs/ch16.md","articles":[]},"dir":"ltr"},"config":{"plugins":["back-to-top-button","expandable-chapters-small","page-toc-button","livereload"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"livereload":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"page-toc-button":{},"back-to-top-button":{},"expandable-chapters-small":{},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"John Ousterhout","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"软件设计哲学","language":"zh-hans","gitbook":"*","description":"书中讨论了软件设计的主题：如何将复杂的软件系统分解成可以相对独立实现的模块(如类和方法)"},"file":{"path":"docs/ch17.md","mtime":"2020-08-06T16:26:19.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-02-06T04:55:41.669Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-page-toc-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

