
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第十八章: 代码应该是显而易见的 · 软件设计哲学</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="John Ousterhout">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-page-toc-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="ch19.html" />
    
    
    <link rel="prev" href="ch17.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    首页
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="preface">
            
                <span>
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="ch1.html">
            
                <a href="ch1.html">
            
                    
                    第一章：介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="ch2.html">
            
                <a href="ch2.html">
            
                    
                    第二章：复杂性的本质
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="ch3.html">
            
                <a href="ch3.html">
            
                    
                    第三章：工作代码是不够的（战略与战术编程）
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="ch4.html">
            
                <a href="ch4.html">
            
                    
                    第四章：模块应该是深的
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="ch5.html">
            
                <a href="ch5.html">
            
                    
                    第五章：信息隐藏(和泄露)
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="ch6.html">
            
                <a href="ch6.html">
            
                    
                    第六章：通用模块更深入
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="ch7.html">
            
                <a href="ch7.html">
            
                    
                    第七章: 不同的层，不同的抽象
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="ch8.html">
            
                <a href="ch8.html">
            
                    
                    第八章: 降低复杂性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="ch9.html">
            
                <a href="ch9.html">
            
                    
                    第九章: 在一起更好还是分开更好？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="ch10.html">
            
                <a href="ch10.html">
            
                    
                    第十章: 定义不存在的错误
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="ch11.html">
            
                <a href="ch11.html">
            
                    
                    第十一章: 设计它两次
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="ch12.html">
            
                <a href="ch12.html">
            
                    
                    第十二章: 为什么写注释？四个理由
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="ch13.html">
            
                <a href="ch13.html">
            
                    
                    第十三章: 注释应该描述代码中不明显的内容
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="ch14.html">
            
                <a href="ch14.html">
            
                    
                    第十四章: 选择的名字
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="ch15.html">
            
                <a href="ch15.html">
            
                    
                    第十五章: 先写注释
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="ch16.html">
            
                <a href="ch16.html">
            
                    
                    第十六章: 修改现有的代码
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.20" data-path="ch17.html">
            
                <a href="ch17.html">
            
                    
                    第十七章: 一致性
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.21" data-path="ch18.html">
            
                <a href="ch18.html">
            
                    
                    第十八章: 代码应该是显而易见的
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.22" data-path="ch19.html">
            
                <a href="ch19.html">
            
                    
                    第十九章: 软件发展趋势
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.23" data-path="ch20.html">
            
                <a href="ch20.html">
            
                    
                    第二十章: 设计性能
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.24" data-path="ch21.html">
            
                <a href="ch21.html">
            
                    
                    第二十一章: 结论
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.25" data-path="summary.html">
            
                <a href="summary.html">
            
                    
                    总结
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >第十八章: 代码应该是显而易见的</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7B2C;-18-&#x7AE0;-&#x4EE3;&#x7801;&#x5E94;&#x8BE5;&#x662F;&#x663E;&#x800C;&#x6613;&#x89C1;&#x7684;">&#x7B2C; 18 &#x7AE0; &#x4EE3;&#x7801;&#x5E94;&#x8BE5;&#x662F;&#x663E;&#x800C;&#x6613;&#x89C1;&#x7684;</h1>
<blockquote>
<p>Chapter 18 Code Should be Obvious</p>
</blockquote>
<p>Obscurity is one of the two main causes of complexity described in Section 2.3. Obscurity occurs when important information about a system is not obvious to new developers. The solution to the obscurity problem is to write code in a way that makes it obvious; this chapter discusses some of the factors that make code more or less obvious.</p>
<blockquote>
<p>&#x6666;&#x6DA9;&#x96BE;&#x61C2;&#x662F;&#x7B2C; 2.3 &#x8282;&#x4E2D;&#x63CF;&#x8FF0;&#x7684;&#x5BFC;&#x81F4;&#x590D;&#x6742;&#x6027;&#x7684;&#x4E24;&#x4E2A;&#x4E3B;&#x8981;&#x539F;&#x56E0;&#x4E4B;&#x4E00;&#x3002;&#x5F53;&#x6709;&#x5173;&#x7CFB;&#x7EDF;&#x7684;&#x91CD;&#x8981;&#x4FE1;&#x606F;&#x5BF9;&#x4E8E;&#x65B0;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x800C;&#x8A00;&#x5E76;&#x4E0D;&#x660E;&#x663E;&#x65F6;&#xFF0C;&#x5C31;&#x4F1A;&#x53D1;&#x751F;&#x6A21;&#x7CCA;&#x3002;&#x89E3;&#x51B3;&#x6666;&#x6DA9;&#x95EE;&#x9898;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x4EE5;&#x663E;&#x800C;&#x6613;&#x89C1;&#x7684;&#x65B9;&#x5F0F;&#x7F16;&#x5199;&#x4EE3;&#x7801;&#x3002;&#x672C;&#x7AE0;&#x8BA8;&#x8BBA;&#x4F7F;&#x4EE3;&#x7801;&#x6216;&#x591A;&#x6216;&#x5C11;&#x53D8;&#x5F97;&#x663E;&#x800C;&#x6613;&#x89C1;&#x7684;&#x4E00;&#x4E9B;&#x56E0;&#x7D20;&#x3002;</p>
</blockquote>
<p>If code is obvious, it means that someone can read the code quickly, without much thought, and their first guesses about the behavior or meaning of the code will be correct. If code is obvious, a reader doesn&#x2019;t need to spend much time or effort to gather all the information they need to work with the code. If code is not obvious, then a reader must expend a lot of time and energy to understand it. Not only does this reduce their efficiency, but it also increases the likelihood of misunderstanding and bugs. Obvious code needs fewer comments than nonobvious code.</p>
<blockquote>
<p>&#x5982;&#x679C;&#x4EE3;&#x7801;&#x5F88;&#x660E;&#x663E;&#xFF0C;&#x5219;&#x610F;&#x5473;&#x7740;&#x67D0;&#x4EBA;&#x53EF;&#x4EE5;&#x4E0D;&#x52A0;&#x601D;&#x7D22;&#x5730;&#x5FEB;&#x901F;&#x9605;&#x8BFB;&#x8BE5;&#x4EE3;&#x7801;&#xFF0C;&#x5E76;&#x4E14;&#x4ED6;&#x4EEC;&#x5BF9;&#x4EE3;&#x7801;&#x7684;&#x884C;&#x4E3A;&#x6216;&#x542B;&#x4E49;&#x7684;&#x6700;&#x521D;&#x731C;&#x6D4B;&#x5C06;&#x662F;&#x6B63;&#x786E;&#x7684;&#x3002;&#x5982;&#x679C;&#x4EE3;&#x7801;&#x5F88;&#x660E;&#x663E;&#xFF0C;&#x90A3;&#x4E48;&#x8BFB;&#x8005;&#x5C31;&#x4E0D;&#x9700;&#x8981;&#x82B1;&#x8D39;&#x5F88;&#x591A;&#x65F6;&#x95F4;&#x6216;&#x7CBE;&#x529B;&#x6765;&#x6536;&#x96C6;&#x4ED6;&#x4EEC;&#x4F7F;&#x7528;&#x4EE3;&#x7801;&#x6240;&#x9700;&#x7684;&#x6240;&#x6709;&#x4FE1;&#x606F;&#x3002;&#x5982;&#x679C;&#x4EE3;&#x7801;&#x4E0D;&#x660E;&#x663E;&#xFF0C;&#x90A3;&#x4E48;&#x8BFB;&#x8005;&#x5FC5;&#x987B;&#x82B1;&#x8D39;&#x5927;&#x91CF;&#x65F6;&#x95F4;&#x548C;&#x7CBE;&#x529B;&#x6765;&#x7406;&#x89E3;&#x5B83;&#x3002;&#x8FD9;&#x4E0D;&#x4EC5;&#x964D;&#x4F4E;&#x4E86;&#x5B83;&#x4EEC;&#x7684;&#x6548;&#x7387;&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x589E;&#x52A0;&#x4E86;&#x8BEF;&#x89E3;&#x548C;&#x9519;&#x8BEF;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x3002;&#x660E;&#x663E;&#x7684;&#x4EE3;&#x7801;&#x6BD4;&#x4E0D;&#x660E;&#x663E;&#x7684;&#x4EE3;&#x7801;&#x9700;&#x8981;&#x66F4;&#x5C11;&#x7684;&#x6CE8;&#x91CA;&#x3002;</p>
</blockquote>
<p>&#x201C;Obvious&#x201D; is in the mind of the reader: it&#x2019;s easier to notice that someone else&#x2019;s code is nonobvious than to see problems with your own code. Thus, the best way to determine the obviousness of code is through code reviews. If someone reading your code says it&#x2019;s not obvious, then it&#x2019;s not obvious, no matter how clear it may seem to you. By trying to understand what made the code nonobvious, you will learn how to write better code in the future.</p>
<blockquote>
<p>&#x8BFB;&#x8005;&#x7684;&#x60F3;&#x6CD5;&#x662F;&#x201C;&#x663E;&#x800C;&#x6613;&#x89C1;&#x201D;&#xFF1A;&#x6CE8;&#x610F;&#x5230;&#x522B;&#x4EBA;&#x7684;&#x4EE3;&#x7801;&#x4E0D;&#x660E;&#x663E;&#x6BD4;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x7684;&#x4EE3;&#x7801;&#x6709;&#x95EE;&#x9898;&#x8981;&#x5BB9;&#x6613;&#x5F97;&#x591A;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x786E;&#x5B9A;&#x4EE3;&#x7801;&#x662F;&#x5426;&#x663E;&#x800C;&#x6613;&#x89C1;&#x7684;&#x6700;&#x4F73;&#x65B9;&#x6CD5;&#x662F;&#x901A;&#x8FC7;&#x4EE3;&#x7801;&#x5BA1;&#x67E5;&#x3002;&#x5982;&#x679C;&#x6709;&#x4EBA;&#x5728;&#x9605;&#x8BFB;&#x60A8;&#x7684;&#x4EE3;&#x7801;&#x65F6;&#x8BF4;&#x5B83;&#x5E76;&#x4E0D;&#x660E;&#x663E;&#xFF0C;&#x90A3;&#x4E48;&#x65E0;&#x8BBA;&#x60A8;&#x770B;&#x8D77;&#x6765;&#x591A;&#x4E48;&#x6E05;&#x6670;&#xFF0C;&#x5B83;&#x4E5F;&#x4E0D;&#x662F;&#x663E;&#x800C;&#x6613;&#x89C1;&#x3002;&#x901A;&#x8FC7;&#x5C1D;&#x8BD5;&#x7406;&#x89E3;&#x4EC0;&#x4E48;&#x4F7F;&#x4EE3;&#x7801;&#x53D8;&#x5F97;&#x4E0D;&#x660E;&#x663E;&#xFF0C;&#x60A8;&#x5C06;&#x5B66;&#x4E60;&#x5982;&#x4F55;&#x5728;&#x5C06;&#x6765;&#x7F16;&#x5199;&#x66F4;&#x597D;&#x7684;&#x4EE3;&#x7801;&#x3002;</p>
</blockquote>
<h2 id="181-things-that-make-code-more-obvious">18.1 Things that make code more obvious</h2>
<p>Two of the most important techniques for making code obvious have already been discussed in previous chapters. The first is choosing good names (Chapter 14). Precise and meaningful names clarify the behavior of the code and reduce the need for documentation. If a name is vague or ambiguous, then readers will have read through the code in order to deduce the meaning of the named entity; this is time-consuming and error-prone. The second technique is consistency (Chapter 17). If similar things are always done in similar ways, then readers can recognize patterns they have seen before and immediately draw (safe) conclusions without analyzing the code in detail.</p>
<blockquote>
<p>&#x5728;&#x524D;&#x9762;&#x7684;&#x7AE0;&#x8282;&#x4E2D;&#x5DF2;&#x7ECF;&#x8BA8;&#x8BBA;&#x4E86;&#x4F7F;&#x4EE3;&#x7801;&#x663E;&#x800C;&#x6613;&#x89C1;&#x7684;&#x4E24;&#x79CD;&#x6700;&#x91CD;&#x8981;&#x7684;&#x6280;&#x672F;&#x3002;&#x9996;&#x5148;&#x662F;&#x9009;&#x62E9;&#x597D;&#x540D;&#x5B57;&#xFF08;&#x7B2C; 14 &#x7AE0;&#xFF09;&#x3002;&#x7CBE;&#x786E;&#x800C;&#x6709;&#x610F;&#x4E49;&#x7684;&#x540D;&#x79F0;&#x53EF;&#x4EE5;&#x9610;&#x660E;&#x4EE3;&#x7801;&#x7684;&#x884C;&#x4E3A;&#xFF0C;&#x5E76;&#x51CF;&#x5C11;&#x5BF9;&#x6587;&#x6863;&#x7684;&#x9700;&#x6C42;&#x3002;&#x5982;&#x679C;&#x540D;&#x79F0;&#x542B;&#x7CCA;&#x4E0D;&#x6E05;&#x6216;&#x542B;&#x7CCA;&#x4E0D;&#x6E05;&#xFF0C;&#x90A3;&#x4E48;&#x8BFB;&#x8005;&#x5C06;&#x901A;&#x8BFB;&#x4EE3;&#x7801;&#x4EE5;&#x63A8;&#x8BBA;&#x547D;&#x540D;&#x5B9E;&#x4F53;&#x7684;&#x542B;&#x4E49;&#xFF1B;&#x8FD9;&#x65E2;&#x8D39;&#x65F6;&#x53C8;&#x5BB9;&#x6613;&#x51FA;&#x9519;&#x3002;&#x7B2C;&#x4E8C;&#x79CD;&#x6280;&#x672F;&#x662F;&#x4E00;&#x81F4;&#x6027;&#xFF08;&#x7B2C; 17 &#x7AE0;&#xFF09;&#x3002;&#x5982;&#x679C;&#x603B;&#x662F;&#x4EE5;&#x76F8;&#x4F3C;&#x7684;&#x65B9;&#x5F0F;&#x5B8C;&#x6210;&#x76F8;&#x4F3C;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x90A3;&#x4E48;&#x8BFB;&#x8005;&#x53EF;&#x4EE5;&#x8BC6;&#x522B;&#x51FA;&#x4ED6;&#x4EEC;&#x4EE5;&#x524D;&#x6240;&#x89C1;&#x8FC7;&#x7684;&#x6A21;&#x5F0F;&#xFF0C;&#x5E76;&#x7ACB;&#x5373;&#x5F97;&#x51FA;&#xFF08;&#x5B89;&#x5168;&#xFF09;&#x7ED3;&#x8BBA;&#xFF0C;&#x800C;&#x65E0;&#x9700;&#x8BE6;&#x7EC6;&#x5206;&#x6790;&#x4EE3;&#x7801;&#x3002;</p>
</blockquote>
<p>Here are a few other general-purpose techniques for making code more obvious:</p>
<blockquote>
<p>&#x4EE5;&#x4E0B;&#x662F;&#x4F7F;&#x4EE3;&#x7801;&#x66F4;&#x660E;&#x663E;&#x7684;&#x5176;&#x4ED6;&#x4E00;&#x4E9B;&#x901A;&#x7528;&#x6280;&#x672F;&#xFF1A;</p>
</blockquote>
<p>Judicious use of white space. The way code is formatted can impact how easy it is to understand. Consider the following parameter documentation, in which whitespace has been squeezed out:</p>
<blockquote>
<p>&#x660E;&#x667A;&#x5730;&#x4F7F;&#x7528;&#x7A7A;&#x767D;&#x3002;&#x4EE3;&#x7801;&#x683C;&#x5F0F;&#x5316;&#x7684;&#x65B9;&#x5F0F;&#x4F1A;&#x5F71;&#x54CD;&#x5176;&#x7406;&#x89E3;&#x7684;&#x5BB9;&#x6613;&#x7A0B;&#x5EA6;&#x3002;&#x8003;&#x8651;&#x4EE5;&#x4E0B;&#x53C2;&#x6570;&#x6587;&#x6863;&#xFF0C;&#x5176;&#x4E2D;&#x7A7A;&#x683C;&#x5DF2;&#x88AB;&#x538B;&#x7F29;&#xFF1A;</p>
</blockquote>
<pre><code class="lang-java"><span class="hljs-comment">/**
 *  ...
 *  <span class="hljs-doctag">@param</span> numThreads The number of threads that this manager should
 *  spin up in order to manage ongoing connections. The MessageManager
 *  spins up at least one thread for every open connection, so this
 *  should be at least equal to the number of connections you expect
 *  to be open at once. This should be a multiple of that number if
 *  you expect to send a lot of messages in a short amount of time.
 *  <span class="hljs-doctag">@param</span> handler Used as a callback in order to handle incoming
 *  messages on this MessageManager&apos;s open connections. See
 *  {<span class="hljs-doctag">@code</span> MessageHandler} and {<span class="hljs-doctag">@code</span> handleMessage} for details.
 */</span>
</code></pre>
<p>It&#x2019;s hard to see where the documentation for one parameter ends and the next begins. It&#x2019;s not even obvious how many parameters there are, or what their names are. If a little whitespace is added, the structure suddenly becomes clear and the documentation is easier to scan:</p>
<blockquote>
<p>&#x5F88;&#x96BE;&#x770B;&#x5230;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x7684;&#x6587;&#x6863;&#x5728;&#x54EA;&#x91CC;&#x7ED3;&#x675F;&#x800C;&#x4E0B;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x7684;&#x6587;&#x6863;&#x5728;&#x54EA;&#x91CC;&#x5F00;&#x59CB;&#x3002;&#x751A;&#x81F3;&#x4E0D;&#x77E5;&#x9053;&#x6709;&#x591A;&#x5C11;&#x4E2A;&#x53C2;&#x6570;&#x6216;&#x5B83;&#x4EEC;&#x7684;&#x540D;&#x79F0;&#x662F;&#x4EC0;&#x4E48;&#x3002;&#x5982;&#x679C;&#x6DFB;&#x52A0;&#x4E86;&#x4E00;&#x4E9B;&#x7A7A;&#x767D;&#xFF0C;&#x7ED3;&#x6784;&#x4F1A;&#x7A81;&#x7136;&#x53D8;&#x5F97;&#x6E05;&#x6670;&#xFF0C;&#x6587;&#x6863;&#x4E5F;&#x66F4;&#x5BB9;&#x6613;&#x626B;&#x63CF;&#xFF1A;</p>
</blockquote>
<pre><code class="lang-java"><span class="hljs-comment">/**
 *  <span class="hljs-doctag">@param</span> numThreads
 *           The number of threads that this manager should spin up in
 *           order to manage ongoing connections. The MessageManager spins
 *           up at least one thread for every open connection, so this
 *           should be at least equal to the number of connections you
 *           expect to be open at once. This should be a multiple of that
 *           number if you expect to send a lot of messages in a short
 *           amount of time.
 *  <span class="hljs-doctag">@param</span> handler
 *           Used as a callback in order to handle incoming messages on
 *           this MessageManager&apos;s open connections. See
 *           {<span class="hljs-doctag">@code</span> MessageHandler} and {<span class="hljs-doctag">@code</span> handleMessage} for details.
 */</span>
</code></pre>
<p>Blank lines are also useful to separate major blocks of code within a method, such as in the following example:</p>
<blockquote>
<p>&#x7A7A;&#x884C;&#x4E5F;&#x53EF;&#x7528;&#x4E8E;&#x5206;&#x9694;&#x65B9;&#x6CD5;&#x4E2D;&#x7684;&#x4E3B;&#x8981;&#x4EE3;&#x7801;&#x5757;&#xFF0C;&#x4F8B;&#x5982;&#x4EE5;&#x4E0B;&#x793A;&#x4F8B;&#xFF1A;</p>
</blockquote>
<pre><code class="lang-cpp"><span class="hljs-keyword">void</span>* Buffer::allocAux(<span class="hljs-keyword">size_t</span> numBytes) {
    <span class="hljs-comment">//  Round up the length to a multiple of 8 bytes, to ensure alignment.</span>
    <span class="hljs-keyword">uint32_t</span> numBytes32 =  (downCast&lt;<span class="hljs-keyword">uint32_t</span>&gt;(numBytes) + <span class="hljs-number">7</span>) &amp; ~<span class="hljs-number">0x7</span>;
    assert(numBytes32 != <span class="hljs-number">0</span>);

    <span class="hljs-comment">//  If there is enough memory at firstAvailable, use that. Work down</span>
    <span class="hljs-comment">//  from the top, because this memory is guaranteed to be aligned</span>
    <span class="hljs-comment">//  (memory at the bottom may have been used for variable-size chunks).</span>
    <span class="hljs-keyword">if</span>  (availableLength &gt;= numBytes32) {
        availableLength -= numBytes32;
        <span class="hljs-keyword">return</span> firstAvailable + availableLength;
    }

    <span class="hljs-comment">//  Next, see if there is extra space at the end of the last chunk.</span>
    <span class="hljs-keyword">if</span>  (extraAppendBytes &gt;= numBytes32) {
        extraAppendBytes -= numBytes32;
        <span class="hljs-keyword">return</span> lastChunk-&gt;data + lastChunk-&gt;length + extraAppendBytes;
    }

    <span class="hljs-comment">//  Must create a new space allocation; allocate space within it.</span>
    <span class="hljs-keyword">uint32_t</span> allocatedLength;
    firstAvailable = getNewAllocation(numBytes32, &amp;allocatedLength);
    availableLength = allocatedLength numBytes32;
    <span class="hljs-keyword">return</span> firstAvailable + availableLength;
}
</code></pre>
<p>This approach works particularly well if the first line after each blank line is a comment describing the next block of code: the blank lines make the comments more visible.</p>
<blockquote>
<p>&#x5982;&#x679C;&#x6BCF;&#x4E2A;&#x7A7A;&#x767D;&#x884C;&#x4E4B;&#x540E;&#x7684;&#x7B2C;&#x4E00;&#x884C;&#x662F;&#x63CF;&#x8FF0;&#x4E0B;&#x4E00;&#x4E2A;&#x4EE3;&#x7801;&#x5757;&#x7684;&#x6CE8;&#x91CA;&#xFF0C;&#x5219;&#x6B64;&#x65B9;&#x6CD5;&#x7279;&#x522B;&#x6709;&#x6548;&#xFF1A;&#x7A7A;&#x767D;&#x884C;&#x4F7F;&#x6CE8;&#x91CA;&#x66F4;&#x53EF;&#x89C1;&#x3002;</p>
</blockquote>
<p>White space within a statement helps to clarify the structure of the statement. Compare the following two statements, one of which has whitespace and one of which doesn&#x2019;t:</p>
<blockquote>
<p>&#x8BED;&#x53E5;&#x4E2D;&#x7684;&#x7A7A;&#x767D;&#x6709;&#x52A9;&#x4E8E;&#x9610;&#x660E;&#x8BED;&#x53E5;&#x7684;&#x7ED3;&#x6784;&#x3002;&#x6BD4;&#x8F83;&#x4EE5;&#x4E0B;&#x4E24;&#x4E2A;&#x8BED;&#x53E5;&#xFF0C;&#x5176;&#x4E2D;&#x4E4B;&#x4E00;&#x5177;&#x6709;&#x7A7A;&#x683C;&#xFF0C;&#x800C;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x6CA1;&#x6709;&#x7A7A;&#x683C;&#xFF1A;</p>
</blockquote>
<pre><code class="lang-java"><span class="hljs-keyword">for</span>(<span class="hljs-keyword">int</span> pass=<span class="hljs-number">1</span>;pass&gt;=<span class="hljs-number">0</span>&amp;&amp;!empty;pass--) {

<span class="hljs-keyword">for</span> (<span class="hljs-keyword">int</span> pass = <span class="hljs-number">1</span>; pass &gt;= <span class="hljs-number">0</span> &amp;&amp; !empty; pass--) {
</code></pre>
<p>Comments. Sometimes it isn&#x2019;t possible to avoid code that is nonobvious. When this happens, it&#x2019;s important to use comments to compensate by providing the missing information. To do this well, you must put yourself in the position of the reader and figure out what is likely to confuse them, and what information will clear up that confusion. The next section shows a few examples.</p>
<blockquote>
<p>&#x6CE8;&#x91CA;&#x3002;&#x6709;&#x65F6;&#x65E0;&#x6CD5;&#x907F;&#x514D;&#x975E;&#x663E;&#x800C;&#x6613;&#x89C1;&#x7684;&#x4EE3;&#x7801;&#x3002;&#x53D1;&#x751F;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x65F6;&#xFF0C;&#x91CD;&#x8981;&#x7684;&#x662F;&#x4F7F;&#x7528;&#x6CE8;&#x91CA;&#x6765;&#x63D0;&#x4F9B;&#x7F3A;&#x5C11;&#x7684;&#x4FE1;&#x606F;&#x4EE5;&#x8FDB;&#x884C;&#x8865;&#x507F;&#x3002;&#x8981;&#x505A;&#x5230;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x60A8;&#x5FC5;&#x987B;&#x4F7F;&#x81EA;&#x5DF1;&#x5904;&#x4E8E;&#x8BFB;&#x8005;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x5F04;&#x6E05;&#x695A;&#x4EC0;&#x4E48;&#x53EF;&#x80FD;&#x4F1A;&#x4F7F;&#x4ED6;&#x4EEC;&#x611F;&#x5230;&#x56F0;&#x60D1;&#xFF0C;&#x4EE5;&#x53CA;&#x54EA;&#x4E9B;&#x4FE1;&#x606F;&#x53EF;&#x4EE5;&#x6D88;&#x9664;&#x8FD9;&#x79CD;&#x6DF7;&#x4E71;&#x3002;&#x4E0B;&#x4E00;&#x90E8;&#x5206;&#x663E;&#x793A;&#x4E86;&#x4E00;&#x4E9B;&#x793A;&#x4F8B;&#x3002;</p>
</blockquote>
<h2 id="182-things-that-make-code-less-obvious-&#x4F7F;&#x4EE3;&#x7801;&#x4E0D;&#x90A3;&#x4E48;&#x660E;&#x663E;&#x7684;&#x4E8B;&#x60C5;">18.2 Things that make code less obvious &#x4F7F;&#x4EE3;&#x7801;&#x4E0D;&#x90A3;&#x4E48;&#x660E;&#x663E;&#x7684;&#x4E8B;&#x60C5;</h2>
<p>There are many things that can make code nonobvious; this section provides a few examples. Some of these, such as event-driven programming, are useful in some situations, so you may end up using them anyway. When this happens, extra documentation can help to minimize reader confusion.</p>
<blockquote>
<p>&#x6709;&#x5F88;&#x591A;&#x4E8B;&#x60C5;&#x53EF;&#x4EE5;&#x4F7F;&#x4EE3;&#x7801;&#x53D8;&#x5F97;&#x4E0D;&#x660E;&#x663E;&#x3002;&#x672C;&#x8282;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E9B;&#x793A;&#x4F8B;&#x3002;&#x5176;&#x4E2D;&#x67D0;&#x4E9B;&#x529F;&#x80FD;&#xFF08;&#x4F8B;&#x5982;&#x4E8B;&#x4EF6;&#x9A71;&#x52A8;&#x7684;&#x7F16;&#x7A0B;&#xFF09;&#x5728;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#x5F88;&#x6709;&#x7528;&#xFF0C;&#x56E0;&#x6B64;&#x60A8;&#x53EF;&#x80FD;&#x6700;&#x7EC8;&#x8FD8;&#x662F;&#x8981;&#x4F7F;&#x7528;&#x5B83;&#x4EEC;&#x3002;&#x53D1;&#x751F;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x65F6;&#xFF0C;&#x989D;&#x5916;&#x7684;&#x6587;&#x6863;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x6700;&#x5927;&#x7A0B;&#x5EA6;&#x5730;&#x51CF;&#x5C11;&#x8BFB;&#x8005;&#x7684;&#x56F0;&#x60D1;&#x3002;</p>
</blockquote>
<p>Event-driven programming. In event-driven programming, an application responds to external occurrences, such as the arrival of a network packet or the press of a mouse button. One module is responsible for reporting incoming events. Other parts of the application register interest in certain events by asking the event module to invoke a given function or method when those events occur.</p>
<blockquote>
<p>&#x4E8B;&#x4EF6;&#x9A71;&#x52A8;&#x7684;&#x7F16;&#x7A0B;&#x3002;&#x5728;&#x4E8B;&#x4EF6;&#x9A71;&#x52A8;&#x7684;&#x7F16;&#x7A0B;&#x4E2D;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5BF9;&#x5916;&#x90E8;&#x4E8B;&#x4EF6;&#x505A;&#x51FA;&#x54CD;&#x5E94;&#xFF0C;&#x4F8B;&#x5982;&#x7F51;&#x7EDC;&#x6570;&#x636E;&#x5305;&#x7684;&#x5230;&#x6765;&#x6216;&#x6309;&#x4E0B;&#x9F20;&#x6807;&#x6309;&#x94AE;&#x3002;&#x4E00;&#x4E2A;&#x6A21;&#x5757;&#x8D1F;&#x8D23;&#x62A5;&#x544A;&#x4F20;&#x5165;&#x4E8B;&#x4EF6;&#x3002;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x5176;&#x4ED6;&#x90E8;&#x5206;&#x901A;&#x8FC7;&#x5728;&#x4E8B;&#x4EF6;&#x53D1;&#x751F;&#x65F6;&#x8981;&#x6C42;&#x4E8B;&#x4EF6;&#x6A21;&#x5757;&#x8C03;&#x7528;&#x7ED9;&#x5B9A;&#x7684;&#x51FD;&#x6570;&#x6216;&#x65B9;&#x6CD5;&#x6765;&#x6CE8;&#x518C;&#x5BF9;&#x67D0;&#x4E9B;&#x4E8B;&#x4EF6;&#x7684;&#x5174;&#x8DA3;&#x3002;</p>
</blockquote>
<p>Event-driven programming makes it hard to follow the flow of control. The event handler functions are never invoked directly; they are invoked indirectly by the event module, typically using a function pointer or interface. Even if you find the point of invocation in the event module, it still isn&#x2019;t possible to tell which specific function will be invoked: this will depend on which handlers were registered at runtime. Because of this, it&#x2019;s hard to reason about event-driven code or convince yourself that it works.</p>
<blockquote>
<p>&#x4E8B;&#x4EF6;&#x9A71;&#x52A8;&#x7684;&#x7F16;&#x7A0B;&#x4F7F;&#x5176;&#x5F88;&#x96BE;&#x9075;&#x5FAA;&#x63A7;&#x5236;&#x6D41;&#x7A0B;&#x3002;&#x6C38;&#x8FDC;&#x4E0D;&#x8981;&#x76F4;&#x63A5;&#x8C03;&#x7528;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x51FD;&#x6570;&#x3002;&#x5B83;&#x4EEC;&#x662F;&#x7531;&#x4E8B;&#x4EF6;&#x6A21;&#x5757;&#x95F4;&#x63A5;&#x8C03;&#x7528;&#x7684;&#xFF0C;&#x901A;&#x5E38;&#x4F7F;&#x7528;&#x51FD;&#x6570;&#x6307;&#x9488;&#x6216;&#x63A5;&#x53E3;&#x3002;&#x5373;&#x4F7F;&#x60A8;&#x5728;&#x4E8B;&#x4EF6;&#x6A21;&#x5757;&#x4E2D;&#x627E;&#x5230;&#x4E86;&#x8C03;&#x7528;&#x70B9;&#xFF0C;&#x4E5F;&#x4ECD;&#x7136;&#x65E0;&#x6CD5;&#x786E;&#x5B9A;&#x5C06;&#x8C03;&#x7528;&#x54EA;&#x4E2A;&#x7279;&#x5B9A;&#x529F;&#x80FD;&#xFF1A;&#x8FD9;&#x5C06;&#x53D6;&#x51B3;&#x4E8E;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x6CE8;&#x518C;&#x4E86;&#x54EA;&#x4E9B;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5F88;&#x96BE;&#x63A8;&#x7406;&#x4E8B;&#x4EF6;&#x9A71;&#x52A8;&#x7684;&#x4EE3;&#x7801;&#x6216;&#x8BF4;&#x670D;&#x81EA;&#x5DF1;&#x76F8;&#x4FE1;&#x5B83;&#x662F;&#x53EF;&#x884C;&#x7684;&#x3002;</p>
</blockquote>
<p>To compensate for this obscurity, use the interface comment for each handler function to indicate when it is invoked, as in this example:</p>
<blockquote>
<p>&#x4E3A;&#x4E86;&#x5F25;&#x8865;&#x8FD9;&#x79CD;&#x6A21;&#x7CCA;&#x6027;&#xFF0C;&#x8BF7;&#x4E3A;&#x6BCF;&#x4E2A;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x51FD;&#x6570;&#x4F7F;&#x7528;&#x63A5;&#x53E3;&#x6CE8;&#x91CA;&#xFF0C;&#x4EE5;&#x6307;&#x793A;&#x4F55;&#x65F6;&#x8C03;&#x7528;&#x8BE5;&#x51FD;&#x6570;&#xFF0C;&#x5982;&#x4EE5;&#x4E0B;&#x793A;&#x4F8B;&#x6240;&#x793A;&#xFF1A;</p>
</blockquote>
<pre><code class="lang-java"><span class="hljs-comment">/**
 * This method is invoked in the dispatch thread by a transport if a
 * transport-level error prevents an RPC from completing.
 */</span>
<span class="hljs-keyword">void</span> Transport::RpcNotifier::failed() {
    ...
}
</code></pre>
<p>img Red Flag: Nonobvious Code img</p>
<p>If the meaning and behavior of code cannot be understood with a quick reading, it is a red flag. Often this means that there is important information that is not immediately clear to someone reading the code.</p>
<blockquote>
<p>&#x5982;&#x679C;&#x65E0;&#x6CD5;&#x901A;&#x8FC7;&#x5FEB;&#x901F;&#x9605;&#x8BFB;&#x6765;&#x7406;&#x89E3;&#x4EE3;&#x7801;&#x7684;&#x542B;&#x4E49;&#x548C;&#x884C;&#x4E3A;&#xFF0C;&#x5219;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x5371;&#x9669;&#x6807;&#x8BB0;&#x3002;&#x901A;&#x5E38;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x6709;&#x4E9B;&#x91CD;&#x8981;&#x7684;&#x4FE1;&#x606F;&#x5BF9;&#x4E8E;&#x9605;&#x8BFB;&#x4EE3;&#x7801;&#x7684;&#x4EBA;&#x6765;&#x8BF4;&#x5E76;&#x4E0D;&#x80FD;&#x7ACB;&#x5373;&#x6E05;&#x9664;&#x3002;</p>
</blockquote>
<p>Generic containers. Many languages provide generic classes for grouping two or more items into a single object, such as Pair in Java or std::pair in C++. These classes are tempting because they make it easy to pass around several objects with a single variable. One of the most common uses is to return multiple values from a method, as in this Java example:</p>
<blockquote>
<p>&#x901A;&#x7528;&#x5BB9;&#x5668;&#x3002;&#x8BB8;&#x591A;&#x8BED;&#x8A00;&#x63D0;&#x4F9B;&#x4E86;&#x7528;&#x4E8E;&#x5C06;&#x4E24;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x9879;&#x76EE;&#x7EC4;&#x5408;&#x5230;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x4E2D;&#x7684;&#x901A;&#x7528;&#x7C7B;&#xFF0C;&#x4F8B;&#x5982; Java &#x4E2D;&#x7684; Pair &#x6216; C ++&#x4E2D;&#x7684; std :: pair&#x3002;&#x8FD9;&#x4E9B;&#x7C7B;&#x5F88;&#x8BF1;&#x4EBA;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x4F7F;&#x4F7F;&#x7528;&#x5355;&#x4E2A;&#x53D8;&#x91CF;&#x8F7B;&#x677E;&#x4F20;&#x9012;&#x591A;&#x4E2A;&#x5BF9;&#x8C61;&#x53D8;&#x5F97;&#x5BB9;&#x6613;&#x3002;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x7528;&#x9014;&#x4E4B;&#x4E00;&#x662F;&#x4ECE;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x8FD4;&#x56DE;&#x591A;&#x4E2A;&#x503C;&#xFF0C;&#x5982;&#x4EE5;&#x4E0B; Java &#x793A;&#x4F8B;&#x6240;&#x793A;&#xFF1A;</p>
</blockquote>
<pre><code class="lang-java"><span class="hljs-keyword">return</span> <span class="hljs-keyword">new</span> Pair&lt;Integer, Boolean&gt;(currentTerm, <span class="hljs-keyword">false</span>);
</code></pre>
<p>Unfortunately, generic containers result in nonobvious code because the grouped elements have generic names that obscure their meaning. In the example above, the caller must reference the two returned values with result.getKey() and result.getValue(), which give no clue about the actual meaning of the values.</p>
<blockquote>
<p>&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x901A;&#x7528;&#x5BB9;&#x5668;&#x5BFC;&#x81F4;&#x4EE3;&#x7801;&#x4E0D;&#x6E05;&#x6670;&#xFF0C;&#x56E0;&#x4E3A;&#x5206;&#x7EC4;&#x540E;&#x7684;&#x5143;&#x7D20;&#x7684;&#x901A;&#x7528;&#x540D;&#x79F0;&#x6A21;&#x7CCA;&#x4E86;&#x5B83;&#x4EEC;&#x7684;&#x542B;&#x4E49;&#x3002;&#x5728;&#x4E0A;&#x9762;&#x7684;&#x793A;&#x4F8B;&#x4E2D;&#xFF0C;&#x8C03;&#x7528;&#x8005;&#x5FC5;&#x987B;&#x4F7F;&#x7528; result.getKey&#xFF08;&#xFF09;&#x548C; result.getValue&#xFF08;&#xFF09;&#x5F15;&#x7528;&#x4E24;&#x4E2A;&#x8FD4;&#x56DE;&#x7684;&#x503C;&#xFF0C;&#x800C;&#x8FD9;&#x4E24;&#x4E2A;&#x503C;&#x90FD;&#x4E0D;&#x63D0;&#x4F9B;&#x8FD9;&#x4E9B;&#x503C;&#x7684;&#x5B9E;&#x9645;&#x542B;&#x4E49;&#x3002;</p>
</blockquote>
<p>Thus, it&#x2019;s better not to use generic containers. If you need a container, define a new class or structure that is specialized for the particular use. You can then use meaningful names for the elements, and you can provide additional documentation in the declaration, which is not possible with the generic container.</p>
<blockquote>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x6700;&#x597D;&#x4E0D;&#x8981;&#x4F7F;&#x7528;&#x901A;&#x7528;&#x5BB9;&#x5668;&#x3002;&#x5982;&#x679C;&#x9700;&#x8981;&#x5BB9;&#x5668;&#xFF0C;&#x8BF7;&#x5B9A;&#x4E49;&#x4E13;&#x95E8;&#x7528;&#x4E8E;&#x7279;&#x5B9A;&#x7528;&#x9014;&#x7684;&#x65B0;&#x7C7B;&#x6216;&#x7ED3;&#x6784;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x4E3A;&#x5143;&#x7D20;&#x4F7F;&#x7528;&#x6709;&#x610F;&#x4E49;&#x7684;&#x540D;&#x79F0;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x5728;&#x58F0;&#x660E;&#x4E2D;&#x63D0;&#x4F9B;&#x5176;&#x4ED6;&#x6587;&#x6863;&#xFF0C;&#x800C;&#x5BF9;&#x4E8E;&#x5E38;&#x89C4;&#x5BB9;&#x5668;&#x800C;&#x8A00;&#xFF0C;&#x8FD9;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x7684;&#x3002;</p>
</blockquote>
<p>This example illustrates a general rule: software should be designed for ease of reading, not ease of writing. Generic containers are expedient for the person writing the code, but they create confusion for all the readers that follow. It&#x2019;s better for the person writing the code to spend a few extra minutes to define a specific container structure, so that the resulting code is more obvious.</p>
<blockquote>
<p>&#x6B64;&#x793A;&#x4F8B;&#x8BF4;&#x660E;&#x4E86;&#x4E00;&#x6761;&#x901A;&#x7528;&#x89C4;&#x5219;&#xFF1A;&#x8F6F;&#x4EF6;&#x5E94;&#x8BBE;&#x8BA1;&#x4E3A;&#x6613;&#x4E8E;&#x9605;&#x8BFB;&#x800C;&#x4E0D;&#x662F;&#x6613;&#x4E8E;&#x7F16;&#x5199;&#x3002;&#x901A;&#x7528;&#x5BB9;&#x5668;&#x5BF9;&#x4E8E;&#x7F16;&#x5199;&#x4EE3;&#x7801;&#x7684;&#x4EBA;&#x6765;&#x8BF4;&#x662F;&#x5F88;&#x65B9;&#x4FBF;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x4EEC;&#x4F1A;&#x4F7F;&#x968F;&#x540E;&#x7684;&#x6240;&#x6709;&#x8BFB;&#x8005;&#x611F;&#x5230;&#x56F0;&#x60D1;&#x3002;&#x5BF9;&#x4E8E;&#x7F16;&#x5199;&#x4EE3;&#x7801;&#x7684;&#x4EBA;&#x6765;&#x8BF4;&#xFF0C;&#x82B1;&#x4E00;&#x4E9B;&#x989D;&#x5916;&#x7684;&#x65F6;&#x95F4;&#x6765;&#x5B9A;&#x4E49;&#x7279;&#x5B9A;&#x7684;&#x5BB9;&#x5668;&#x7ED3;&#x6784;&#x662F;&#x66F4;&#x597D;&#x7684;&#x9009;&#x62E9;&#xFF0C;&#x4EE5;&#x4FBF;&#x4F7F;&#x751F;&#x6210;&#x7684;&#x4EE3;&#x7801;&#x66F4;&#x52A0;&#x660E;&#x663E;&#x3002;</p>
</blockquote>
<p>Different types for declaration and allocation. Consider the following Java example:</p>
<blockquote>
<p>&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x58F0;&#x660E;&#x548C;&#x5206;&#x914D;&#x3002;&#x8003;&#x8651;&#x4EE5;&#x4E0B; Java &#x793A;&#x4F8B;&#xFF1A;</p>
</blockquote>
<pre><code class="lang-java"><span class="hljs-keyword">private</span> List&lt;Message&gt; incomingMessageList;
...
incomingMessageList = <span class="hljs-keyword">new</span> ArrayList&lt;Message&gt;();
</code></pre>
<p>The variable is declared as a List, but the actual value is an ArrayList. This code is legal, since List is a superclass of ArrayList, but it can mislead a reader who sees the declaration but not the actual allocation. The actual type may impact how the variable is used (ArrayLists have different performance and thread-safety properties than other subclasses of List), so it is better to match the declaration with the allocation.</p>
<blockquote>
<p>&#x5C06;&#x8BE5;&#x53D8;&#x91CF;&#x58F0;&#x660E;&#x4E3A; List&#xFF0C;&#x4F46;&#x5B9E;&#x9645;&#x503C;&#x4E3A; ArrayList&#x3002;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x662F;&#x5408;&#x6CD5;&#x7684;&#xFF0C;&#x56E0;&#x4E3A; List &#x662F; ArrayList &#x7684;&#x8D85;&#x7C7B;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x4F1A;&#x8BEF;&#x5BFC;&#x770B;&#x5230;&#x58F0;&#x660E;&#x4F46;&#x4E0D;&#x662F;&#x5B9E;&#x9645;&#x5206;&#x914D;&#x7684;&#x8BFB;&#x8005;&#x3002;&#x5B9E;&#x9645;&#x7C7B;&#x578B;&#x53EF;&#x80FD;&#x4F1A;&#x5F71;&#x54CD;&#x53D8;&#x91CF;&#x7684;&#x4F7F;&#x7528;&#x65B9;&#x5F0F;&#xFF08;ArrayList &#x4E0E; List &#x7684;&#x5176;&#x4ED6;&#x5B50;&#x7C7B;&#x76F8;&#x6BD4;&#xFF0C;&#x5177;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x6027;&#x80FD;&#x548C;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x5C5E;&#x6027;&#xFF09;&#xFF0C;&#x56E0;&#x6B64;&#x6700;&#x597D;&#x5C06;&#x58F0;&#x660E;&#x4E0E;&#x5206;&#x914D;&#x5339;&#x914D;&#x3002;</p>
</blockquote>
<p>Code that violates reader expectations. Consider the following code, which is the main program for a Java application</p>
<blockquote>
<p>&#x8FDD;&#x53CD;&#x8BFB;&#x8005;&#x671F;&#x671B;&#x7684;&#x4EE3;&#x7801;&#x3002;&#x8003;&#x8651;&#x4EE5;&#x4E0B;&#x4EE3;&#x7801;&#xFF0C;&#x8FD9;&#x662F; Java &#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x4E3B;&#x7A0B;&#x5E8F;</p>
</blockquote>
<pre><code class="lang-java"><span class="hljs-function"><span class="hljs-keyword">public</span> <span class="hljs-keyword">static</span> <span class="hljs-keyword">void</span> <span class="hljs-title">main</span><span class="hljs-params">(String[] args)</span> </span>{
    ...
    <span class="hljs-keyword">new</span> RaftClient(myAddress, serverAddresses);
}
</code></pre>
<p>Most applications exit when their main programs return, so readers are likely to assume that will happen here. However, that is not the case. The constructor for RaftClient creates additional threads, which continue to operate even though the application&#x2019;s main thread finishes. This behavior should be documented in the interface comment for the RaftClient constructor, but the behavior is nonobvious enough that it&#x2019;s worth putting a short comment at the end of main as well. The comment should indicate that the application will continue executing in other threads. Code is most obvious if it conforms to the conventions that readers will be expecting; if it doesn&#x2019;t, then it&#x2019;s important to document the behavior so readers aren&#x2019;t confused.</p>
<blockquote>
<p>&#x5927;&#x591A;&#x6570;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5728;&#x5176;&#x4E3B;&#x7A0B;&#x5E8F;&#x8FD4;&#x56DE;&#x65F6;&#x9000;&#x51FA;&#xFF0C;&#x56E0;&#x6B64;&#x8BFB;&#x8005;&#x53EF;&#x80FD;&#x4F1A;&#x8BA4;&#x4E3A;&#x8FD9;&#x5C06;&#x5728;&#x6B64;&#x5904;&#x53D1;&#x751F;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x4E8B;&#x5B9E;&#x5E76;&#x975E;&#x5982;&#x6B64;&#x3002;RaftClient &#x7684;&#x6784;&#x9020;&#x51FD;&#x6570;&#x521B;&#x5EFA;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#xFF0C;&#x5373;&#x4F7F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x4E3B;&#x7EBF;&#x7A0B;&#x5B8C;&#x6210;&#xFF0C;&#x8BE5;&#x7EBF;&#x7A0B;&#x4ECD;&#x53EF;&#x7EE7;&#x7EED;&#x8FD0;&#x884C;&#x3002;&#x5E94;&#x8BE5;&#x5728; RaftClient &#x6784;&#x9020;&#x51FD;&#x6570;&#x7684;&#x63A5;&#x53E3;&#x6CE8;&#x91CA;&#x4E2D;&#x8BB0;&#x5F55;&#x6B64;&#x884C;&#x4E3A;&#xFF0C;&#x4F46;&#x662F;&#x8BE5;&#x884C;&#x4E3A;&#x4E0D;&#x591F;&#x660E;&#x663E;&#xFF0C;&#x56E0;&#x6B64;&#x503C;&#x5F97;&#x5728; main &#x672B;&#x5C3E;&#x6DFB;&#x52A0;&#x7B80;&#x77ED;&#x6CE8;&#x91CA;&#x3002;&#x8BE5;&#x6CE8;&#x91CA;&#x5E94;&#x6307;&#x793A;&#x8BE5;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5C06;&#x7EE7;&#x7EED;&#x5728;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x4E2D;&#x6267;&#x884C;&#x3002;&#x5982;&#x679C;&#x4EE3;&#x7801;&#x7B26;&#x5408;&#x8BFB;&#x8005;&#x671F;&#x671B;&#x7684;&#x60EF;&#x4F8B;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x662F;&#x6700;&#x660E;&#x663E;&#x7684;&#x3002;&#x5982;&#x679C;&#x6CA1;&#x6709;&#xFF0C;&#x90A3;&#x4E48;&#x8BB0;&#x5F55;&#x8BE5;&#x884C;&#x4E3A;&#x5F88;&#x91CD;&#x8981;&#xFF0C;&#x4EE5;&#x514D;&#x4F7F;&#x8BFB;&#x8005;&#x611F;&#x5230;&#x56F0;&#x60D1;&#x3002;</p>
</blockquote>
<h2 id="183-conclusion-&#x7ED3;&#x8BBA;">18.3 Conclusion &#x7ED3;&#x8BBA;</h2>
<p>Another way of thinking about obviousness is in terms of information. If code is nonobvious, that usually means there is important information about the code that the reader does not have: in the RaftClient example, the reader might not know that the RaftClient constructor created new threads; in the Pair example, the reader might not know that result.getKey() returns the number of the current term.</p>
<blockquote>
<p>&#x5173;&#x4E8E;&#x663E;&#x800C;&#x6613;&#x89C1;&#x6027;&#x7684;&#x53E6;&#x4E00;&#x79CD;&#x601D;&#x8003;&#x65B9;&#x5F0F;&#x662F;&#x4FE1;&#x606F;&#x3002;&#x5982;&#x679C;&#x4EE3;&#x7801;&#x4E0D;&#x662F;&#x663E;&#x800C;&#x6613;&#x89C1;&#x7684;&#xFF0C;&#x5219;&#x901A;&#x5E38;&#x610F;&#x5473;&#x7740;&#x5B58;&#x5728;&#x6709;&#x5173;&#x8BFB;&#x8005;&#x6240;&#x4E0D;&#x5177;&#x5907;&#x7684;&#x4EE3;&#x7801;&#x7684;&#x91CD;&#x8981;&#x4FE1;&#x606F;&#xFF1A;&#x5728; RaftClient &#x793A;&#x4F8B;&#x4E2D;&#xFF0C;&#x8BFB;&#x8005;&#x53EF;&#x80FD;&#x4E0D;&#x77E5;&#x9053; RaftClient &#x6784;&#x9020;&#x51FD;&#x6570;&#x521B;&#x5EFA;&#x4E86;&#x65B0;&#x7EBF;&#x7A0B;&#xFF1B;&#x5728;&#x201C;&#x914D;&#x5BF9;&#x201D;&#x793A;&#x4F8B;&#x4E2D;&#xFF0C;&#x8BFB;&#x8005;&#x53EF;&#x80FD;&#x4E0D;&#x77E5;&#x9053; result.getKey&#xFF08;&#xFF09;&#x8FD4;&#x56DE;&#x5F53;&#x524D;&#x9879;&#x7684;&#x7F16;&#x53F7;&#x3002;</p>
</blockquote>
<p>To make code obvious, you must ensure that readers always have the information they need to understand it. You can do this in three ways. The best way is to reduce the amount of information that is needed, using design techniques such as abstraction and eliminating special cases. Second, you can take advantage of information that readers have already acquired in other contexts (for example, by following conventions and conforming to expectations) so readers don&#x2019;t have to learn new information for your code. Third, you can present the important information to them in the code, using techniques such as good names and strategic comments.</p>
<blockquote>
<p>&#x4E3A;&#x4E86;&#x4F7F;&#x4EE3;&#x7801;&#x6E05;&#x6670;&#x53EF;&#x89C1;&#xFF0C;&#x60A8;&#x5FC5;&#x987B;&#x786E;&#x4FDD;&#x8BFB;&#x8005;&#x59CB;&#x7EC8;&#x62E5;&#x6709;&#x7406;&#x89E3;&#x5B83;&#x4EEC;&#x6240;&#x9700;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x60A8;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E09;&#x79CD;&#x65B9;&#x5F0F;&#x6267;&#x884C;&#x6B64;&#x64CD;&#x4F5C;&#x3002;&#x6700;&#x597D;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x4F7F;&#x7528;&#x62BD;&#x8C61;&#x7B49;&#x8BBE;&#x8BA1;&#x6280;&#x672F;&#x5E76;&#x6D88;&#x9664;&#x7279;&#x6B8A;&#x60C5;&#x51B5;&#xFF0C;&#x4EE5;&#x51CF;&#x5C11;&#x6240;&#x9700;&#x7684;&#x4FE1;&#x606F;&#x91CF;&#x3002;&#x5176;&#x6B21;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x5229;&#x7528;&#x8BFB;&#x8005;&#x5728;&#x5176;&#x4ED6;&#x60C5;&#x51B5;&#x4E0B;&#x5DF2;&#x7ECF;&#x83B7;&#x5F97;&#x7684;&#x4FE1;&#x606F;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x901A;&#x8FC7;&#x9075;&#x5FAA;&#x7EA6;&#x5B9A;&#x5E76;&#x7B26;&#x5408;&#x671F;&#x671B;&#xFF09;&#xFF0C;&#x4ECE;&#x800C;&#x4F7F;&#x8BFB;&#x8005;&#x4E0D;&#x5FC5;&#x4E3A;&#x4EE3;&#x7801;&#x5B66;&#x4E60;&#x65B0;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x7B2C;&#x4E09;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x8BF8;&#x5982;&#x597D;&#x540D;&#x548C;&#x6218;&#x7565;&#x6CE8;&#x91CA;&#x4E4B;&#x7C7B;&#x7684;&#x6280;&#x672F;&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#x5411;&#x4ED6;&#x4EEC;&#x63D0;&#x4F9B;&#x91CD;&#x8981;&#x4FE1;&#x606F;&#x3002;</p>
</blockquote>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="ch17.html" class="navigation navigation-prev " aria-label="Previous page: 第十七章: 一致性">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="ch19.html" class="navigation navigation-next " aria-label="Next page: 第十九章: 软件发展趋势">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第十八章: 代码应该是显而易见的","level":"1.21","depth":1,"next":{"title":"第十九章: 软件发展趋势","level":"1.22","depth":1,"path":"docs/ch19.md","ref":"./docs/ch19.md","articles":[]},"previous":{"title":"第十七章: 一致性","level":"1.20","depth":1,"path":"docs/ch17.md","ref":"./docs/ch17.md","articles":[]},"dir":"ltr"},"config":{"plugins":["back-to-top-button","expandable-chapters-small","page-toc-button","livereload"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"livereload":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"page-toc-button":{},"back-to-top-button":{},"expandable-chapters-small":{},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"John Ousterhout","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"软件设计哲学","language":"zh-hans","gitbook":"*","description":"书中讨论了软件设计的主题：如何将复杂的软件系统分解成可以相对独立实现的模块(如类和方法)"},"file":{"path":"docs/ch18.md","mtime":"2020-08-06T16:26:19.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-02-06T04:55:41.669Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-page-toc-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

