
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第十九章: 软件发展趋势 · 软件设计哲学</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="John Ousterhout">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-page-toc-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="ch20.html" />
    
    
    <link rel="prev" href="ch18.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    首页
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="preface">
            
                <span>
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="ch1.html">
            
                <a href="ch1.html">
            
                    
                    第一章：介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="ch2.html">
            
                <a href="ch2.html">
            
                    
                    第二章：复杂性的本质
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="ch3.html">
            
                <a href="ch3.html">
            
                    
                    第三章：工作代码是不够的（战略与战术编程）
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="ch4.html">
            
                <a href="ch4.html">
            
                    
                    第四章：模块应该是深的
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="ch5.html">
            
                <a href="ch5.html">
            
                    
                    第五章：信息隐藏(和泄露)
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="ch6.html">
            
                <a href="ch6.html">
            
                    
                    第六章：通用模块更深入
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="ch7.html">
            
                <a href="ch7.html">
            
                    
                    第七章: 不同的层，不同的抽象
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="ch8.html">
            
                <a href="ch8.html">
            
                    
                    第八章: 降低复杂性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="ch9.html">
            
                <a href="ch9.html">
            
                    
                    第九章: 在一起更好还是分开更好？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="ch10.html">
            
                <a href="ch10.html">
            
                    
                    第十章: 定义不存在的错误
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="ch11.html">
            
                <a href="ch11.html">
            
                    
                    第十一章: 设计它两次
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="ch12.html">
            
                <a href="ch12.html">
            
                    
                    第十二章: 为什么写注释？四个理由
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="ch13.html">
            
                <a href="ch13.html">
            
                    
                    第十三章: 注释应该描述代码中不明显的内容
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="ch14.html">
            
                <a href="ch14.html">
            
                    
                    第十四章: 选择的名字
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="ch15.html">
            
                <a href="ch15.html">
            
                    
                    第十五章: 先写注释
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="ch16.html">
            
                <a href="ch16.html">
            
                    
                    第十六章: 修改现有的代码
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.20" data-path="ch17.html">
            
                <a href="ch17.html">
            
                    
                    第十七章: 一致性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.21" data-path="ch18.html">
            
                <a href="ch18.html">
            
                    
                    第十八章: 代码应该是显而易见的
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.22" data-path="ch19.html">
            
                <a href="ch19.html">
            
                    
                    第十九章: 软件发展趋势
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.23" data-path="ch20.html">
            
                <a href="ch20.html">
            
                    
                    第二十章: 设计性能
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.24" data-path="ch21.html">
            
                <a href="ch21.html">
            
                    
                    第二十一章: 结论
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.25" data-path="summary.html">
            
                <a href="summary.html">
            
                    
                    总结
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >第十九章: 软件发展趋势</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7B2C;-19-&#x7AE0;-&#x8F6F;&#x4EF6;&#x53D1;&#x5C55;&#x8D8B;&#x52BF;">&#x7B2C; 19 &#x7AE0; &#x8F6F;&#x4EF6;&#x53D1;&#x5C55;&#x8D8B;&#x52BF;</h1>
<blockquote>
<p>Chapter 19 Software Trends</p>
</blockquote>
<p>As a way of illustrating the principles discussed in this book, this chapter considers several trends and patterns that have become popular in software development over the last few decades. For each trend, I will describe how that trend relates to the principles in this book and use the principles to evaluate whether that trend provides leverage against software complexity.</p>
<blockquote>
<p>&#x4E3A;&#x4E86;&#x8BF4;&#x660E;&#x672C;&#x4E66;&#x4E2D;&#x8BA8;&#x8BBA;&#x7684;&#x539F;&#x7406;&#xFF0C;&#x672C;&#x7AE0;&#x8003;&#x8651;&#x4E86;&#x8FC7;&#x53BB;&#x51E0;&#x5341;&#x5E74;&#x6765;&#x5728;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x4E2D;&#x6D41;&#x884C;&#x7684;&#x51E0;&#x79CD;&#x8D8B;&#x52BF;&#x548C;&#x6A21;&#x5F0F;&#x3002;&#x5BF9;&#x4E8E;&#x6BCF;&#x79CD;&#x8D8B;&#x52BF;&#xFF0C;&#x6211;&#x5C06;&#x63CF;&#x8FF0;&#x8BE5;&#x8D8B;&#x52BF;&#x4E0E;&#x672C;&#x4E66;&#x4E2D;&#x7684;&#x539F;&#x7406;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x539F;&#x7406;&#x6765;&#x8BC4;&#x4F30;&#x8BE5;&#x8D8B;&#x52BF;&#x662F;&#x5426;&#x63D0;&#x4F9B;&#x4E86;&#x9488;&#x5BF9;&#x8F6F;&#x4EF6;&#x590D;&#x6742;&#x6027;&#x7684;&#x6760;&#x6746;&#x4F5C;&#x7528;&#x3002;</p>
</blockquote>
<h2 id="191-object-oriented-programming-and-inheritance-&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x7F16;&#x7A0B;&#x548C;&#x7EE7;&#x627F;">19.1 Object-oriented programming and inheritance &#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x7F16;&#x7A0B;&#x548C;&#x7EE7;&#x627F;</h2>
<p>Object-oriented programming is one of the most important new ideas in software development over the last 30&#x2013;40 years. It introduced notions such as classes, inheritance, private methods, and instance variables. If used carefully, these mechanisms can help to produce better software designs. For example, private methods and variables can be used to ensure information hiding: no code outside a class can invoke private methods or access private variables, so there can&#x2019;t be any external dependencies on them.</p>
<blockquote>
<p>&#x5728;&#x8FC7;&#x53BB;&#x7684; 30-40 &#x5E74;&#x4E2D;&#xFF0C;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7F16;&#x7A0B;&#x662F;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x4E2D;&#x6700;&#x91CD;&#x8981;&#x7684;&#x65B0;&#x601D;&#x60F3;&#x4E4B;&#x4E00;&#x3002;&#x5B83;&#x5F15;&#x5165;&#x4E86;&#x8BF8;&#x5982;&#x7C7B;&#xFF0C;&#x7EE7;&#x627F;&#xFF0C;&#x79C1;&#x6709;&#x65B9;&#x6CD5;&#x548C;&#x5B9E;&#x4F8B;&#x53D8;&#x91CF;&#x4E4B;&#x7C7B;&#x7684;&#x6982;&#x5FF5;&#x3002;&#x5982;&#x679C;&#x4ED4;&#x7EC6;&#x4F7F;&#x7528;&#xFF0C;&#x8FD9;&#x4E9B;&#x673A;&#x5236;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x4EA7;&#x751F;&#x66F4;&#x597D;&#x7684;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x79C1;&#x6709;&#x65B9;&#x6CD5;&#x548C;&#x53D8;&#x91CF;&#x53EF;&#x7528;&#x4E8E;&#x786E;&#x4FDD;&#x4FE1;&#x606F;&#x9690;&#x85CF;&#xFF1A;&#x7C7B;&#x5916;&#x7684;&#x4EFB;&#x4F55;&#x4EE3;&#x7801;&#x90FD;&#x4E0D;&#x80FD;&#x8C03;&#x7528;&#x79C1;&#x6709;&#x65B9;&#x6CD5;&#x6216;&#x8BBF;&#x95EE;&#x79C1;&#x6709;&#x53D8;&#x91CF;&#xFF0C;&#x56E0;&#x6B64;&#x5B83;&#x4EEC;&#x4E0A;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x5916;&#x90E8;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x3002;</p>
</blockquote>
<p>One of the key elements of object-oriented programming is inheritance. Inheritance comes in two forms, which have different implications for software complexity. The first form of inheritance is interface inheritance, in which a parent class defines the signatures for one or more methods, but does not implement the methods. Each subclass must implement the signatures, but different subclasses can implement the same methods in different ways. For example, the interface might define methods for performing I/O; one subclass might implement the I/O operations for disk files, and another subclass might implement the same operations for network sockets.</p>
<blockquote>
<p>&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7F16;&#x7A0B;&#x7684;&#x5173;&#x952E;&#x8981;&#x7D20;&#x4E4B;&#x4E00;&#x662F;&#x7EE7;&#x627F;&#x3002;&#x7EE7;&#x627F;&#x6709;&#x4E24;&#x79CD;&#x5F62;&#x5F0F;&#xFF0C;&#x5B83;&#x4EEC;&#x5BF9;&#x8F6F;&#x4EF6;&#x590D;&#x6742;&#x6027;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x542B;&#x4E49;&#x3002;&#x7EE7;&#x627F;&#x7684;&#x7B2C;&#x4E00;&#x79CD;&#x5F62;&#x5F0F;&#x662F;&#x63A5;&#x53E3;&#x7EE7;&#x627F;&#xFF0C;&#x5176;&#x4E2D;&#x7236;&#x7C7B;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x65B9;&#x6CD5;&#x7684;&#x7B7E;&#x540D;&#xFF0C;&#x4F46;&#x4E0D;&#x5B9E;&#x73B0;&#x8FD9;&#x4E9B;&#x65B9;&#x6CD5;&#x3002;&#x6BCF;&#x4E2A;&#x5B50;&#x7C7B;&#x90FD;&#x5FC5;&#x987B;&#x5B9E;&#x73B0;&#x7B7E;&#x540D;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x540C;&#x7684;&#x5B50;&#x7C7B;&#x53EF;&#x4EE5;&#x4EE5;&#x4E0D;&#x540C;&#x7684;&#x65B9;&#x5F0F;&#x5B9E;&#x73B0;&#x76F8;&#x540C;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x8BE5;&#x63A5;&#x53E3;&#x53EF;&#x80FD;&#x5B9A;&#x4E49;&#x7528;&#x4E8E;&#x6267;&#x884C; I/O &#x7684;&#x65B9;&#x6CD5;&#x3002;&#x4E00;&#x4E2A;&#x5B50;&#x7C7B;&#x53EF;&#x80FD;&#x5BF9;&#x78C1;&#x76D8;&#x6587;&#x4EF6;&#x5B9E;&#x73B0; I/O &#x64CD;&#x4F5C;&#xFF0C;&#x800C;&#x53E6;&#x4E00;&#x4E2A;&#x5B50;&#x7C7B;&#x53EF;&#x80FD;&#x5BF9;&#x7F51;&#x7EDC;&#x5957;&#x63A5;&#x5B57;&#x5B9E;&#x73B0;&#x76F8;&#x540C;&#x7684;&#x64CD;&#x4F5C;&#x3002;</p>
</blockquote>
<p>Interface inheritance provides leverage against complexity by reusing the same interface for multiple purposes. It allows knowledge acquired in solving one problem (such as how to use an I/O interface to read and write disk files) to be used to solve other problems (such as communicating over a network socket). Another way of thinking about this is in terms of depth: the more different implementations there are of an interface, the deeper the interface becomes. In order for an interface to have many implementations, it must capture the essential features of all the underlying implementations while steering clear of the details that differ between the implementations; this notion is at the heart of abstraction.</p>
<blockquote>
<p>&#x63A5;&#x53E3;&#x7EE7;&#x627F;&#x901A;&#x8FC7;&#x51FA;&#x4E8E;&#x591A;&#x79CD;&#x76EE;&#x7684;&#x91CD;&#x7528;&#x540C;&#x4E00;&#x63A5;&#x53E3;&#xFF0C;&#x4ECE;&#x800C;&#x63D0;&#x4F9B;&#x4E86;&#x9488;&#x5BF9;&#x590D;&#x6742;&#x6027;&#x7684;&#x6760;&#x6746;&#x4F5C;&#x7528;&#x3002;&#x5B83;&#x4F7F;&#x89E3;&#x51B3;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF08;&#x4F8B;&#x5982;&#x5982;&#x4F55;&#x4F7F;&#x7528; I/O &#x63A5;&#x53E3;&#x8BFB;&#x53D6;&#x548C;&#x5199;&#x5165;&#x78C1;&#x76D8;&#x6587;&#x4EF6;&#xFF09;&#x4E2D;&#x83B7;&#x5F97;&#x7684;&#x77E5;&#x8BC6;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x89E3;&#x51B3;&#x5176;&#x4ED6;&#x95EE;&#x9898;&#xFF08;&#x4F8B;&#x5982;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x5957;&#x63A5;&#x5B57;&#x8FDB;&#x884C;&#x901A;&#x4FE1;&#xFF09;&#x3002;&#x5173;&#x4E8E;&#x6DF1;&#x5EA6;&#x7684;&#x53E6;&#x4E00;&#x79CD;&#x601D;&#x8003;&#x65B9;&#x5F0F;&#x662F;&#xFF1A;&#x63A5;&#x53E3;&#x7684;&#x5B9E;&#x73B0;&#x8D8A;&#x4E0D;&#x540C;&#xFF0C;&#x63A5;&#x53E3;&#x5C31;&#x8D8A;&#x6DF1;&#x5165;&#x3002;&#x4E3A;&#x4E86;&#x4F7F;&#x63A5;&#x53E3;&#x5177;&#x6709;&#x8BB8;&#x591A;&#x5B9E;&#x73B0;&#xFF0C;&#x5B83;&#x5FC5;&#x987B;&#x6355;&#x83B7;&#x6240;&#x6709;&#x57FA;&#x7840;&#x5B9E;&#x73B0;&#x7684;&#x57FA;&#x672C;&#x529F;&#x80FD;&#xFF0C;&#x540C;&#x65F6;&#x907F;&#x514D;&#x5B9E;&#x73B0;&#x4E4B;&#x95F4;&#x7684;&#x5DEE;&#x5F02;&#x3002;&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#x662F;&#x62BD;&#x8C61;&#x7684;&#x6838;&#x5FC3;&#x3002;</p>
</blockquote>
<p>The second form of inheritance is implementation inheritance. In this form, a parent class defines not only signatures for one or more methods, but also default implementations. Subclasses can choose to inherit the parent&#x2019;s implementation of a method or override it by defining a new method with the same signature. Without implementation inheritance, the same method implementation might need to be duplicated in several subclasses, which would create dependencies between those subclasses (modifications would need to be duplicated in all copies of the method). Thus, implementation inheritance reduces the amount of code that needs to be modified as the system evolves; in other words, it reduces the change amplification problem described in Chapter 2.</p>
<blockquote>
<p>&#x7EE7;&#x627F;&#x7684;&#x7B2C;&#x4E8C;&#x79CD;&#x5F62;&#x5F0F;&#x662F;&#x5B9E;&#x73B0;&#x7EE7;&#x627F;&#x3002;&#x4EE5;&#x8FD9;&#x79CD;&#x5F62;&#x5F0F;&#xFF0C;&#x7236;&#x7C7B;&#x4E0D;&#x4EC5;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x65B9;&#x6CD5;&#x7684;&#x7B7E;&#x540D;&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x5B9A;&#x4E49;&#x4E86;&#x9ED8;&#x8BA4;&#x5B9E;&#x73B0;&#x3002;&#x5B50;&#x7C7B;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x7EE7;&#x627F;&#x65B9;&#x6CD5;&#x7684;&#x7236;&#x7C7B;&#x5B9E;&#x73B0;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5B9A;&#x4E49;&#x5177;&#x6709;&#x76F8;&#x540C;&#x7B7E;&#x540D;&#x7684;&#x65B0;&#x65B9;&#x6CD5;&#x6765;&#x8986;&#x76D6;&#x5B83;&#x3002;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x5B9E;&#x73B0;&#x7EE7;&#x627F;&#xFF0C;&#x5219;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x5728;&#x51E0;&#x4E2A;&#x5B50;&#x7C7B;&#x4E2D;&#x590D;&#x5236;&#x76F8;&#x540C;&#x7684;&#x65B9;&#x6CD5;&#x5B9E;&#x73B0;&#xFF0C;&#x8FD9;&#x5C06;&#x5728;&#x8FD9;&#x4E9B;&#x5B50;&#x7C7B;&#x4E4B;&#x95F4;&#x521B;&#x5EFA;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#xFF08;&#x4FEE;&#x6539;&#x9700;&#x8981;&#x5728;&#x65B9;&#x6CD5;&#x7684;&#x6240;&#x6709;&#x526F;&#x672C;&#x4E2D;&#x590D;&#x5236;&#xFF09;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5B9E;&#x73B0;&#x7EE7;&#x627F;&#x51CF;&#x5C11;&#x4E86;&#x968F;&#x7740;&#x7CFB;&#x7EDF;&#x7684;&#x53D1;&#x5C55;&#x800C;&#x9700;&#x8981;&#x4FEE;&#x6539;&#x7684;&#x4EE3;&#x7801;&#x91CF;&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x5B83;&#x51CF;&#x5C11;&#x4E86;&#x7B2C; 2 &#x7AE0;&#x4E2D;&#x63CF;&#x8FF0;&#x7684;&#x53D8;&#x5316;&#x653E;&#x5927;&#x95EE;&#x9898;&#x3002;</p>
</blockquote>
<p>However, implementation inheritance creates dependencies between the parent class and each of its subclasses. Class instance variables in the parent class are often accessed by both the parent and child classes; this results in information leakage between the classes in the inheritance hierarchy and makes it hard to modify one class in the hierarchy without looking at the others. For example, a developer making changes to the parent class may need to examine all of the subclasses to ensure that the changes don&#x2019;t break anything. Similarly, if a subclass overrides a method in the parent class, the developer of the subclass may need to examine the implementation in the parent. In the worst case, programmers will need complete knowledge of the entire class hierarchy underneath the parent class in order to make changes to any of the classes. Class hierarchies that use implementation inheritance extensively tend to have high complexity.</p>
<blockquote>
<p>&#x4F46;&#x662F;&#xFF0C;&#x5B9E;&#x73B0;&#x7EE7;&#x627F;&#x4F1A;&#x5728;&#x7236;&#x7C7B;&#x53CA;&#x5176;&#x6BCF;&#x4E2A;&#x5B50;&#x7C7B;&#x4E4B;&#x95F4;&#x521B;&#x5EFA;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x3002;&#x7236;&#x7C7B;&#x548C;&#x5B50;&#x7C7B;&#x901A;&#x5E38;&#x90FD;&#x8BBF;&#x95EE;&#x7236;&#x7C7B;&#x4E2D;&#x7684;&#x7C7B;&#x5B9E;&#x4F8B;&#x53D8;&#x91CF;&#x3002;&#x8FD9;&#x4F1A;&#x5BFC;&#x81F4;&#x7EE7;&#x627F;&#x5C42;&#x6B21;&#x7ED3;&#x6784;&#x4E2D;&#x7684;&#x7C7B;&#x4E4B;&#x95F4;&#x7684;&#x4FE1;&#x606F;&#x6CC4;&#x6F0F;&#xFF0C;&#x5E76;&#x4E14;&#x4F7F;&#x5F97;&#x5728;&#x4E0D;&#x67E5;&#x770B;&#x5176;&#x4ED6;&#x7C7B;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x5F88;&#x96BE;&#x4FEE;&#x6539;&#x5C42;&#x6B21;&#x7ED3;&#x6784;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x7C7B;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5BF9;&#x7236;&#x7C7B;&#x8FDB;&#x884C;&#x66F4;&#x6539;&#x7684;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x68C0;&#x67E5;&#x6240;&#x6709;&#x5B50;&#x7C7B;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;&#x6240;&#x505A;&#x7684;&#x66F4;&#x6539;&#x4E0D;&#x4F1A;&#x7834;&#x574F;&#x4EFB;&#x4F55;&#x5185;&#x5BB9;&#x3002;&#x540C;&#x6837;&#xFF0C;&#x5982;&#x679C;&#x5B50;&#x7C7B;&#x8986;&#x76D6;&#x7236;&#x7C7B;&#x4E2D;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5219;&#x5B50;&#x7C7B;&#x7684;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x68C0;&#x67E5;&#x7236;&#x7C7B;&#x4E2D;&#x7684;&#x5B9E;&#x73B0;&#x3002;&#x5728;&#x6700;&#x574F;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x7A0B;&#x5E8F;&#x5458;&#x5C06;&#x9700;&#x8981;&#x5B8C;&#x5168;&#x4E86;&#x89E3;&#x7236;&#x7C7B;&#x4E0B;&#x7684;&#x6574;&#x4E2A;&#x7C7B;&#x5C42;&#x6B21;&#x7ED3;&#x6784;&#xFF0C;&#x4EE5;&#x4FBF;&#x5BF9;&#x4EFB;&#x4F55;&#x7C7B;&#x8FDB;&#x884C;&#x66F4;&#x6539;&#x3002;</p>
</blockquote>
<p>Thus, implementation inheritance should be used with caution. Before using implementation inheritance, consider whether an approach based on composition can provide the same benefits. For instance, it may be possible to use small helper classes to implement the shared functionality. Rather than inheriting functions from a parent, the original classes can each build upon the features of the helper classes.</p>
<blockquote>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x5E94;&#x8C28;&#x614E;&#x4F7F;&#x7528;&#x5B9E;&#x73B0;&#x7EE7;&#x627F;&#x3002;&#x5728;&#x4F7F;&#x7528;&#x5B9E;&#x73B0;&#x7EE7;&#x627F;&#x4E4B;&#x524D;&#xFF0C;&#x8BF7;&#x8003;&#x8651;&#x57FA;&#x4E8E;&#x7EC4;&#x5408;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;&#x76F8;&#x540C;&#x7684;&#x597D;&#x5904;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5C0F;&#x578B;&#x5E2E;&#x52A9;&#x7A0B;&#x5E8F;&#x7C7B;&#x6765;&#x5B9E;&#x73B0;&#x5171;&#x4EAB;&#x529F;&#x80FD;&#x3002;&#x539F;&#x59CB;&#x7C7B;&#x53EF;&#x4EE5;&#x4ECE;&#x8F85;&#x52A9;&#x7C7B;&#x7684;&#x529F;&#x80FD;&#x6784;&#x5EFA;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4ECE;&#x7236;&#x7C7B;&#x7EE7;&#x627F;&#x51FD;&#x6570;&#x3002;</p>
</blockquote>
<p>If there is no viable alternative to implementation inheritance, try to separate the state managed by the parent class from that managed by subclasses. One way to do this is for certain instance variables to be managed entirely by methods in the parent class, with subclasses using them only in a read-only fashion or through other methods in the parent class. This applies the notion of information hiding within the class hierarchy to reduce dependencies.</p>
<blockquote>
<p>&#x5982;&#x679C;&#x6CA1;&#x6709;&#x5B9E;&#x73B0;&#x7EE7;&#x627F;&#x7684;&#x53EF;&#x884C;&#x9009;&#x62E9;&#xFF0C;&#x8BF7;&#x5C1D;&#x8BD5;&#x5C06;&#x7236;&#x7C7B;&#x7BA1;&#x7406;&#x7684;&#x72B6;&#x6001;&#x4E0E;&#x5B50;&#x7C7B;&#x7BA1;&#x7406;&#x7684;&#x72B6;&#x6001;&#x5206;&#x5F00;&#x3002;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#xFF0C;&#x67D0;&#x4E9B;&#x5B9E;&#x4F8B;&#x53D8;&#x91CF;&#x5B8C;&#x5168;&#x7531;&#x7236;&#x7C7B;&#x4E2D;&#x7684;&#x65B9;&#x6CD5;&#x7BA1;&#x7406;&#xFF0C;&#x5B50;&#x7C7B;&#x4EC5;&#x4EE5;&#x53EA;&#x8BFB;&#x65B9;&#x5F0F;&#x6216;&#x901A;&#x8FC7;&#x7236;&#x7C7B;&#x4E2D;&#x7684;&#x5176;&#x4ED6;&#x65B9;&#x6CD5;&#x4F7F;&#x7528;&#x5B83;&#x4EEC;&#x3002;&#x8FD9;&#x9002;&#x7528;&#x4E8E;&#x9690;&#x85CF;&#x5728;&#x7C7B;&#x5C42;&#x6B21;&#x7ED3;&#x6784;&#x4E2D;&#x7684;&#x4FE1;&#x606F;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x4EE5;&#x51CF;&#x5C11;&#x4F9D;&#x8D56;&#x6027;&#x3002;</p>
</blockquote>
<p>Although the mechanisms provided by object-oriented programming can assist in implementing clean designs, they do not, by themselves, guarantee good design. For example, if classes are shallow, or have complex interfaces, or permit external access to their internal state, then they will still result in high complexity.</p>
<blockquote>
<p>&#x5C3D;&#x7BA1;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7F16;&#x7A0B;&#x63D0;&#x4F9B;&#x7684;&#x673A;&#x5236;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x5B9E;&#x73B0;&#x5E72;&#x51C0;&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x4EEC;&#x672C;&#x8EAB;&#x4E0D;&#x80FD;&#x4FDD;&#x8BC1;&#x826F;&#x597D;&#x7684;&#x8BBE;&#x8BA1;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x7C7B;&#x5F88;&#x6D45;&#xFF0C;&#x6216;&#x8005;&#x5177;&#x6709;&#x590D;&#x6742;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x6216;&#x8005;&#x5141;&#x8BB8;&#x5916;&#x90E8;&#x8BBF;&#x95EE;&#x5176;&#x5185;&#x90E8;&#x72B6;&#x6001;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x4EEC;&#x4ECD;&#x5C06;&#x5BFC;&#x81F4;&#x5F88;&#x9AD8;&#x7684;&#x590D;&#x6742;&#x6027;&#x3002;</p>
</blockquote>
<h2 id="192-agile-development-&#x654F;&#x6377;&#x5F00;&#x53D1;">19.2 Agile development &#x654F;&#x6377;&#x5F00;&#x53D1;</h2>
<p>Agile development is an approach to software development that emerged in the late 1990&#x2019;s from a collection of ideas about how to make software development more lightweight, flexible, and incremental; it was formally defined during a meeting of practitioners in 2001. Agile development is mostly about the process of software development (organizing teams, managing schedules, the role of unit testing, interacting with customers, etc.) as opposed to software design. Nonetheless, it relates to some of the design principles in this book.</p>
<blockquote>
<p>&#x654F;&#x6377;&#x5F00;&#x53D1;&#x662F;&#x4E00;&#x79CD;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x65B9;&#x6CD5;&#xFF0C;&#x5B83;&#x662F;&#x5728; 1990 &#x5E74;&#x4EE3;&#x672B;&#x671F;&#x51FA;&#x73B0;&#x7684;&#xFF0C;&#x5176;&#x601D;&#x60F3;&#x6D89;&#x53CA;&#x5982;&#x4F55;&#x4F7F;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x66F4;&#x52A0;&#x8F7B;&#x91CF;&#xFF0C;&#x7075;&#x6D3B;&#x548C;&#x589E;&#x91CF;&#x3002;&#x5B83;&#x662F;&#x5728; 2001 &#x5E74;&#x7684;&#x4E00;&#x6B21;&#x4ECE;&#x4E1A;&#x8005;&#x4F1A;&#x8BAE;&#x4E0A;&#x6B63;&#x5F0F;&#x5B9A;&#x4E49;&#x7684;&#x3002;&#x654F;&#x6377;&#x5F00;&#x53D1;&#x4E3B;&#x8981;&#x662F;&#x5173;&#x4E8E;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x7684;&#x8FC7;&#x7A0B;&#xFF08;&#x7EC4;&#x7EC7;&#x56E2;&#x961F;&#xFF0C;&#x7BA1;&#x7406;&#x8FDB;&#x5EA6;&#x8868;&#xFF0C;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x7684;&#x89D2;&#x8272;&#xFF0C;&#x4E0E;&#x5BA2;&#x6237;&#x4EA4;&#x4E92;&#x7B49;&#xFF09;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5B83;&#x4E0E;&#x672C;&#x4E66;&#x4E2D;&#x7684;&#x67D0;&#x4E9B;&#x8BBE;&#x8BA1;&#x539F;&#x5219;&#x6709;&#x5173;&#x3002;</p>
</blockquote>
<p>One of the most important elements of agile development is the notion that development should be incremental and iterative. In the agile approach, a software system is developed in a series of iterations, each of which adds and evaluates a few new features; each iteration includes design, test, and customer input. In general, this is similar to the incremental approach advocated here. As mentioned in Chapter 1, it isn&#x2019;t possible to visualize a complex system well enough at the outset of a project to determine the best design. The best way to end up with a good design is to develop a system in increments, where each increment adds a few new abstractions and refactors existing abstractions based on experience. This is similar to the agile development approach.</p>
<blockquote>
<p>&#x654F;&#x6377;&#x5F00;&#x53D1;&#x4E2D;&#x6700;&#x91CD;&#x8981;&#x7684;&#x5143;&#x7D20;&#x4E4B;&#x4E00;&#x662F;&#x5F00;&#x53D1;&#x5E94;&#x8BE5;&#x662F;&#x6E10;&#x8FDB;&#x7684;&#x548C;&#x8FED;&#x4EE3;&#x7684;&#x6982;&#x5FF5;&#x3002;&#x5728;&#x654F;&#x6377;&#x65B9;&#x6CD5;&#x4E2D;&#xFF0C;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x662F;&#x901A;&#x8FC7;&#x4E00;&#x7CFB;&#x5217;&#x8FED;&#x4EE3;&#x5F00;&#x53D1;&#x7684;&#xFF0C;&#x6BCF;&#x4E2A;&#x8FED;&#x4EE3;&#x90FD;&#x6DFB;&#x52A0;&#x5E76;&#x8BC4;&#x4F30;&#x4E86;&#x4E00;&#x4E9B;&#x65B0;&#x529F;&#x80FD;&#x3002;&#x6BCF;&#x4E2A;&#x8FED;&#x4EE3;&#x90FD;&#x5305;&#x62EC;&#x8BBE;&#x8BA1;&#xFF0C;&#x6D4B;&#x8BD5;&#x548C;&#x5BA2;&#x6237;&#x8F93;&#x5165;&#x3002;&#x901A;&#x5E38;&#xFF0C;&#x8FD9;&#x7C7B;&#x4F3C;&#x4E8E;&#x6B64;&#x5904;&#x63D0;&#x5021;&#x7684;&#x589E;&#x91CF;&#x65B9;&#x6CD5;&#x3002;&#x5982;&#x7B2C; 1 &#x7AE0;&#x6240;&#x8FF0;&#xFF0C;&#x5728;&#x9879;&#x76EE;&#x5F00;&#x59CB;&#x65F6;&#x5C31;&#x4E0D;&#x53EF;&#x80FD;&#x5BF9;&#x590D;&#x6742;&#x7684;&#x7CFB;&#x7EDF;&#x8FDB;&#x884C;&#x5145;&#x5206;&#x7684;&#x53EF;&#x89C6;&#x5316;&#x4EE5;&#x51B3;&#x5B9A;&#x6700;&#x4F73;&#x8BBE;&#x8BA1;&#x3002;&#x6700;&#x7EC8;&#x83B7;&#x5F97;&#x826F;&#x597D;&#x8BBE;&#x8BA1;&#x7684;&#x6700;&#x4F73;&#x65B9;&#x6CD5;&#x662F;&#x9010;&#x6B65;&#x5F00;&#x53D1;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#xFF0C;&#x5176;&#x4E2D;&#x6BCF;&#x4E2A;&#x589E;&#x91CF;&#x90FD;&#x4F1A;&#x6DFB;&#x52A0;&#x4E00;&#x4E9B;&#x65B0;&#x7684;&#x62BD;&#x8C61;&#xFF0C;&#x5E76;&#x6839;&#x636E;&#x7ECF;&#x9A8C;&#x91CD;&#x6784;&#x73B0;&#x6709;&#x7684;&#x62BD;&#x8C61;&#x3002;&#x8FD9;&#x7C7B;&#x4F3C;&#x4E8E;&#x654F;&#x6377;&#x5F00;&#x53D1;&#x65B9;&#x6CD5;&#x3002;</p>
</blockquote>
<p>One of the risks of agile development is that it can lead to tactical programming. Agile development tends to focus developers on features, not abstractions, and it encourages developers to put off design decisions in order to produce working software as soon as possible. For example, some agile practitioners argue that you shouldn&#x2019;t implement general-purpose mechanisms right away; implement a minimal special-purpose mechanism to start with, and refactor into something more generic later, once you know that it&#x2019;s needed. Although these arguments make sense to a degree, they argue against an investment approach, and they encourage a more tactical style of programming. This can result in a rapid accumulation of complexity.</p>
<blockquote>
<p>&#x654F;&#x6377;&#x5F00;&#x53D1;&#x7684;&#x98CE;&#x9669;&#x4E4B;&#x4E00;&#x662F;&#x5B83;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x6218;&#x672F;&#x7F16;&#x7A0B;&#x3002;&#x654F;&#x6377;&#x5F00;&#x53D1;&#x503E;&#x5411;&#x4E8E;&#x4F7F;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x4E13;&#x6CE8;&#x4E8E;&#x529F;&#x80FD;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x62BD;&#x8C61;&#xFF0C;&#x5B83;&#x9F13;&#x52B1;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x63A8;&#x8FDF;&#x8BBE;&#x8BA1;&#x51B3;&#x7B56;&#xFF0C;&#x4EE5;&#x4FBF;&#x5C3D;&#x5FEB;&#x751F;&#x4EA7;&#x53EF;&#x8FD0;&#x884C;&#x7684;&#x8F6F;&#x4EF6;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4E00;&#x4E9B;&#x654F;&#x6377;&#x7684;&#x4ECE;&#x4E1A;&#x8005;&#x8BA4;&#x4E3A;&#xFF0C;&#x60A8;&#x4E0D;&#x5E94;&#x8BE5;&#x7ACB;&#x5373;&#x5B9E;&#x65BD;&#x901A;&#x7528;&#x673A;&#x5236;&#x3002;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x6700;&#x5C0F;&#x7684;&#x7279;&#x6B8A;&#x7528;&#x9014;&#x673A;&#x5236;&#xFF0C;&#x4ECE;&#x6B64;&#x5F00;&#x59CB;&#xFF0C;&#x5E76;&#x5728;&#x4EE5;&#x540E;&#x77E5;&#x9053;&#x9700;&#x8981;&#x65F6;&#x91CD;&#x6784;&#x4E3A;&#x66F4;&#x901A;&#x7528;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x5C3D;&#x7BA1;&#x8FD9;&#x4E9B;&#x8BBA;&#x70B9;&#x5728;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x4E0A;&#x662F;&#x5408;&#x7406;&#x7684;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x53CD;&#x5BF9;&#x6295;&#x8D44;&#x65B9;&#x6CD5;&#xFF0C;&#x5E76;&#x9F13;&#x52B1;&#x91C7;&#x7528;&#x66F4;&#x5177;&#x6218;&#x672F;&#x6027;&#x7684;&#x7F16;&#x7A0B;&#x98CE;&#x683C;&#x3002;&#x8FD9;&#x53EF;&#x4EE5;&#x5BFC;&#x81F4;&#x590D;&#x6742;&#x6027;&#x7684;&#x5FEB;&#x901F;&#x7D2F;&#x79EF;&#x3002;</p>
</blockquote>
<p>Developing incrementally is generally a good idea, but the increments of development should be abstractions, not features. It&#x2019;s fine to put off all thoughts about a particular abstraction until it&#x2019;s needed by a feature. Once you need the abstraction, invest the time to design it cleanly; follow the advice of Chapter 6 and make it somewhat general-purpose.</p>
<blockquote>
<p>&#x6E10;&#x8FDB;&#x5F0F;&#x5F00;&#x53D1;&#x901A;&#x5E38;&#x662F;&#x4E00;&#x4E2A;&#x597D;&#x4E3B;&#x610F;&#xFF0C;&#x4F46;&#x662F;&#x6E10;&#x8FDB;&#x5F0F;&#x5F00;&#x53D1;&#x5E94;&#x8BE5;&#x662F;&#x62BD;&#x8C61;&#x7684;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x529F;&#x80FD;&#x3002;&#x53EF;&#x4EE5;&#x63A8;&#x8FDF;&#x5BF9;&#x7279;&#x5B9A;&#x62BD;&#x8C61;&#x7684;&#x6240;&#x6709;&#x60F3;&#x6CD5;&#xFF0C;&#x76F4;&#x5230;&#x529F;&#x80FD;&#x9700;&#x8981;&#x5B83;&#x4E3A;&#x6B62;&#x3002;&#x4E00;&#x65E6;&#x9700;&#x8981;&#x62BD;&#x8C61;&#xFF0C;&#x5C31;&#x8981;&#x82B1;&#x4E00;&#x4E9B;&#x65F6;&#x95F4;&#x8FDB;&#x884C;&#x7B80;&#x6D01;&#x7684;&#x8BBE;&#x8BA1;&#x3002;&#x9075;&#x5FAA;&#x7B2C; 6 &#x7AE0;&#x7684;&#x5EFA;&#x8BAE;&#x5E76;&#x4F7F;&#x5176;&#x5177;&#x6709;&#x901A;&#x7528;&#x6027;&#x3002;</p>
</blockquote>
<h2 id="193-unit-tests-&#x5355;&#x5143;&#x6D4B;&#x8BD5;">19.3 Unit tests &#x5355;&#x5143;&#x6D4B;&#x8BD5;</h2>
<p>It used to be that developers rarely wrote tests. If tests were written at all, they were written by a separate QA team. However, one of the tenets of agile development is that testing should be tightly integrated with development, and programmers should write tests for their own code. This practice has now become widespread. Tests are typically divided into two kinds: unit tests and system tests. Unit tests are the ones most often written by developers. They are small and focused: each test usually validates a small section of code in a single method. Unit tests can be run in isolation, without setting up a production environment for the system. Unit tests are often run in conjunction with a test coverage tool to ensure that every line of code in the application is tested. Whenever developers write new code or modify existing code, they are responsible for updating the unit tests to maintain proper test coverage.</p>
<blockquote>
<p>&#x8FC7;&#x53BB;&#xFF0C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5F88;&#x5C11;&#x7F16;&#x5199;&#x6D4B;&#x8BD5;&#x3002;&#x5982;&#x679C;&#x6D4B;&#x8BD5;&#x662F;&#x7531;&#x4E00;&#x4E2A;&#x72EC;&#x7ACB;&#x7684; QA &#x56E2;&#x961F;&#x7F16;&#x5199;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x4EEC;&#x5C31;&#x662F;&#x7531;&#x4E00;&#x4E2A;&#x72EC;&#x7ACB;&#x7684; QA &#x56E2;&#x961F;&#x7F16;&#x5199;&#x7684;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x654F;&#x6377;&#x5F00;&#x53D1;&#x7684;&#x539F;&#x5219;&#x4E4B;&#x4E00;&#x662F;&#x6D4B;&#x8BD5;&#x5E94;&#x8BE5;&#x4E0E;&#x5F00;&#x53D1;&#x7D27;&#x5BC6;&#x96C6;&#x6210;&#xFF0C;&#x7A0B;&#x5E8F;&#x5458;&#x5E94;&#x8BE5;&#x4E3A;&#x4ED6;&#x4EEC;&#x81EA;&#x5DF1;&#x7684;&#x4EE3;&#x7801;&#x7F16;&#x5199;&#x6D4B;&#x8BD5;&#x3002;&#x8FD9;&#x79CD;&#x505A;&#x6CD5;&#x73B0;&#x5728;&#x5DF2;&#x7ECF;&#x5F88;&#x666E;&#x904D;&#x4E86;&#x3002;&#x6D4B;&#x8BD5;&#x901A;&#x5E38;&#x5206;&#x4E3A;&#x4E24;&#x7C7B;:&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x548C;&#x7CFB;&#x7EDF;&#x6D4B;&#x8BD5;&#x3002;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x662F;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x6700;&#x5E38;&#x7F16;&#x5199;&#x7684;&#x6D4B;&#x8BD5;&#x3002;&#x5B83;&#x4EEC;&#x5F88;&#x5C0F;&#xFF0C;&#x800C;&#x4E14;&#x91CD;&#x70B9;&#x7A81;&#x51FA;:&#x6BCF;&#x4E2A;&#x6D4B;&#x8BD5;&#x901A;&#x5E38;&#x5728;&#x5355;&#x4E2A;&#x65B9;&#x6CD5;&#x4E2D;&#x9A8C;&#x8BC1;&#x4E00;&#x5C0F;&#x6BB5;&#x4EE3;&#x7801;&#x3002;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x53EF;&#x4EE5;&#x72EC;&#x7ACB;&#x8FD0;&#x884C;&#xFF0C;&#x800C;&#x4E0D;&#x9700;&#x8981;&#x4E3A;&#x7CFB;&#x7EDF;&#x8BBE;&#x7F6E;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x3002;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x901A;&#x5E38;&#x4E0E;&#x6D4B;&#x8BD5;&#x8986;&#x76D6;&#x5DE5;&#x5177;&#x4E00;&#x8D77;&#x8FD0;&#x884C;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x884C;&#x4EE3;&#x7801;&#x90FD;&#x7ECF;&#x8FC7;&#x4E86;&#x6D4B;&#x8BD5;&#x3002;&#x6BCF;&#x5F53;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x7F16;&#x5199;&#x65B0;&#x4EE3;&#x7801;&#x6216;&#x4FEE;&#x6539;&#x73B0;&#x6709;&#x4EE3;&#x7801;&#x65F6;&#xFF0C;&#x4ED6;&#x4EEC;&#x90FD;&#x8981;&#x8D1F;&#x8D23;&#x66F4;&#x65B0;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x4EE5;&#x4FDD;&#x6301;&#x9002;&#x5F53;&#x7684;&#x6D4B;&#x8BD5;&#x8986;&#x76D6;&#x7387;&#x3002;</p>
</blockquote>
<p>The second kind of test consists of system tests (sometimes called integration tests), which ensure that the different parts of an application all work together properly. They typically involve running the entire application in a production environment. System tests are more likely to be written by a separate QA or testing team.</p>
<blockquote>
<p>&#x7B2C;&#x4E8C;&#x79CD;&#x6D4B;&#x8BD5;&#x5305;&#x62EC;&#x7CFB;&#x7EDF;&#x6D4B;&#x8BD5;&#xFF08;&#x6709;&#x65F6;&#x79F0;&#x4E3A;&#x96C6;&#x6210;&#x6D4B;&#x8BD5;&#xFF09;&#xFF0C;&#x8FD9;&#x4E9B;&#x6D4B;&#x8BD5;&#x53EF;&#x786E;&#x4FDD;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x4E0D;&#x540C;&#x90E8;&#x5206;&#x90FD;&#x80FD;&#x6B63;&#x5E38;&#x534F;&#x540C;&#x5DE5;&#x4F5C;&#x3002;&#x5B83;&#x4EEC;&#x901A;&#x5E38;&#x6D89;&#x53CA;&#x5728;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x4E2D;&#x8FD0;&#x884C;&#x6574;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;&#x7CFB;&#x7EDF;&#x6D4B;&#x8BD5;&#x66F4;&#x6709;&#x53EF;&#x80FD;&#x7531;&#x72EC;&#x7ACB;&#x7684;&#x8D28;&#x91CF;&#x68C0;&#x67E5;&#x6216;&#x6D4B;&#x8BD5;&#x5C0F;&#x7EC4;&#x7F16;&#x5199;&#x3002;</p>
</blockquote>
<p>Tests, particularly unit tests, play an important role in software design because they facilitate refactoring. Without a test suite, it&#x2019;s dangerous to make major structural changes to a system. There&#x2019;s no easy way to find bugs, so it&#x2019;s likely that bugs will go undetected until the new code is deployed, where they are much more expensive to find and fix. As a result, developers avoid refactoring in systems without good test suites; they try to minimize the number of code changes for each new feature or bug fix, which means that complexity accumulates and design mistakes don&#x2019;t get corrected.</p>
<blockquote>
<p>&#x6D4B;&#x8BD5;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#xFF0C;&#x5728;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x4E2D;&#x8D77;&#x7740;&#x91CD;&#x8981;&#x4F5C;&#x7528;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x6709;&#x52A9;&#x4E8E;&#x91CD;&#x6784;&#x3002;&#x6CA1;&#x6709;&#x6D4B;&#x8BD5;&#x5957;&#x4EF6;&#xFF0C;&#x5BF9;&#x7CFB;&#x7EDF;&#x8FDB;&#x884C;&#x91CD;&#x5927;&#x7ED3;&#x6784;&#x66F4;&#x6539;&#x5F88;&#x5371;&#x9669;&#x3002;&#x6CA1;&#x6709;&#x5BB9;&#x6613;&#x627E;&#x5230;&#x9519;&#x8BEF;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x56E0;&#x6B64;&#x5728;&#x90E8;&#x7F72;&#x65B0;&#x4EE3;&#x7801;&#x4E4B;&#x524D;&#xFF0C;&#x5F88;&#x53EF;&#x80FD;&#x5C06;&#x65E0;&#x6CD5;&#x68C0;&#x6D4B;&#x5230;&#x9519;&#x8BEF;&#xFF0C;&#x56E0;&#x4E3A;&#x5728;&#x65B0;&#x4EE3;&#x7801;&#x4E2D;&#x67E5;&#x627E;&#x548C;&#x4FEE;&#x590D;&#x5B83;&#x4EEC;&#x7684;&#x6210;&#x672C;&#x8981;&#x9AD8;&#x5F97;&#x591A;&#x3002;&#x7ED3;&#x679C;&#xFF0C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x907F;&#x514D;&#x5728;&#x6CA1;&#x6709;&#x826F;&#x597D;&#x6D4B;&#x8BD5;&#x5957;&#x4EF6;&#x7684;&#x7CFB;&#x7EDF;&#x4E2D;&#x8FDB;&#x884C;&#x91CD;&#x6784;&#x3002;&#x4ED6;&#x4EEC;&#x5C1D;&#x8BD5;&#x5C06;&#x6BCF;&#x4E2A;&#x65B0;&#x529F;&#x80FD;&#x6216;&#x9519;&#x8BEF;&#x4FEE;&#x590D;&#x7684;&#x4EE3;&#x7801;&#x66F4;&#x6539;&#x6B21;&#x6570;&#x51CF;&#x81F3;&#x6700;&#x5C11;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x590D;&#x6742;&#x6027;&#x4F1A;&#x7D2F;&#x79EF;&#xFF0C;&#x800C;&#x8BBE;&#x8BA1;&#x9519;&#x8BEF;&#x4E0D;&#x4F1A;&#x5F97;&#x5230;&#x7EA0;&#x6B63;&#x3002;</p>
</blockquote>
<p>With a good set of tests, developers can be more confident when refactoring because the test suite will find most bugs that are introduced. This encourages developers to make structural improvements to a system, which results in a better design. Unit tests are particularly valuable: they provide a higher degree of code coverage than system tests, so they are more likely to uncover any bugs.</p>
<blockquote>
<p>&#x6709;&#x4E86;&#x4E00;&#x5957;&#x5F88;&#x597D;&#x7684;&#x6D4B;&#x8BD5;&#xFF0C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x53EF;&#x4EE5;&#x5728;&#x91CD;&#x6784;&#x65F6;&#x66F4;&#x6709;&#x4FE1;&#x5FC3;&#xFF0C;&#x56E0;&#x4E3A;&#x6D4B;&#x8BD5;&#x5957;&#x4EF6;&#x5C06;&#x53D1;&#x73B0;&#x5927;&#x591A;&#x6570;&#x5F15;&#x5165;&#x7684;&#x9519;&#x8BEF;&#x3002;&#x8FD9;&#x9F13;&#x52B1;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5BF9;&#x7CFB;&#x7EDF;&#x8FDB;&#x884C;&#x7ED3;&#x6784;&#x6539;&#x8FDB;&#xFF0C;&#x4ECE;&#x800C;&#x83B7;&#x5F97;&#x66F4;&#x597D;&#x7684;&#x8BBE;&#x8BA1;&#x3002;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x7279;&#x522B;&#x6709;&#x4EF7;&#x503C;&#xFF1A;&#x4E0E;&#x7CFB;&#x7EDF;&#x6D4B;&#x8BD5;&#x76F8;&#x6BD4;&#xFF0C;&#x5B83;&#x4EEC;&#x63D0;&#x4F9B;&#x66F4;&#x9AD8;&#x7684;&#x4EE3;&#x7801;&#x8986;&#x76D6;&#x7387;&#xFF0C;&#x56E0;&#x6B64;&#x5B83;&#x4EEC;&#x66F4;&#x6709;&#x53EF;&#x80FD;&#x53D1;&#x73B0;&#x4EFB;&#x4F55;&#x9519;&#x8BEF;&#x3002;</p>
</blockquote>
<p>For example, during the development of the Tcl scripting language, we decided to improve performance by replacing Tcl&#x2019;s interpreter with a byte-code compiler. This was a huge change that affected almost every part of the core Tcl engine. Fortunately, Tcl had an excellent unit test suite, which we ran on the new byte-code engine. The existing tests were so effective in uncovering bugs in the new engine that only a single bug turned up after the alpha release of the byte-code compiler.</p>
<blockquote>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x5728;&#x5F00;&#x53D1; Tcl &#x811A;&#x672C;&#x8BED;&#x8A00;&#x671F;&#x95F4;&#xFF0C;&#x6211;&#x4EEC;&#x51B3;&#x5B9A;&#x901A;&#x8FC7;&#x7528;&#x5B57;&#x8282;&#x7801;&#x7F16;&#x8BD1;&#x5668;&#x66FF;&#x6362; Tcl &#x7684;&#x89E3;&#x91CA;&#x5668;&#x6765;&#x63D0;&#x9AD8;&#x6027;&#x80FD;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5DE8;&#x5927;&#x7684;&#x53D8;&#x5316;&#xFF0C;&#x51E0;&#x4E4E;&#x5F71;&#x54CD;&#x4E86;&#x6838;&#x5FC3; Tcl &#x5F15;&#x64CE;&#x7684;&#x6BCF;&#x4E2A;&#x90E8;&#x5206;&#x3002;&#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;Tcl &#x6709;&#x4E00;&#x4E2A;&#x51FA;&#x8272;&#x7684;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x5957;&#x4EF6;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x65B0;&#x7684;&#x5B57;&#x8282;&#x7801;&#x5F15;&#x64CE;&#x4E0A;&#x8FD0;&#x884C;&#x4E86;&#x8BE5;&#x5957;&#x4EF6;&#x3002;&#x73B0;&#x6709;&#x6D4B;&#x8BD5;&#x5728;&#x53D1;&#x73B0;&#x65B0;&#x5F15;&#x64CE;&#x4E2D;&#x7684;&#x9519;&#x8BEF;&#x65B9;&#x9762;&#x662F;&#x5982;&#x6B64;&#x6709;&#x6548;&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;&#x5728;&#x5B57;&#x8282;&#x7801;&#x7F16;&#x8BD1;&#x5668;&#x7684; alpha &#x7248;&#x672C;&#x53D1;&#x5E03;&#x4E4B;&#x540E;&#x4EC5;&#x51FA;&#x73B0;&#x4E86;&#x4E00;&#x4E2A;&#x9519;&#x8BEF;&#x3002;</p>
</blockquote>
<h2 id="194-test-driven-development-&#x6D4B;&#x8BD5;&#x9A71;&#x52A8;&#x7684;&#x5F00;&#x53D1;">19.4 Test-driven development &#x6D4B;&#x8BD5;&#x9A71;&#x52A8;&#x7684;&#x5F00;&#x53D1;</h2>
<p>Test-driven development is an approach to software development where programmers write unit tests before they write code. When creating a new class, the developer first writes unit tests for the class, based on its expected behavior. None of the tests pass, since there is no code for the class. Then the developer works through the tests one at a time, writing enough code for that test to pass. When all of the tests pass, the class is finished.</p>
<blockquote>
<p>&#x6D4B;&#x8BD5;&#x9A71;&#x52A8;&#x5F00;&#x53D1;&#x662F;&#x4E00;&#x79CD;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x65B9;&#x6CD5;&#xFF0C;&#x7A0B;&#x5E8F;&#x5458;&#x53EF;&#x4EE5;&#x5728;&#x7F16;&#x5199;&#x4EE3;&#x7801;&#x4E4B;&#x524D;&#x5148;&#x7F16;&#x5199;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x3002;&#x521B;&#x5EFA;&#x65B0;&#x7C7B;&#x65F6;&#xFF0C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x9996;&#x5148;&#x6839;&#x636E;&#x5176;&#x9884;&#x671F;&#x884C;&#x4E3A;&#x4E3A;&#x8BE5;&#x7C7B;&#x7F16;&#x5199;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x3002;&#x6CA1;&#x6709;&#x6D4B;&#x8BD5;&#x901A;&#x8FC7;&#xFF0C;&#x56E0;&#x4E3A;&#x8BE5;&#x7C7B;&#x6CA1;&#x6709;&#x4EE3;&#x7801;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x4E00;&#x6B21;&#x5B8C;&#x6210;&#x4E00;&#x4E2A;&#x6D4B;&#x8BD5;&#xFF0C;&#x7F16;&#x5199;&#x8DB3;&#x591F;&#x7684;&#x4EE3;&#x7801;&#x4EE5;&#x4F7F;&#x8BE5;&#x6D4B;&#x8BD5;&#x901A;&#x8FC7;&#x3002;&#x6240;&#x6709;&#x6D4B;&#x8BD5;&#x901A;&#x8FC7;&#x540E;&#xFF0C;&#x8BE5;&#x7C7B;&#x7ED3;&#x675F;&#x3002;</p>
</blockquote>
<p>Although I am a strong advocate of unit testing, I am not a fan of test-driven development. The problem with test-driven development is that it focuses attention on getting specific features working, rather than finding the best design. This is tactical programming pure and simple, with all of its disadvantages. Test-driven development is too incremental: at any point in time, it&#x2019;s tempting to just hack in the next feature to make the next test pass. There&#x2019;s no obvious time to do design, so it&#x2019;s easy to end up with a mess.</p>
<blockquote>
<p>&#x5C3D;&#x7BA1;&#x6211;&#x662F;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x7684;&#x575A;&#x51B3;&#x62E5;&#x62A4;&#x8005;&#xFF0C;&#x4F46;&#x6211;&#x4E0D;&#x559C;&#x6B22;&#x6D4B;&#x8BD5;&#x9A71;&#x52A8;&#x7684;&#x5F00;&#x53D1;&#x3002;&#x6D4B;&#x8BD5;&#x9A71;&#x52A8;&#x5F00;&#x53D1;&#x7684;&#x95EE;&#x9898;&#x5728;&#x4E8E;&#xFF0C;&#x5B83;&#x5C06;&#x6CE8;&#x610F;&#x529B;&#x96C6;&#x4E2D;&#x5728;&#x4F7F;&#x7279;&#x5B9A;&#x529F;&#x80FD;&#x8D77;&#x4F5C;&#x7528;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5BFB;&#x627E;&#x6700;&#x4F73;&#x8BBE;&#x8BA1;&#x4E0A;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x7EAF;&#x51C0;&#x800C;&#x7B80;&#x5355;&#x7684;&#x6218;&#x672F;&#x7F16;&#x7A0B;&#xFF0C;&#x5177;&#x6709;&#x6240;&#x6709;&#x7F3A;&#x70B9;&#x3002;&#x6D4B;&#x8BD5;&#x9A71;&#x52A8;&#x7684;&#x5F00;&#x53D1;&#x8FC7;&#x4E8E;&#x589E;&#x91CF;&#xFF1A;&#x5728;&#x4EFB;&#x4F55;&#x65F6;&#x95F4;&#x70B9;&#xFF0C;&#x5F88;&#x5BB9;&#x6613;&#x7834;&#x89E3;&#x4E0B;&#x4E00;&#x4E2A;&#x529F;&#x80FD;&#x4EE5;&#x8FDB;&#x884C;&#x4E0B;&#x4E00;&#x4E2A;&#x6D4B;&#x8BD5;&#x901A;&#x8FC7;&#x3002;&#x6CA1;&#x6709;&#x660E;&#x663E;&#x7684;&#x65F6;&#x95F4;&#x8FDB;&#x884C;&#x8BBE;&#x8BA1;&#xFF0C;&#x56E0;&#x6B64;&#x5F88;&#x5BB9;&#x6613;&#x9677;&#x5165;&#x6DF7;&#x4E71;&#x3002;</p>
</blockquote>
<p>As mentioned in Section 19.2, the units of development should be abstractions, not features. Once you discover the need for an abstraction, don&#x2019;t create the abstraction in pieces over time; design it all at once (or at least enough to provide a reasonably comprehensive set of core functions). This is more likely to produce a clean design whose pieces fit together well.</p>
<blockquote>
<p>&#x5982;&#x7B2C; 19.2 &#x8282;&#x6240;&#x8FF0;&#xFF0C;&#x5F00;&#x53D1;&#x5355;&#x4F4D;&#x5E94;&#x8BE5;&#x662F;&#x62BD;&#x8C61;&#x7684;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x529F;&#x80FD;&#x3002;&#x4E00;&#x65E6;&#x53D1;&#x73B0;&#x9700;&#x8981;&#x62BD;&#x8C61;&#xFF0C;&#x5C31;&#x4E0D;&#x8981;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x6D41;&#x901D;&#x800C;&#x9010;&#x6B65;&#x521B;&#x5EFA;&#x62BD;&#x8C61;&#x3002;&#x4E00;&#x6B21;&#x8BBE;&#x8BA1;&#x6240;&#x6709;&#x529F;&#x80FD;&#xFF08;&#x6216;&#x81F3;&#x5C11;&#x8DB3;&#x4EE5;&#x63D0;&#x4F9B;&#x4E00;&#x7EC4;&#x5408;&#x7406;&#x5168;&#x9762;&#x7684;&#x6838;&#x5FC3;&#x529F;&#x80FD;&#xFF09;&#x3002;&#x8FD9;&#x6837;&#x66F4;&#x6709;&#x53EF;&#x80FD;&#x4EA7;&#x751F;&#x5E72;&#x51C0;&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x4F7F;&#x5404;&#x4E2A;&#x90E8;&#x5206;&#x5F88;&#x597D;&#x5730;&#x5951;&#x5408;&#x5728;&#x4E00;&#x8D77;&#x3002;</p>
</blockquote>
<p>One place where it makes sense to write the tests first is when fixing bugs. Before fixing a bug, write a unit test that fails because of the bug. Then fix the bug and make sure that the unit test now passes. This is the best way to make sure you really have fixed the bug. If you fix the bug before writing the test, it&#x2019;s possible that the new unit test doesn&#x2019;t actually trigger the bug, in which case it won&#x2019;t tell you whether you really fixed the problem.</p>
<blockquote>
<p>&#x9996;&#x5148;&#x7F16;&#x5199;&#x6D4B;&#x8BD5;&#x7684;&#x5730;&#x65B9;&#x662F;&#x4FEE;&#x590D;&#x9519;&#x8BEF;&#x3002;&#x4FEE;&#x590D;&#x9519;&#x8BEF;&#x4E4B;&#x524D;&#xFF0C;&#x8BF7;&#x7F16;&#x5199;&#x7531;&#x4E8E;&#x8BE5;&#x9519;&#x8BEF;&#x800C;&#x5931;&#x8D25;&#x7684;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x3002;&#x7136;&#x540E;&#x4FEE;&#x590D;&#x8BE5;&#x9519;&#x8BEF;&#xFF0C;&#x5E76;&#x786E;&#x4FDD;&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x3002;&#x8FD9;&#x662F;&#x786E;&#x4FDD;&#x60A8;&#x5DF2;&#x771F;&#x6B63;&#x4FEE;&#x590D;&#x8BE5;&#x9519;&#x8BEF;&#x7684;&#x6700;&#x4F73;&#x65B9;&#x6CD5;&#x3002;&#x5982;&#x679C;&#x60A8;&#x5728;&#x7F16;&#x5199;&#x6D4B;&#x8BD5;&#x4E4B;&#x524D;&#x5C31;&#x5DF2;&#x4FEE;&#x590D;&#x4E86;&#x8BE5;&#x9519;&#x8BEF;&#xFF0C;&#x5219;&#x65B0;&#x7684;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x5F88;&#x53EF;&#x80FD;&#x5B9E;&#x9645;&#x4E0A;&#x4E0D;&#x4F1A;&#x89E6;&#x53D1;&#x8BE5;&#x9519;&#x8BEF;&#xFF0C;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5B83;&#x4E0D;&#x4F1A;&#x544A;&#x8BC9;&#x60A8;&#x662F;&#x5426;&#x786E;&#x5B9E;&#x4FEE;&#x590D;&#x4E86;&#x8BE5;&#x95EE;&#x9898;&#x3002;</p>
</blockquote>
<h2 id="195-design-patterns-&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;">19.5 Design patterns &#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;</h2>
<p>A design pattern is a commonly used approach for solving a particular kind of problem, such as an iterator or an observer. The notion of design patterns was popularized by the book Design Patterns: Elements of Reusable Object-Oriented Software by Gamma, Helm, Johnson, and Vlissides, and design patterns are now widely used in object-oriented software development.</p>
<blockquote>
<p>&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x662F;&#x89E3;&#x51B3;&#x7279;&#x5B9A;&#x7C7B;&#x578B;&#x95EE;&#x9898;&#xFF08;&#x4F8B;&#x5982;&#x8FED;&#x4EE3;&#x5668;&#x6216;&#x89C2;&#x5BDF;&#x5668;&#xFF09;&#x7684;&#x5E38;&#x7528;&#x65B9;&#x6CD5;&#x3002;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x7684;&#x6982;&#x5FF5;&#x5728; Gamma&#xFF0C;Helm&#xFF0C;Johnson &#x548C; Vlissides &#x7684;&#x300A;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF1A;&#x53EF;&#x91CD;&#x7528;&#x7684;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x8F6F;&#x4EF6;&#x7684;&#x5143;&#x7D20;&#x300B;&#x4E00;&#x4E66;&#x4E2D;&#x5F97;&#x5230;&#x4E86;&#x666E;&#x53CA;&#xFF0C;&#x73B0;&#x5728;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x5DF2;&#x5E7F;&#x6CDB;&#x7528;&#x4E8E;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x4E2D;&#x3002;</p>
</blockquote>
<p>Design patterns represent an alternative to design: rather than designing a new mechanism from scratch, just apply a well-known design pattern. For the most part, this is good: design patterns arose because they solve common problems, and because they are generally agreed to provide clean solutions. If a design pattern works well in a particular situation, it will probably be hard for you to come up with a different approach that is better.</p>
<blockquote>
<p>&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x4EE3;&#x8868;&#x4E86;&#x8BBE;&#x8BA1;&#x7684;&#x66FF;&#x4EE3;&#x65B9;&#x6CD5;&#xFF1A;&#x4E0E;&#x5176;&#x4ECE;&#x5934;&#x8BBE;&#x8BA1;&#x65B0;&#x7684;&#x673A;&#x5236;&#xFF0C;&#x4E0D;&#x5982;&#x5E94;&#x7528;&#x4E00;&#x79CD;&#x4F17;&#x6240;&#x5468;&#x77E5;&#x7684;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x3002;&#x5728;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8FD9;&#x662F;&#x4EF6;&#x597D;&#x4E8B;&#xFF1A;&#x51FA;&#x73B0;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x662F;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x89E3;&#x51B3;&#x4E86;&#x5E38;&#x89C1;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5E76;&#x4E14;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x88AB;&#x666E;&#x904D;&#x540C;&#x610F;&#x63D0;&#x4F9B;&#x5E72;&#x51C0;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;&#x5982;&#x679C;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x5728;&#x7279;&#x5B9A;&#x60C5;&#x51B5;&#x4E0B;&#x8FD0;&#x4F5C;&#x826F;&#x597D;&#xFF0C;&#x90A3;&#x4E48;&#x60A8;&#x53EF;&#x80FD;&#x5F88;&#x96BE;&#x60F3;&#x51FA;&#x53E6;&#x4E00;&#x79CD;&#x66F4;&#x597D;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>
</blockquote>
<p>The greatest risk with design patterns is over-application. Not every problem can be solved cleanly with an existing design pattern; don&#x2019;t try to force a problem into a design pattern when a custom approach will be cleaner. Using design patterns doesn&#x2019;t automatically improve a software system; it only does so if the design patterns fit. As with many ideas in software design, the notion that design patterns are good doesn&#x2019;t necessarily mean that more design patterns are better.</p>
<blockquote>
<p>&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x7684;&#x6700;&#x5927;&#x98CE;&#x9669;&#x662F;&#x8FC7;&#x5EA6;&#x4F7F;&#x7528;&#x3002;&#x4F7F;&#x7528;&#x73B0;&#x6709;&#x7684;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x5E76;&#x4E0D;&#x80FD;&#x5B8C;&#x5168;&#x89E3;&#x51B3;&#x6240;&#x6709;&#x95EE;&#x9898;&#x3002;&#x5F53;&#x81EA;&#x5B9A;&#x4E49;&#x65B9;&#x6CD5;&#x66F4;&#x52A0;&#x7B80;&#x6D01;&#x65F6;&#xFF0C;&#x8BF7;&#x52FF;&#x5C1D;&#x8BD5;&#x5C06;&#x95EE;&#x9898;&#x5F3A;&#x52A0;&#x5230;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x4E2D;&#x3002;&#x4F7F;&#x7528;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x5E76;&#x4E0D;&#x80FD;&#x81EA;&#x52A8;&#x6539;&#x5584;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x3002;&#x53EA;&#x6709;&#x5728;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x5408;&#x9002;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x624D;&#x8FD9;&#x6837;&#x505A;&#x3002;&#x4E0E;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x4E2D;&#x7684;&#x8BB8;&#x591A;&#x60F3;&#x6CD5;&#x4E00;&#x6837;&#xFF0C;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x826F;&#x597D;&#x7684;&#x6982;&#x5FF5;&#x5E76;&#x4E0D;&#x4E00;&#x5B9A;&#x610F;&#x5473;&#x7740;&#x66F4;&#x591A;&#x7684;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x4F1A;&#x66F4;&#x597D;&#x3002;</p>
</blockquote>
<h2 id="196-getters-and-setters-getter-&#x548C;-setters">19.6 Getters and setters Getter &#x548C; Setters</h2>
<p>In the Java programming community, getter and setter methods are a popular design pattern. A getter and a setter are associated with an instance variable for a class. They have names like getFoo and setFoo, where Foo is the name of the variable. The getter method returns the current value of the variable, and the setter method modifies the value.</p>
<blockquote>
<p>&#x5728; Java &#x7F16;&#x7A0B;&#x793E;&#x533A;&#x4E2D;&#xFF0C;getter &#x548C; setter &#x65B9;&#x6CD5;&#x662F;&#x4E00;&#x79CD;&#x6D41;&#x884C;&#x7684;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x3002;&#x4E00;&#x4E2A; getter &#x548C;&#x4E00;&#x4E2A; setter &#x4E0E;&#x4E00;&#x4E2A;&#x7C7B;&#x7684;&#x5B9E;&#x4F8B;&#x53D8;&#x91CF;&#x76F8;&#x5173;&#x8054;&#x3002;&#x5B83;&#x4EEC;&#x5177;&#x6709;&#x7C7B;&#x4F3C; getFoo &#x548C; setFoo &#x7684;&#x540D;&#x79F0;&#xFF0C;&#x5176;&#x4E2D; Foo &#x662F;&#x53D8;&#x91CF;&#x7684;&#x540D;&#x79F0;&#x3002;getter &#x65B9;&#x6CD5;&#x8FD4;&#x56DE;&#x53D8;&#x91CF;&#x7684;&#x5F53;&#x524D;&#x503C;&#xFF0C;setter &#x65B9;&#x6CD5;&#x4FEE;&#x6539;&#x8BE5;&#x503C;&#x3002;</p>
</blockquote>
<p>Getters and setters aren&#x2019;t strictly necessary, since instance variables can be made public. The argument for getters and setters is that they allow additional functions to be performed while getting and setting, such as updating related values when a variable changes, notifying listeners of changes, or enforcing constraints on values. Even if these features aren&#x2019;t needed initially, they can be added later without changing the interface.</p>
<blockquote>
<p>&#x7531;&#x4E8E;&#x5B9E;&#x4F8B;&#x53D8;&#x91CF;&#x53EF;&#x4EE5;&#x516C;&#x5F00;&#xFF0C;&#x56E0;&#x6B64;&#x4E0D;&#x4E00;&#x5B9A;&#x5FC5;&#x987B;&#x4F7F;&#x7528; getter &#x548C; setter &#x65B9;&#x6CD5;&#x3002;getter &#x548C; setter &#x7684;&#x8BBA;&#x70B9;&#x662F;&#xFF0C;&#x5B83;&#x4EEC;&#x5141;&#x8BB8;&#x5728;&#x83B7;&#x53D6;&#x548C;&#x8BBE;&#x7F6E;&#x65F6;&#x6267;&#x884C;&#x5176;&#x4ED6;&#x529F;&#x80FD;&#xFF0C;&#x4F8B;&#x5982;&#x5728;&#x53D8;&#x91CF;&#x66F4;&#x6539;&#x65F6;&#x66F4;&#x65B0;&#x76F8;&#x5173;&#x503C;&#xFF0C;&#x901A;&#x77E5;&#x66F4;&#x6539;&#x7684;&#x4FA6;&#x542C;&#x5668;&#x6216;&#x5BF9;&#x503C;&#x5B9E;&#x65BD;&#x7EA6;&#x675F;&#x3002;&#x5373;&#x4F7F;&#x6700;&#x521D;&#x4E0D;&#x9700;&#x8981;&#x8FD9;&#x4E9B;&#x529F;&#x80FD;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x7A0D;&#x540E;&#x6DFB;&#x52A0;&#x5B83;&#x4EEC;&#x800C;&#x65E0;&#x9700;&#x66F4;&#x6539;&#x754C;&#x9762;&#x3002;</p>
</blockquote>
<p>Although it may make sense to use getters and setters if you must expose instance variables, it&#x2019;s better not to expose instance variables in the first place. Exposed instance variables mean that part of the class&#x2019;s implementation is visible externally, which violates the idea of information hiding and increases the complexity of the class&#x2019;s interface. Getters and setters are shallow methods (typically only a single line), so they add clutter to the class&#x2019;s interface without providing much functionality. It&#x2019;s better to avoid getters and setters (or any exposure of implementation data) as much as possible.</p>
<blockquote>
<p>&#x5C3D;&#x7BA1;&#x5982;&#x679C;&#x5FC5;&#x987B;&#x516C;&#x5F00;&#x5B9E;&#x4F8B;&#x53D8;&#x91CF;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; getter &#x548C; setter &#x65B9;&#x6CD5;&#xFF0C;&#x4F46;&#x6700;&#x597D;&#x4E0D;&#x8981;&#x9996;&#x5148;&#x516C;&#x5F00;&#x5B9E;&#x4F8B;&#x53D8;&#x91CF;&#x3002;&#x66B4;&#x9732;&#x7684;&#x5B9E;&#x4F8B;&#x53D8;&#x91CF;&#x610F;&#x5473;&#x7740;&#x7C7B;&#x7684;&#x5B9E;&#x73B0;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x5728;&#x5916;&#x90E8;&#x662F;&#x53EF;&#x89C1;&#x7684;&#xFF0C;&#x8FD9;&#x8FDD;&#x53CD;&#x4E86;&#x4FE1;&#x606F;&#x9690;&#x85CF;&#x7684;&#x601D;&#x60F3;&#xFF0C;&#x5E76;&#x589E;&#x52A0;&#x4E86;&#x7C7B;&#x63A5;&#x53E3;&#x7684;&#x590D;&#x6742;&#x6027;&#x3002;Getter &#x548C; Setter &#x662F;&#x6D45;&#x5C42;&#x65B9;&#x6CD5;&#xFF08;&#x901A;&#x5E38;&#x53EA;&#x6709;&#x4E00;&#x884C;&#xFF09;&#xFF0C;&#x56E0;&#x6B64;&#x5B83;&#x4EEC;&#x5728;&#x4E0D;&#x63D0;&#x4F9B;&#x592A;&#x591A;&#x529F;&#x80FD;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x4E3A;&#x7C7B;&#x7684;&#x63A5;&#x53E3;&#x589E;&#x52A0;&#x4E86;&#x6DF7;&#x4E71;&#x3002;&#x6700;&#x597D;&#x907F;&#x514D;&#x4F7F;&#x7528; getter &#x548C; setter&#xFF08;&#x6216;&#x4EFB;&#x4F55;&#x66B4;&#x9732;&#x7684;&#x5B9E;&#x73B0;&#x6570;&#x636E;&#xFF09;&#x3002;</p>
</blockquote>
<p>One of the risks of establishing a design pattern is that developers assume the pattern is good and try to use it as much as possible. This has led to overusage of getters and setters in Java.</p>
<blockquote>
<p>&#x5EFA;&#x7ACB;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x7684;&#x98CE;&#x9669;&#x4E4B;&#x4E00;&#x662F;&#xFF0C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x8BA4;&#x4E3A;&#x8BE5;&#x6A21;&#x5F0F;&#x662F;&#x597D;&#x7684;&#xFF0C;&#x5E76;&#x5C1D;&#x8BD5;&#x5C3D;&#x53EF;&#x80FD;&#x591A;&#x5730;&#x4F7F;&#x7528;&#x5B83;&#x3002;&#x8FD9;&#x5BFC;&#x81F4; Java &#x4E2D;&#x7684; getter &#x548C; setter &#x7684;&#x8FC7;&#x5EA6;&#x4F7F;&#x7528;&#x3002;</p>
</blockquote>
<h2 id="197-conclusion-&#x7ED3;&#x8BBA;">19.7 Conclusion &#x7ED3;&#x8BBA;</h2>
<p>Whenever you encounter a proposal for a new software development paradigm, challenge it from the standpoint of complexity: does the proposal really help to minimize complexity in large software systems? Many proposals sound good on the surface, but if you look more deeply you will see that some of them make complexity worse, not better.</p>
<blockquote>
<p>&#x6BCF;&#x5F53;&#x60A8;&#x9047;&#x5230;&#x6709;&#x5173;&#x65B0;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x8303;&#x4F8B;&#x7684;&#x63D0;&#x6848;&#x65F6;&#xFF0C;&#x5C31;&#x5FC5;&#x987B;&#x4ECE;&#x590D;&#x6742;&#x6027;&#x7684;&#x89D2;&#x5EA6;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x6311;&#x6218;&#xFF1A;&#x8BE5;&#x63D0;&#x6848;&#x786E;&#x5B9E;&#x6709;&#x52A9;&#x4E8E;&#x6700;&#x5927;&#x7A0B;&#x5EA6;&#x5730;&#x964D;&#x4F4E;&#x5927;&#x578B;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x590D;&#x6742;&#x6027;&#x5417;&#xFF1F;&#x4ECE;&#x8868;&#x9762;&#x4E0A;&#x770B;&#xFF0C;&#x8BB8;&#x591A;&#x5EFA;&#x8BAE;&#x542C;&#x8D77;&#x6765;&#x4E0D;&#x9519;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;&#x60A8;&#x6DF1;&#x5165;&#x7814;&#x7A76;&#xFF0C;&#x60A8;&#x4F1A;&#x53D1;&#x73B0;&#x5176;&#x4E2D;&#x4E00;&#x4E9B;&#x4F1A;&#x4F7F;&#x590D;&#x6742;&#x6027;&#x6076;&#x5316;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x66F4;&#x597D;&#x3002;</p>
</blockquote>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="ch18.html" class="navigation navigation-prev " aria-label="Previous page: 第十八章: 代码应该是显而易见的">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="ch20.html" class="navigation navigation-next " aria-label="Next page: 第二十章: 设计性能">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第十九章: 软件发展趋势","level":"1.22","depth":1,"next":{"title":"第二十章: 设计性能","level":"1.23","depth":1,"path":"docs/ch20.md","ref":"./docs/ch20.md","articles":[]},"previous":{"title":"第十八章: 代码应该是显而易见的","level":"1.21","depth":1,"path":"docs/ch18.md","ref":"./docs/ch18.md","articles":[]},"dir":"ltr"},"config":{"plugins":["back-to-top-button","expandable-chapters-small","page-toc-button","livereload"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"livereload":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"page-toc-button":{},"back-to-top-button":{},"expandable-chapters-small":{},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"John Ousterhout","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"软件设计哲学","language":"zh-hans","gitbook":"*","description":"书中讨论了软件设计的主题：如何将复杂的软件系统分解成可以相对独立实现的模块(如类和方法)"},"file":{"path":"docs/ch19.md","mtime":"2020-08-06T16:26:19.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-02-06T04:55:41.669Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-page-toc-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

