
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第二章：复杂性的本质 · 软件设计哲学</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="John Ousterhout">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-page-toc-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="ch3.html" />
    
    
    <link rel="prev" href="ch1.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    首页
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="preface">
            
                <span>
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="ch1.html">
            
                <a href="ch1.html">
            
                    
                    第一章：介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.5" data-path="ch2.html">
            
                <a href="ch2.html">
            
                    
                    第二章：复杂性的本质
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="ch3.html">
            
                <a href="ch3.html">
            
                    
                    第三章：工作代码是不够的（战略与战术编程）
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="ch4.html">
            
                <a href="ch4.html">
            
                    
                    第四章：模块应该是深的
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="ch5.html">
            
                <a href="ch5.html">
            
                    
                    第五章：信息隐藏(和泄露)
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="ch6.html">
            
                <a href="ch6.html">
            
                    
                    第六章：通用模块更深入
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="ch7.html">
            
                <a href="ch7.html">
            
                    
                    第七章: 不同的层，不同的抽象
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="ch8.html">
            
                <a href="ch8.html">
            
                    
                    第八章: 降低复杂性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="ch9.html">
            
                <a href="ch9.html">
            
                    
                    第九章: 在一起更好还是分开更好？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="ch10.html">
            
                <a href="ch10.html">
            
                    
                    第十章: 定义不存在的错误
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="ch11.html">
            
                <a href="ch11.html">
            
                    
                    第十一章: 设计它两次
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="ch12.html">
            
                <a href="ch12.html">
            
                    
                    第十二章: 为什么写注释？四个理由
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="ch13.html">
            
                <a href="ch13.html">
            
                    
                    第十三章: 注释应该描述代码中不明显的内容
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="ch14.html">
            
                <a href="ch14.html">
            
                    
                    第十四章: 选择的名字
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="ch15.html">
            
                <a href="ch15.html">
            
                    
                    第十五章: 先写注释
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="ch16.html">
            
                <a href="ch16.html">
            
                    
                    第十六章: 修改现有的代码
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.20" data-path="ch17.html">
            
                <a href="ch17.html">
            
                    
                    第十七章: 一致性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.21" data-path="ch18.html">
            
                <a href="ch18.html">
            
                    
                    第十八章: 代码应该是显而易见的
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.22" data-path="ch19.html">
            
                <a href="ch19.html">
            
                    
                    第十九章: 软件发展趋势
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.23" data-path="ch20.html">
            
                <a href="ch20.html">
            
                    
                    第二十章: 设计性能
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.24" data-path="ch21.html">
            
                <a href="ch21.html">
            
                    
                    第二十一章: 结论
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.25" data-path="summary.html">
            
                <a href="summary.html">
            
                    
                    总结
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >第二章：复杂性的本质</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7B2C;&#x4E8C;&#x7AE0;&#xFF1A;&#x590D;&#x6742;&#x6027;&#x7684;&#x672C;&#x8D28;">&#x7B2C;&#x4E8C;&#x7AE0;&#xFF1A;&#x590D;&#x6742;&#x6027;&#x7684;&#x672C;&#x8D28;</h1>
<p>&#x8FD9;&#x672C;&#x4E66;&#x662F;&#x5173;&#x4E8E;&#x5982;&#x4F55;&#x8BBE;&#x8BA1;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x4EE5;&#x6700;&#x5C0F;&#x5316;&#x5176;&#x590D;&#x6742;&#x6027;&#x3002;&#x7B2C;&#x4E00;&#x6B65;&#x662F;&#x4E86;&#x89E3;&#x654C;&#x4EBA;&#x3002;&#x7A76;&#x7ADF;&#x4EC0;&#x4E48;&#x662F;&#x201C;&#x590D;&#x6742;&#x6027;&#x201D;&#xFF1F;&#x60A8;&#x5982;&#x4F55;&#x5224;&#x65AD;&#x7CFB;&#x7EDF;&#x662F;&#x5426;&#x8FC7;&#x4E8E;&#x590D;&#x6742;&#xFF1F;&#x662F;&#x4EC0;&#x4E48;&#x5BFC;&#x81F4;&#x7CFB;&#x7EDF;&#x53D8;&#x5F97;&#x590D;&#x6742;&#xFF1F;&#x672C;&#x7AE0;&#x5C06;&#x5728;&#x8F83;&#x9AD8;&#x5C42;&#x6B21;&#x4E0A;&#x89E3;&#x51B3;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x3002;&#x540E;&#x7EED;&#x7AE0;&#x8282;&#x5C06;&#x5411;&#x60A8;&#x5C55;&#x793A;&#x5982;&#x4F55;&#x4ECE;&#x8F83;&#x4F4E;&#x7684;&#x5C42;&#x6B21;&#x4E0A;&#x6839;&#x636E;&#x7279;&#x5B9A;&#x7684;&#x7ED3;&#x6784;&#x7279;&#x5F81;&#x6765;&#x8BC6;&#x522B;&#x590D;&#x6742;&#x6027;&#x3002;</p>
<p>&#x8BC6;&#x522B;&#x590D;&#x6742;&#x6027;&#x7684;&#x80FD;&#x529B;&#x662F;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x7684;&#x8BBE;&#x8BA1;&#x6280;&#x80FD;&#x3002;&#x5B83;&#x4F7F;&#x60A8;&#x53EF;&#x4EE5;&#x5148;&#x627E;&#x51FA;&#x95EE;&#x9898;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x4ED8;&#x51FA;&#x5927;&#x91CF;&#x52AA;&#x529B;&#xFF0C;&#x5E76;&#x53EF;&#x4EE5;&#x5728;&#x5176;&#x4ED6;&#x9009;&#x62E9;&#x4E2D;&#x505A;&#x51FA;&#x6B63;&#x786E;&#x7684;&#x9009;&#x62E9;&#x3002;&#x5224;&#x65AD;&#x4E00;&#x4E2A;&#x8BBE;&#x8BA1;&#x662F;&#x5426;&#x7B80;&#x5355;&#x6BD4;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x8BBE;&#x8BA1;&#x8981;&#x5BB9;&#x6613;&#x5F97;&#x591A;&#xFF0C;&#x4F46;&#x662F;&#x4E00;&#x65E6;&#x60A8;&#x8BA4;&#x8BC6;&#x5230;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x8FC7;&#x4E8E;&#x590D;&#x6742;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x8BE5;&#x529F;&#x80FD;&#x6307;&#x5BFC;&#x60A8;&#x7684;&#x8BBE;&#x8BA1;&#x54F2;&#x5B66;&#x8D70;&#x5411;&#x7B80;&#x5355;&#x3002;&#x5982;&#x679C;&#x8BBE;&#x8BA1;&#x770B;&#x8D77;&#x6765;&#x5F88;&#x590D;&#x6742;&#xFF0C;&#x8BF7;&#x5C1D;&#x8BD5;&#x5176;&#x4ED6;&#x65B9;&#x6CD5;&#xFF0C;&#x770B;&#x770B;&#x662F;&#x5426;&#x66F4;&#x7B80;&#x5355;&#x3002;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x6D41;&#x901D;&#xFF0C;&#x60A8;&#x4F1A;&#x6CE8;&#x610F;&#x5230;&#x67D0;&#x4E9B;&#x6280;&#x672F;&#x5F80;&#x5F80;&#x4F1A;&#x5BFC;&#x81F4;&#x8BBE;&#x8BA1;&#x66F4;&#x7B80;&#x5355;&#xFF0C;&#x800C;&#x5176;&#x4ED6;&#x6280;&#x672F;&#x5219;&#x4E0E;&#x590D;&#x6742;&#x6027;&#x76F8;&#x5173;&#x3002;&#x8FD9;&#x5C06;&#x4F7F;&#x60A8;&#x66F4;&#x5FEB;&#x5730;&#x5236;&#x4F5C;&#x66F4;&#x7B80;&#x5355;&#x7684;&#x8BBE;&#x8BA1;&#x3002;</p>
<p>&#x672C;&#x7AE0;&#x8FD8;&#x5217;&#x51FA;&#x4E86;&#x4E00;&#x4E9B;&#x57FA;&#x672C;&#x5047;&#x8BBE;&#xFF0C;&#x8FD9;&#x4E9B;&#x57FA;&#x672C;&#x5047;&#x8BBE;&#x4E3A;&#x672C;&#x4E66;&#x7684;&#x5176;&#x4F59;&#x90E8;&#x5206;&#x5960;&#x5B9A;&#x4E86;&#x57FA;&#x7840;&#x3002;&#x540E;&#x9762;&#x7684;&#x7AE0;&#x8282;&#x5C06;&#x91C7;&#x7528;&#x672C;&#x7AE0;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x5E76;&#x7528;&#x5176;&#x8BBA;&#x8BC1;&#x5404;&#x79CD;&#x6539;&#x8FDB;&#x548C;&#x7ED3;&#x8BBA;&#x3002;</p>
<h2 id="21-&#x590D;&#x6742;&#x6027;&#x7684;&#x5B9A;&#x4E49;">2.1 &#x590D;&#x6742;&#x6027;&#x7684;&#x5B9A;&#x4E49;</h2>
<p>&#x51FA;&#x4E8E;&#x672C;&#x4E66;&#x7684;&#x76EE;&#x7684;&#xFF0C;&#x6211;&#x4EE5;&#x5B9E;&#x7528;&#x7684;&#x65B9;&#x5F0F;&#x5B9A;&#x4E49;&#x201C;&#x590D;&#x6742;&#x6027;&#x201D;&#x3002;&#x590D;&#x6742;&#x6027;&#x4E0E;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x7ED3;&#x6784;&#x6709;&#x5173;&#xFF0C;&#x8FD9;&#x4F7F;&#x5B83;&#x5F88;&#x96BE;&#x7406;&#x89E3;&#x548C;&#x4FEE;&#x6539;&#x7CFB;&#x7EDF;&#x3002;&#x590D;&#x6742;&#x6027;&#x53EF;&#x4EE5;&#x91C7;&#x53D6;&#x591A;&#x79CD;&#x5F62;&#x5F0F;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x53EF;&#x80FD;&#x5F88;&#x96BE;&#x7406;&#x89E3;&#x4E00;&#x6BB5;&#x4EE3;&#x7801;&#x662F;&#x5982;&#x4F55;&#x5DE5;&#x4F5C;&#x7684;&#x3002;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x82B1;&#x8D39;&#x5F88;&#x591A;&#x7CBE;&#x529B;&#x624D;&#x80FD;&#x5B9E;&#x73B0;&#x8F83;&#x5C0F;&#x7684;&#x6539;&#x8FDB;&#xFF0C;&#x6216;&#x8005;&#x53EF;&#x80FD;&#x4E0D;&#x6E05;&#x695A;&#x5FC5;&#x987B;&#x4FEE;&#x6539;&#x7CFB;&#x7EDF;&#x7684;&#x54EA;&#x4E9B;&#x90E8;&#x5206;&#x624D;&#x80FD;&#x8FDB;&#x884C;&#x6539;&#x8FDB;&#xFF1B;&#x5982;&#x679C;&#x4E0D;&#x5F15;&#x5165;&#x5176;&#x4ED6;&#x9519;&#x8BEF;&#xFF0C;&#x53EF;&#x80FD;&#x5F88;&#x96BE;&#x4FEE;&#x590D;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x96BE;&#x4EE5;&#x7406;&#x89E3;&#x548C;&#x4FEE;&#x6539;&#xFF0C;&#x90A3;&#x5C31;&#x5F88;&#x590D;&#x6742;&#x3002;&#x5982;&#x679C;&#x5F88;&#x5BB9;&#x6613;&#x7406;&#x89E3;&#x548C;&#x4FEE;&#x6539;&#xFF0C;&#x90A3;&#x5C31;&#x5F88;&#x7B80;&#x5355;&#x3002;</p>
<p>&#x60A8;&#x8FD8;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x6210;&#x672C;&#x548C;&#x6536;&#x76CA;&#x65B9;&#x9762;&#x7684;&#x590D;&#x6742;&#x6027;&#x3002;&#x5728;&#x590D;&#x6742;&#x7684;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x8981;&#x5B9E;&#x65BD;&#x751A;&#x81F3;&#x5F88;&#x5C0F;&#x7684;&#x6539;&#x8FDB;&#x90FD;&#x9700;&#x8981;&#x5927;&#x91CF;&#x7684;&#x5DE5;&#x4F5C;&#x3002;&#x5728;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x66F4;&#x5C11;&#x7684;&#x7CBE;&#x529B;&#x5B9E;&#x73B0;&#x66F4;&#x5927;&#x7684;&#x6539;&#x8FDB;&#x3002;</p>
<p>&#x590D;&#x6742;&#x6027;&#x662F;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5728;&#x5C1D;&#x8BD5;&#x5B9E;&#x73B0;&#x7279;&#x5B9A;&#x76EE;&#x6807;&#x65F6;&#x5728;&#x7279;&#x5B9A;&#x65F6;&#x95F4;&#x70B9;&#x6240;&#x7ECF;&#x5386;&#x7684;&#x3002;&#x5B83;&#x4E0D;&#x4E00;&#x5B9A;&#x4E0E;&#x7CFB;&#x7EDF;&#x7684;&#x6574;&#x4F53;&#x5927;&#x5C0F;&#x6216;&#x529F;&#x80FD;&#x6709;&#x5173;&#x3002;&#x4EBA;&#x4EEC;&#x901A;&#x5E38;&#x4F7F;&#x7528;&#x201C;&#x590D;&#x6742;&#x201D;&#x4E00;&#x8BCD;&#x6765;&#x63CF;&#x8FF0;&#x5177;&#x6709;&#x590D;&#x6742;&#x529F;&#x80FD;&#x7684;&#x5927;&#x578B;&#x7CFB;&#x7EDF;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;&#x8FD9;&#x6837;&#x7684;&#x7CFB;&#x7EDF;&#x6613;&#x4E8E;&#x4F7F;&#x7528;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x672C;&#x4E66;&#x800C;&#x8A00;&#xFF0C;&#x5B83;&#x5E76;&#x4E0D;&#x590D;&#x6742;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x5927;&#x578B;&#x590D;&#x6742;&#x7684;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x90FD;&#x5F88;&#x96BE;&#x4F7F;&#x7528;&#xFF0C;&#x56E0;&#x6B64;&#x5B83;&#x4EEC;&#x4E5F;&#x7B26;&#x5408;&#x6211;&#x5BF9;&#x590D;&#x6742;&#x6027;&#x7684;&#x5B9A;&#x4E49;&#xFF0C;&#x4F46;&#x8FD9;&#x4E0D;&#x4E00;&#x5B9A;&#x662F;&#x4E8B;&#x5B9E;&#x3002;&#x5C0F;&#x578B;&#x800C;&#x4E0D;&#x590D;&#x6742;&#x7684;&#x7CFB;&#x7EDF;&#x4E5F;&#x53EF;&#x80FD;&#x975E;&#x5E38;&#x590D;&#x6742;&#x3002;</p>
<p>&#x590D;&#x6742;&#x6027;&#x53D6;&#x51B3;&#x4E8E;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x6D3B;&#x52A8;&#x3002;&#x5982;&#x679C;&#x7CFB;&#x7EDF;&#x4E2D;&#x6709;&#x4E00;&#x4E9B;&#x975E;&#x5E38;&#x590D;&#x6742;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x4F46;&#x662F;&#x51E0;&#x4E4E;&#x4E0D;&#x9700;&#x8981;&#x89E6;&#x6478;&#x8FD9;&#x4E9B;&#x90E8;&#x5206;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x4EEC;&#x5BF9;&#x7CFB;&#x7EDF;&#x7684;&#x6574;&#x4F53;&#x590D;&#x6742;&#x6027;&#x4E0D;&#x4F1A;&#x6709;&#x592A;&#x5927;&#x5F71;&#x54CD;&#x3002;&#x4E3A;&#x4E86;&#x7528;&#x7C97;&#x7565;&#x7684;&#x6570;&#x5B66;&#x65B9;&#x6CD5;&#x6765;&#x8868;&#x5F81;&#xFF1A;
<img src="https://s1.ax1x.com/2020/07/03/NL672F.png" alt="NL672F.png"></p>
<p>&#x7CFB;&#x7EDF;&#x7684;&#x603B;&#x4F53;&#x590D;&#x6742;&#x5EA6;&#xFF08;C&#xFF09;&#x7531;&#x6BCF;&#x4E2A;&#x90E8;&#x5206;&#x7684;&#x590D;&#x6742;&#x5EA6;&#xFF08;cp&#xFF09;&#x4E58;&#x4EE5;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5728;&#x8BE5;&#x90E8;&#x5206;&#x4E0A;&#x82B1;&#x8D39;&#x7684;&#x65F6;&#x95F4;&#xFF08;tp&#xFF09;&#x52A0;&#x6743;&#x3002;&#x5728;&#x4E00;&#x4E2A;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x88AB;&#x770B;&#x5230;&#x7684;&#x5730;&#x65B9;&#x9694;&#x79BB;&#x590D;&#x6742;&#x6027;&#x51E0;&#x4E4E;&#x548C;&#x5B8C;&#x5168;&#x6D88;&#x9664;&#x590D;&#x6742;&#x6027;&#x4E00;&#x6837;&#x597D;&#x3002;</p>
<p>&#x8BFB;&#x8005;&#x6BD4;&#x4F5C;&#x5BB6;&#x66F4;&#x5BB9;&#x6613;&#x7406;&#x89E3;&#x590D;&#x6742;&#x6027;&#x3002;&#x5982;&#x679C;&#x60A8;&#x7F16;&#x5199;&#x4E86;&#x4E00;&#x6BB5;&#x4EE3;&#x7801;&#xFF0C;&#x5BF9;&#x60A8;&#x6765;&#x8BF4;&#x4F3C;&#x4E4E;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x4F46;&#x662F;&#x5176;&#x4ED6;&#x4EBA;&#x5219;&#x8BA4;&#x4E3A;&#x5B83;&#x5F88;&#x590D;&#x6742;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x5C31;&#x662F;&#x590D;&#x6742;&#x7684;&#x3002;&#x5F53;&#x60A8;&#x9047;&#x5230;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x65F6;&#xFF0C;&#x6709;&#x5FC5;&#x8981;&#x5BF9;&#x5176;&#x4ED6;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x8FDB;&#x884C;&#x8C03;&#x67E5;&#xFF0C;&#x4EE5;&#x627E;&#x51FA;&#x4E3A;&#x4EC0;&#x4E48;&#x4EE3;&#x7801;&#x5BF9;&#x4ED6;&#x4EEC;&#x800C;&#x8A00;&#x4F3C;&#x4E4E;&#x5F88;&#x590D;&#x6742;&#xFF1B;&#x4ECE;&#x60A8;&#x7684;&#x89C2;&#x70B9;&#x4E0E;&#x89C2;&#x70B9;&#x4E4B;&#x95F4;&#x7684;&#x8131;&#x8282;&#x4E2D;&#x53EF;&#x80FD;&#x53EF;&#x4EE5;&#x5B66;&#x4E60;&#x4E00;&#x4E9B;&#x6709;&#x8DA3;&#x7684;&#x8BFE;&#x7A0B;&#x3002;&#x4F5C;&#x4E3A;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#xFF0C;&#x60A8;&#x7684;&#x5DE5;&#x4F5C;&#x4E0D;&#x4EC5;&#x662F;&#x521B;&#x5EFA;&#x53EF;&#x4EE5;&#x8F7B;&#x677E;&#x4F7F;&#x7528;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x8981;&#x521B;&#x5EFA;&#x5176;&#x4ED6;&#x4EBA;&#x4E5F;&#x53EF;&#x4EE5;&#x8F7B;&#x677E;&#x4F7F;&#x7528;&#x7684;&#x4EE3;&#x7801;</p>
<h2 id="22-&#x590D;&#x6742;&#x6027;&#x7684;&#x75C7;&#x72B6;">2.2 &#x590D;&#x6742;&#x6027;&#x7684;&#x75C7;&#x72B6;</h2>
<p>&#x590D;&#x6742;&#x6027;&#x901A;&#x8FC7;&#x4EE5;&#x4E0B;&#x4E09;&#x79CD;&#x6BB5;&#x843D;&#x4E2D;&#x63CF;&#x8FF0;&#x7684;&#x4E09;&#x79CD;&#x4E00;&#x822C;&#x65B9;&#x5F0F;&#x4F53;&#x73B0;&#x51FA;&#x6765;&#x3002;&#x8FD9;&#x4E9B;&#x8868;&#x73B0;&#x5F62;&#x5F0F;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x90FD;&#x4F7F;&#x6267;&#x884C;&#x5F00;&#x53D1;&#x4EFB;&#x52A1;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x56F0;&#x96BE;&#x3002;</p>
<p><strong>&#x53D8;&#x66F4;&#x653E;&#x5927;&#xFF1A;</strong>&#x590D;&#x6742;&#x6027;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x5F81;&#x5146;&#x662F;&#xFF0C;&#x770B;&#x4F3C;&#x7B80;&#x5355;&#x7684;&#x53D8;&#x66F4;&#x9700;&#x8981;&#x5728;&#x8BB8;&#x591A;&#x4E0D;&#x540C;&#x5730;&#x65B9;&#x8FDB;&#x884C;&#x4EE3;&#x7801;&#x4FEE;&#x6539;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x8003;&#x8651;&#x4E00;&#x4E2A;&#x5305;&#x542B;&#x51E0;&#x4E2A;&#x9875;&#x9762;&#x7684;&#x7F51;&#x7AD9;&#xFF0C;&#x6BCF;&#x4E2A;&#x9875;&#x9762;&#x663E;&#x793A;&#x5E26;&#x6709;&#x80CC;&#x666F;&#x8272;&#x7684;&#x6A2A;&#x5E45;&#x3002;&#x5728;&#x8BB8;&#x591A;&#x65E9;&#x671F;&#x7684;&#x7F51;&#x7AD9;&#x4E2D;&#xFF0C;&#x989C;&#x8272;&#x662F;&#x5728;&#x6BCF;&#x4E2A;&#x9875;&#x9762;&#x4E0A;&#x660E;&#x786E;&#x6307;&#x5B9A;&#x7684;&#xFF0C;&#x5982;&#x56FE; 2.1&#xFF08;a&#xFF09;&#x6240;&#x793A;&#x3002;&#x4E3A;&#x4E86;&#x66F4;&#x6539;&#x6B64;&#x7C7B;&#x7F51;&#x7AD9;&#x7684;&#x80CC;&#x666F;&#xFF0C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x53EF;&#x80FD;&#x5FC5;&#x987B;&#x624B;&#x52A8;&#x4FEE;&#x6539;&#x6BCF;&#x4E2A;&#x73B0;&#x6709;&#x9875;&#x9762;&#xFF1B;&#x5BF9;&#x4E8E;&#x62E5;&#x6709;&#x6570;&#x5343;&#x4E2A;&#x9875;&#x9762;&#x7684;&#x5927;&#x578B;&#x7F51;&#x7AD9;&#x800C;&#x8A00;&#xFF0C;&#x8FD9;&#x51E0;&#x4E4E;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x7684;&#x3002;&#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;&#x73B0;&#x4EE3;&#x7F51;&#x7AD9;&#x4F7F;&#x7528;&#x7684;&#x65B9;&#x6CD5;&#x7C7B;&#x4F3C;&#x4E8E;&#x56FE; 2.1&#xFF08;b&#xFF09;&#xFF0C;&#x5176;&#x4E2D;&#x6A2A;&#x5E45;&#x989C;&#x8272;&#x4E00;&#x6B21;&#x5728;&#x4E2D;&#x5FC3;&#x4F4D;&#x7F6E;&#x6307;&#x5B9A;&#xFF0C;&#x5E76;&#x4E14;&#x6240;&#x6709;&#x5404;&#x4E2A;&#x9875;&#x9762;&#x5747;&#x5F15;&#x7528;&#x8BE5;&#x5171;&#x4EAB;&#x503C;&#x3002;&#x4F7F;&#x7528;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E00;&#x6B21;&#x4FEE;&#x6539;&#x6765;&#x66F4;&#x6539;&#x6574;&#x4E2A;&#x7F51;&#x7AD9;&#x7684;&#x6807;&#x9898;&#x989C;&#x8272;&#x3002;</p>
<p><strong>&#x8BA4;&#x77E5;&#x8D1F;&#x8377;&#xFF1A;</strong>&#x590D;&#x6742;&#x6027;&#x7684;&#x7B2C;&#x4E8C;&#x4E2A;&#x75C7;&#x72B6;&#x662F;&#x8BA4;&#x77E5;&#x8D1F;&#x8377;&#xFF0C;&#x8FD9;&#x662F;&#x6307;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x9700;&#x8981;&#x591A;&#x5C11;&#x77E5;&#x8BC6;&#x624D;&#x80FD;&#x5B8C;&#x6210;&#x4E00;&#x9879;&#x4EFB;&#x52A1;&#x3002;&#x8F83;&#x9AD8;&#x7684;&#x8BA4;&#x77E5;&#x8D1F;&#x62C5;&#x610F;&#x5473;&#x7740;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5FC5;&#x987B;&#x82B1;&#x66F4;&#x591A;&#x7684;&#x65F6;&#x95F4;&#x6765;&#x5B66;&#x4E60;&#x6240;&#x9700;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x5E76;&#x4E14;&#x7531;&#x4E8E;&#x9519;&#x8FC7;&#x4E86;&#x91CD;&#x8981;&#x7684;&#x4E1C;&#x897F;&#x800C;&#x5BFC;&#x81F4;&#x9519;&#x8BEF;&#x7684;&#x98CE;&#x9669;&#x4E5F;&#x66F4;&#x5927;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5047;&#x8BBE; C &#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x5206;&#x914D;&#x4E86;&#x5185;&#x5B58;&#xFF0C;&#x8FD4;&#x56DE;&#x4E86;&#x6307;&#x5411;&#x8BE5;&#x5185;&#x5B58;&#x7684;&#x6307;&#x9488;&#xFF0C;&#x5E76;&#x5047;&#x5B9A;&#x8C03;&#x7528;&#x8005;&#x5C06;&#x91CA;&#x653E;&#x8BE5;&#x5185;&#x5B58;&#x3002;&#x8FD9;&#x589E;&#x52A0;&#x4E86;&#x4F7F;&#x7528;&#x8BE5;&#x529F;&#x80FD;&#x7684;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x7684;&#x8BA4;&#x77E5;&#x8D1F;&#x62C5;&#x3002;&#x5982;&#x679C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x65E0;&#x6CD5;&#x91CA;&#x653E;&#x5185;&#x5B58;&#xFF0C;&#x5219;&#x4F1A;&#x53D1;&#x751F;&#x5185;&#x5B58;&#x6CC4;&#x6F0F;&#x3002;&#x5982;&#x679C;&#x53EF;&#x4EE5;&#x5BF9;&#x7CFB;&#x7EDF;&#x8FDB;&#x884C;&#x91CD;&#x7EC4;&#xFF0C;&#x4EE5;&#x4F7F;&#x8C03;&#x7528;&#x8005;&#x4E0D;&#x5FC5;&#x62C5;&#x5FC3;&#x91CA;&#x653E;&#x5185;&#x5B58;&#xFF08;&#x5206;&#x914D;&#x5185;&#x5B58;&#x7684;&#x540C;&#x4E00;&#x6A21;&#x5757;&#x4E5F;&#x8D1F;&#x8D23;&#x91CA;&#x653E;&#x5185;&#x5B58;&#xFF09;&#xFF0C;&#x5B83;&#x5C06;&#x51CF;&#x5C11;&#x8BA4;&#x77E5;&#x8D1F;&#x62C5;&#x3002;</p>
<p>&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;&#x4EBA;&#x5458;&#x6709;&#x65F6;&#x4F1A;&#x5047;&#x8BBE;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4EE3;&#x7801;&#x884C;&#x6765;&#x8861;&#x91CF;&#x590D;&#x6742;&#x6027;&#x3002;&#x4ED6;&#x4EEC;&#x8BA4;&#x4E3A;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x5B9E;&#x73B0;&#x6BD4;&#x53E6;&#x4E00;&#x4E2A;&#x5B9E;&#x73B0;&#x77ED;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x5FC5;&#x987B;&#x66F4;&#x7B80;&#x5355;&#xFF1B;&#x5982;&#x679C;&#x53EA;&#x9700;&#x8981;&#x51E0;&#x884C;&#x4EE3;&#x7801;&#x5C31;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x66F4;&#x6539;&#xFF0C;&#x90A3;&#x4E48;&#x66F4;&#x6539;&#x5FC5;&#x987B;&#x5F88;&#x5BB9;&#x6613;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x8FD9;&#x79CD;&#x89C2;&#x70B9;&#x5FFD;&#x7565;&#x4E86;&#x4E0E;&#x8BA4;&#x77E5;&#x8D1F;&#x8377;&#x76F8;&#x5173;&#x7684;&#x6210;&#x672C;&#x3002;&#x6211;&#x5DF2;&#x7ECF;&#x770B;&#x5230;&#x4E86;&#x4EC5;&#x5141;&#x8BB8;&#x4F7F;&#x7528;&#x51E0;&#x884C;&#x4EE3;&#x7801;&#x7F16;&#x5199;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x6846;&#x67B6;&#xFF0C;&#x4F46;&#x662F;&#x8981;&#x5F04;&#x6E05;&#x695A;&#x8FD9;&#x4E9B;&#x884C;&#x662F;&#x4EC0;&#x4E48;&#x6781;&#x5176;&#x56F0;&#x96BE;&#x3002;&#x6709;&#x65F6;&#xFF0C;&#x9700;&#x8981;&#x66F4;&#x591A;&#x4EE3;&#x7801;&#x884C;&#x7684;&#x65B9;&#x6CD5;&#x5B9E;&#x9645;&#x4E0A;&#x66F4;&#x7B80;&#x5355;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x51CF;&#x5C11;&#x4E86;&#x8BA4;&#x77E5;&#x8D1F;&#x62C5;&#x3002;</p>
<p><img src="https://s1.ax1x.com/2020/07/03/NLcSPK.png" alt="NLcSPK.png"></p>
<blockquote>
<p>&#x56FE; 2.1&#xFF1A;&#x7F51;&#x7AD9;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x9875;&#x9762;&#x90FD;&#x663E;&#x793A;&#x4E00;&#x4E2A;&#x5F69;&#x8272;&#x6A2A;&#x5E45;&#x3002;&#x5728;&#xFF08;a&#xFF09;&#x4E2D;&#xFF0C;&#x6A2A;&#x5E45;&#x7684;&#x80CC;&#x666F;&#x8272;&#x5728;&#x6BCF;&#x9875;&#x4E2D;&#x90FD;&#x660E;&#x786E;&#x6307;&#x5B9A;&#x3002;&#x5728;&#xFF08;b&#xFF09;&#x4E2D;&#xFF0C;&#x5171;&#x4EAB;&#x53D8;&#x91CF;&#x4FDD;&#x7559;&#x80CC;&#x666F;&#x8272;&#xFF0C;&#x5E76;&#x4E14;&#x6BCF;&#x4E2A;&#x9875;&#x9762;&#x90FD;&#x5F15;&#x7528;&#x8BE5;&#x53D8;&#x91CF;&#x3002;&#x5728;&#xFF08;c&#xFF09;&#x4E2D;&#xFF0C;&#x67D0;&#x4E9B;&#x9875;&#x9762;&#x4F1A;&#x663E;&#x793A;&#x5176;&#x4ED6;&#x7528;&#x4E8E;&#x5F3A;&#x8C03;&#x7684;&#x989C;&#x8272;&#xFF0C;&#x5373;&#x6A2A;&#x5E45;&#x80CC;&#x666F;&#x989C;&#x8272;&#x7684;&#x6697;&#x8272;&#xFF1B;&#x5982;&#x679C;&#x80CC;&#x666F;&#x989C;&#x8272;&#x6539;&#x53D8;&#xFF0C;&#x5219;&#x5F3A;&#x8C03;&#x989C;&#x8272;&#x4E5F;&#x5FC5;&#x987B;&#x6539;&#x53D8;&#x3002;</p>
</blockquote>
<p><strong>&#x672A;&#x77E5;&#x7684;&#x672A;&#x77E5;:</strong> &#x590D;&#x6742;&#x6027;&#x7684;&#x7B2C;&#x4E09;&#x4E2A;&#x75C7;&#x72B6;&#x662F;&#xFF0C;&#x5FC5;&#x987B;&#x4FEE;&#x6539;&#x54EA;&#x4E9B;&#x4EE3;&#x7801;&#x624D;&#x80FD;&#x5B8C;&#x6210;&#x4EFB;&#x52A1;&#xFF0C;&#x6216;&#x8005;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5FC5;&#x987B;&#x83B7;&#x5F97;&#x54EA;&#x4E9B;&#x4FE1;&#x606F;&#x624D;&#x80FD;&#x6210;&#x529F;&#x5730;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#xFF0C;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x4E0D;&#x660E;&#x663E;&#x7684;&#x3002;&#x56FE; 2.1(c)&#x8BF4;&#x660E;&#x4E86;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;&#x7F51;&#x7AD9;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x4E2D;&#x5FC3;&#x53D8;&#x91CF;&#x6765;&#x786E;&#x5B9A;&#x6A2A;&#x5E45;&#x7684;&#x80CC;&#x666F;&#x989C;&#x8272;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x770B;&#x8D77;&#x6765;&#x5F88;&#x5BB9;&#x6613;&#x6539;&#x53D8;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x4E00;&#x4E9B; Web &#x9875;&#x9762;&#x4F7F;&#x7528;&#x8F83;&#x6697;&#x7684;&#x80CC;&#x666F;&#x8272;&#x6765;&#x5F3A;&#x8C03;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x5404;&#x4E2A;&#x9875;&#x9762;&#x4E2D;&#x660E;&#x786E;&#x6307;&#x5B9A;&#x4E86;&#x8F83;&#x6697;&#x7684;&#x989C;&#x8272;&#x3002;&#x5982;&#x679C;&#x80CC;&#x666F;&#x989C;&#x8272;&#x6539;&#x53D8;&#xFF0C;&#x90A3;&#x4E48;&#x5F3A;&#x8C03;&#x7684;&#x989C;&#x8272;&#x5FC5;&#x987B;&#x6539;&#x53D8;&#x4EE5;&#x5339;&#x914D;&#x3002;&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x4E0D;&#x592A;&#x53EF;&#x80FD;&#x610F;&#x8BC6;&#x5230;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x6240;&#x4EE5;&#x4ED6;&#x4EEC;&#x53EF;&#x80FD;&#x4F1A;&#x66F4;&#x6539;&#x4E2D;&#x592E; bannerBg &#x53D8;&#x91CF;&#x800C;&#x4E0D;&#x66F4;&#x65B0;&#x5F3A;&#x8C03;&#x989C;&#x8272;&#x3002;&#x5373;&#x4F7F;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x610F;&#x8BC6;&#x5230;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4E5F;&#x4E0D;&#x6E05;&#x695A;&#x54EA;&#x4E9B;&#x9875;&#x9762;&#x4F7F;&#x7528;&#x4E86;&#x5F3A;&#x8C03;&#x8272;&#xFF0C;&#x56E0;&#x6B64;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x53EF;&#x80FD;&#x5FC5;&#x987B;&#x641C;&#x7D22; Web &#x7AD9;&#x70B9;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x9875;&#x9762;&#x3002;</p>
<p>&#x5728;&#x590D;&#x6742;&#x6027;&#x7684;&#x4E09;&#x79CD;&#x8868;&#x73B0;&#x5F62;&#x5F0F;&#x4E2D;&#xFF0C;&#x672A;&#x77E5;&#x7684;&#x672A;&#x77E5;&#x662F;&#x6700;&#x7CDF;&#x7CD5;&#x7684;&#x3002;&#x4E00;&#x4E2A;&#x672A;&#x77E5;&#x7684;&#x672A;&#x77E5;&#x610F;&#x5473;&#x7740;&#x4F60;&#x9700;&#x8981;&#x77E5;&#x9053;&#x4E00;&#x4E9B;&#x4E8B;&#x60C5;&#xFF0C;&#x4F46;&#x662F;&#x4F60;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x627E;&#x5230;&#x5B83;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x751A;&#x81F3;&#x662F;&#x5426;&#x6709;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x3002;&#x4F60;&#x4E0D;&#x4F1A;&#x53D1;&#x73B0;&#x5B83;&#xFF0C;&#x76F4;&#x5230;&#x9519;&#x8BEF;&#x51FA;&#x73B0;&#x540E;&#xFF0C;&#x4F60;&#x505A;&#x4E86;&#x4E00;&#x4E2A;&#x6539;&#x53D8;&#x3002;&#x66F4;&#x6539;&#x653E;&#x5927;&#x662F;&#x4EE4;&#x4EBA;&#x607C;&#x706B;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x53EA;&#x8981;&#x6E05;&#x695A;&#x54EA;&#x4E9B;&#x4EE3;&#x7801;&#x9700;&#x8981;&#x4FEE;&#x6539;&#xFF0C;&#x4E00;&#x65E6;&#x66F4;&#x6539;&#x5B8C;&#x6210;&#xFF0C;&#x7CFB;&#x7EDF;&#x5C31;&#x4F1A;&#x5DE5;&#x4F5C;&#x3002;&#x540C;&#x6837;&#xFF0C;&#x9AD8;&#x7684;&#x8BA4;&#x77E5;&#x8D1F;&#x8377;&#x4F1A;&#x589E;&#x52A0;&#x6539;&#x53D8;&#x7684;&#x6210;&#x672C;&#xFF0C;&#x4F46;&#x5982;&#x679C;&#x660E;&#x786E;&#x8981;&#x9605;&#x8BFB;&#x54EA;&#x4E9B;&#x4FE1;&#x606F;&#xFF0C;&#x6539;&#x53D8;&#x4ECD;&#x7136;&#x53EF;&#x80FD;&#x662F;&#x6B63;&#x786E;&#x7684;&#x3002;&#x5BF9;&#x4E8E;&#x672A;&#x77E5;&#x7684;&#x672A;&#x77E5;&#xFF0C;&#x4E0D;&#x6E05;&#x695A;&#x8BE5;&#x505A;&#x4EC0;&#x4E48;&#xFF0C;&#x6216;&#x8005;&#x63D0;&#x51FA;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x662F;&#x5426;&#x6709;&#x6548;&#x3002;&#x552F;&#x4E00;&#x786E;&#x5B9A;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x8BFB;&#x53D6;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x884C;&#x4EE3;&#x7801;&#xFF0C;&#x8FD9;&#x5BF9;&#x4E8E;&#x4EFB;&#x4F55;&#x5927;&#x5C0F;&#x7684;&#x7CFB;&#x7EDF;&#x90FD;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x7684;&#x3002;&#x751A;&#x81F3;&#x8FD9;&#x53EF;&#x80FD;&#x8FD8;&#x4E0D;&#x591F;&#xFF0C;&#x56E0;&#x4E3A;&#x66F4;&#x6539;&#x53EF;&#x80FD;&#x4F9D;&#x8D56;&#x4E8E;&#x4E00;&#x4E2A;&#x4ECE;&#x672A;&#x8BB0;&#x5F55;&#x7684;&#x7EC6;&#x5FAE;&#x8BBE;&#x8BA1;&#x51B3;&#x7B56;&#x3002;</p>
<p>&#x826F;&#x597D;&#x8BBE;&#x8BA1;&#x7684;&#x6700;&#x91CD;&#x8981;&#x76EE;&#x6807;&#x4E4B;&#x4E00;&#x5C31;&#x662F;&#x4F7F;&#x7CFB;&#x7EDF;&#x663E;&#x800C;&#x6613;&#x89C1;&#x3002;&#x8FD9;&#x4E0E;&#x9AD8;&#x8BA4;&#x77E5;&#x8D1F;&#x8377;&#x548C;&#x672A;&#x77E5;&#x672A;&#x77E5;&#x6570;&#x76F8;&#x53CD;&#x3002;&#x5728;&#x4E00;&#x4E2A;&#x663E;&#x800C;&#x6613;&#x89C1;&#x7684;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x53EF;&#x4EE5;&#x5FEB;&#x901F;&#x4E86;&#x89E3;&#x73B0;&#x6709;&#x4EE3;&#x7801;&#x7684;&#x5DE5;&#x4F5C;&#x65B9;&#x5F0F;&#x4EE5;&#x53CA;&#x8FDB;&#x884C;&#x66F4;&#x6539;&#x6240;&#x9700;&#x7684;&#x5185;&#x5BB9;&#x3002;&#x4E00;&#x4E2A;&#x663E;&#x800C;&#x6613;&#x89C1;&#x7684;&#x7CFB;&#x7EDF;&#x662F;&#xFF0C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x8D39;&#x529B;&#x5730;&#x601D;&#x8003;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x5FEB;&#x901F;&#x731C;&#x6D4B;&#x8981;&#x505A;&#x4EC0;&#x4E48;&#xFF0C;&#x540C;&#x65F6;&#x53C8;&#x53EF;&#x4EE5;&#x786E;&#x4FE1;&#x8BE5;&#x731C;&#x6D4B;&#x662F;&#x6B63;&#x786E;&#x7684;&#x3002;&#x7B2C; 18 &#x7AE0;&#x8BA8;&#x8BBA;&#x4F7F;&#x4EE3;&#x7801;&#x66F4;&#x660E;&#x663E;&#x7684;&#x6280;&#x672F;&#x3002;</p>
<h2 id="23-&#x590D;&#x6742;&#x6027;&#x7684;&#x539F;&#x56E0;">2.3 &#x590D;&#x6742;&#x6027;&#x7684;&#x539F;&#x56E0;</h2>
<p>&#x65E2;&#x7136;&#x60A8;&#x5DF2;&#x7ECF;&#x4E86;&#x89E3;&#x4E86;&#x590D;&#x6742;&#x6027;&#x7684;&#x9AD8;&#x7EA7;&#x75C7;&#x72B6;&#x4EE5;&#x53CA;&#x4E3A;&#x4EC0;&#x4E48;&#x590D;&#x6742;&#x6027;&#x4F1A;&#x4F7F;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x53D8;&#x5F97;&#x56F0;&#x96BE;&#xFF0C;&#x90A3;&#x4E48;&#x4E0B;&#x4E00;&#x6B65;&#x5C31;&#x662F;&#x4E86;&#x89E3;&#x5BFC;&#x81F4;&#x590D;&#x6742;&#x6027;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x4EE5;&#x4FBF;&#x6211;&#x4EEC;&#x8BBE;&#x8BA1;&#x7CFB;&#x7EDF;&#x6765;&#x907F;&#x514D;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x3002;&#x590D;&#x6742;&#x6027;&#x662F;&#x7531;&#x4E24;&#x4EF6;&#x4E8B;&#x5F15;&#x8D77;&#x7684;&#xFF1A;&#x4F9D;&#x8D56;&#x6027;&#x548C;&#x6A21;&#x7CCA;&#x6027;&#x3002;&#x672C;&#x8282;&#x4ECE;&#x9AD8;&#x5C42;&#x6B21;&#x8BA8;&#x8BBA;&#x8FD9;&#x4E9B;&#x56E0;&#x7D20;&#x3002;&#x968F;&#x540E;&#x7684;&#x7AE0;&#x8282;&#x5C06;&#x8BA8;&#x8BBA;&#x5B83;&#x4EEC;&#x4E0E;&#x4F4E;&#x7EA7;&#x8BBE;&#x8BA1;&#x51B3;&#x7B56;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x3002;</p>
<p>&#x5C31;&#x672C;&#x4E66;&#x800C;&#x8A00;&#xFF0C;&#x5F53;&#x65E0;&#x6CD5;&#x5B64;&#x7ACB;&#x5730;&#x7406;&#x89E3;&#x548C;&#x4FEE;&#x6539;&#x7ED9;&#x5B9A;&#x7684;&#x4E00;&#x6BB5;&#x4EE3;&#x7801;&#x65F6;&#xFF0C;&#x4FBF;&#x5B58;&#x5728;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x3002;&#x8BE5;&#x4EE3;&#x7801;&#x4EE5;&#x67D0;&#x79CD;&#x65B9;&#x5F0F;&#x4E0E;&#x5176;&#x4ED6;&#x4EE3;&#x7801;&#x76F8;&#x5173;&#xFF0C;&#x5982;&#x679C;&#x66F4;&#x6539;&#x4E86;&#x7ED9;&#x5B9A;&#x4EE3;&#x7801;&#xFF0C;&#x5219;&#x5FC5;&#x987B;&#x8003;&#x8651;&#x548C;/&#x6216;&#x4FEE;&#x6539;&#x5176;&#x4ED6;&#x4EE3;&#x7801;&#x3002;&#x5728;&#x56FE; 2.1&#xFF08;a&#xFF09;&#x7684;&#x7F51;&#x7AD9;&#x793A;&#x4F8B;&#x4E2D;&#xFF0C;&#x80CC;&#x666F;&#x8272;&#x5728;&#x6240;&#x6709;&#x9875;&#x9762;&#x4E4B;&#x95F4;&#x521B;&#x5EFA;&#x4E86;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x3002;&#x6240;&#x6709;&#x9875;&#x9762;&#x90FD;&#x5FC5;&#x987B;&#x5177;&#x6709;&#x76F8;&#x540C;&#x7684;&#x80CC;&#x666F;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x5982;&#x679C;&#x66F4;&#x6539;&#x4E00;&#x9875;&#x7684;&#x80CC;&#x666F;&#xFF0C;&#x5219;&#x5FC5;&#x987B;&#x66F4;&#x6539;&#x6240;&#x6709;&#x80CC;&#x666F;&#x3002;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x793A;&#x4F8B;&#x53D1;&#x751F;&#x5728;&#x7F51;&#x7EDC;&#x534F;&#x8BAE;&#x4E2D;&#x3002;&#x901A;&#x5E38;&#xFF0C;&#x534F;&#x8BAE;&#x7684;&#x53D1;&#x9001;&#x65B9;&#x548C;&#x63A5;&#x6536;&#x65B9;&#x6709;&#x5355;&#x72EC;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x4EEC;&#x5FC5;&#x987B;&#x5206;&#x522B;&#x7B26;&#x5408;&#x534F;&#x8BAE;&#x3002;&#x66F4;&#x6539;&#x53D1;&#x9001;&#x65B9;&#x7684;&#x4EE3;&#x7801;&#x51E0;&#x4E4E;&#x603B;&#x662F;&#x9700;&#x8981;&#x5728;&#x63A5;&#x6536;&#x65B9;&#x8FDB;&#x884C;&#x76F8;&#x5E94;&#x7684;&#x66F4;&#x6539;&#xFF0C;&#x53CD;&#x4E4B;&#x4EA6;&#x7136;&#x3002;</p>
<p>&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x662F;&#x8F6F;&#x4EF6;&#x7684;&#x57FA;&#x672C;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#xFF0C;&#x4E0D;&#x80FD;&#x5B8C;&#x5168;&#x6D88;&#x9664;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x8FC7;&#x7A0B;&#x4E2D;&#x6709;&#x610F;&#x5F15;&#x5165;&#x4E86;&#x4F9D;&#x8D56;&#x6027;&#x3002;&#x6BCF;&#x6B21;&#x7F16;&#x5199;&#x65B0;&#x7C7B;&#x65F6;&#xFF0C;&#x90FD;&#x4F1A;&#x56F4;&#x7ED5;&#x8BE5;&#x7C7B;&#x7684; API &#x521B;&#x5EFA;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x7684;&#x76EE;&#x6807;&#x4E4B;&#x4E00;&#x662F;&#x51CF;&#x5C11;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x7684;&#x6570;&#x91CF;&#xFF0C;&#x5E76;&#x4F7F;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x4FDD;&#x6301;&#x5C3D;&#x53EF;&#x80FD;&#x7B80;&#x5355;&#x548C;&#x660E;&#x663E;&#x3002;</p>
<p>&#x8003;&#x8651;&#x7F51;&#x7AD9;&#x793A;&#x4F8B;&#x3002;&#x5728;&#x6BCF;&#x4E2A;&#x9875;&#x9762;&#x5206;&#x522B;&#x6307;&#x5B9A;&#x80CC;&#x666F;&#x7684;&#x65E7;&#x7F51;&#x7AD9;&#x4E2D;&#xFF0C;&#x6240;&#x6709;&#x7F51;&#x9875;&#x90FD;&#x662F;&#x76F8;&#x4E92;&#x4F9D;&#x8D56;&#x7684;&#x3002;&#x65B0;&#x7684;&#x7F51;&#x7AD9;&#x901A;&#x8FC7;&#x5728;&#x4E2D;&#x5FC3;&#x4F4D;&#x7F6E;&#x6307;&#x5B9A;&#x80CC;&#x666F;&#x8272;&#x5E76;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A; API&#xFF0C;&#x4F9B;&#x5404;&#x4E2A;&#x9875;&#x9762;&#x5728;&#x5448;&#x73B0;&#x5B83;&#x4EEC;&#x65F6;&#x68C0;&#x7D22;&#x8BE5;&#x989C;&#x8272;&#xFF0C;&#x4ECE;&#x800C;&#x89E3;&#x51B3;&#x4E86;&#x8BE5;&#x95EE;&#x9898;&#x3002;&#x65B0;&#x7684;&#x7F51;&#x7AD9;&#x6D88;&#x9664;&#x4E86;&#x9875;&#x9762;&#x4E4B;&#x95F4;&#x7684;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x56F4;&#x7ED5; API &#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x4EE5;&#x68C0;&#x7D22;&#x80CC;&#x666F;&#x8272;&#x3002;&#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;&#x65B0;&#x7684;&#x4F9D;&#x8D56;&#x6027;&#x66F4;&#x52A0;&#x660E;&#x663E;&#xFF1A;&#x5F88;&#x660E;&#x663E;&#xFF0C;&#x6BCF;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x7F51;&#x9875;&#x90FD;&#x53D6;&#x51B3;&#x4E8E; bannerBg &#x989C;&#x8272;&#xFF0C;&#x5E76;&#x4E14;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x641C;&#x7D22;&#x5176;&#x540D;&#x79F0;&#x8F7B;&#x677E;&#x627E;&#x5230;&#x4F7F;&#x7528;&#x8BE5;&#x53D8;&#x91CF;&#x7684;&#x6240;&#x6709;&#x4F4D;&#x7F6E;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x7F16;&#x8BD1;&#x5668;&#x8FD8;&#x6709;&#x52A9;&#x4E8E;&#x7BA1;&#x7406; API &#x4F9D;&#x8D56;&#x6027;&#xFF1A;&#x5982;&#x679C;&#x5171;&#x4EAB;&#x53D8;&#x91CF;&#x7684;&#x540D;&#x79F0;&#x53D1;&#x751F;&#x53D8;&#x5316;&#xFF0C;&#x4EFB;&#x4F55;&#x4ECD;&#x4F7F;&#x7528;&#x65E7;&#x540D;&#x79F0;&#x7684;&#x4EE3;&#x7801;&#x90FD;&#x5C06;&#x53D1;&#x751F;&#x7F16;&#x8BD1;&#x9519;&#x8BEF;&#x3002;&#x65B0;&#x7684;&#x7F51;&#x7AD9;&#x7528;&#x4E00;&#x79CD;&#x66F4;&#x7B80;&#x5355;&#xFF0C;&#x66F4;&#x660E;&#x663E;&#x7684;&#x65B9;&#x5F0F;&#x4EE3;&#x66FF;&#x4E86;&#x4E00;&#x79CD;&#x4E0D;&#x660E;&#x663E;&#x4E14;&#x96BE;&#x4EE5;&#x7BA1;&#x7406;&#x7684;&#x4F9D;&#x8D56;&#x6027;&#x3002;</p>
<p>&#x590D;&#x6742;&#x6027;&#x7684;&#x7B2C;&#x4E8C;&#x4E2A;&#x539F;&#x56E0;&#x662F;&#x6666;&#x6DA9;&#x3002;&#x5F53;&#x91CD;&#x8981;&#x7684;&#x4FE1;&#x606F;&#x4E0D;&#x660E;&#x663E;&#x65F6;&#xFF0C;&#x5C31;&#x4F1A;&#x53D1;&#x751F;&#x6A21;&#x7CCA;&#x3002;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x4F8B;&#x5B50;&#x662F;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x540D;&#xFF0C;&#x5B83;&#x662F;&#x5982;&#x6B64;&#x7684;&#x901A;&#x7528;&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;&#x5B83;&#x6CA1;&#x6709;&#x643A;&#x5E26;&#x592A;&#x591A;&#x6709;&#x7528;&#x7684;&#x4FE1;&#x606F;(&#x4F8B;&#x5982;&#xFF0C;&#x65F6;&#x95F4;)&#x3002;&#x6216;&#x8005;&#xFF0C;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x7684;&#x6587;&#x6863;&#x53EF;&#x80FD;&#x6CA1;&#x6709;&#x6307;&#x5B9A;&#x5B83;&#x7684;&#x5355;&#x4F4D;&#xFF0C;&#x6240;&#x4EE5;&#x627E;&#x5230;&#x5B83;&#x7684;&#x60DF;&#x4E00;&#x65B9;&#x6CD5;&#x662F;&#x626B;&#x63CF;&#x4EE3;&#x7801;&#xFF0C;&#x67E5;&#x627E;&#x4F7F;&#x7528;&#x8BE5;&#x53D8;&#x91CF;&#x7684;&#x4F4D;&#x7F6E;&#x3002;&#x6666;&#x6DA9;&#x5E38;&#x5E38;&#x4E0E;&#x4F9D;&#x8D56;&#x9879;&#x76F8;&#x5173;&#x8054;&#xFF0C;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F9D;&#x8D56;&#x9879;&#x7684;&#x5B58;&#x5728;&#x5E76;&#x4E0D;&#x660E;&#x663E;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x5411;&#x7CFB;&#x7EDF;&#x6DFB;&#x52A0;&#x4E86;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x9519;&#x8BEF;&#x72B6;&#x6001;&#xFF0C;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x5411;&#x4E00;&#x4E2A;&#x5305;&#x542B;&#x6BCF;&#x4E2A;&#x72B6;&#x6001;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x6D88;&#x606F;&#x7684;&#x8868;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x6761;&#x76EE;&#xFF0C;&#x4F46;&#x662F;&#x5BF9;&#x4E8E;&#x67E5;&#x770B;&#x72B6;&#x6001;&#x58F0;&#x660E;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x6765;&#x8BF4;&#xFF0C;&#x6D88;&#x606F;&#x8868;&#x7684;&#x5B58;&#x5728;&#x53EF;&#x80FD;&#x5E76;&#x4E0D;&#x660E;&#x663E;&#x3002;&#x4E0D;&#x4E00;&#x81F4;&#x6027;&#x4E5F;&#x662F;&#x9020;&#x6210;&#x4E0D;&#x900F;&#x660E;&#x6027;&#x7684;&#x4E00;&#x4E2A;&#x4E3B;&#x8981;&#x539F;&#x56E0;:&#x5982;&#x679C;&#x540C;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x540D;&#x7528;&#x4E8E;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x76EE;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5C31;&#x65E0;&#x6CD5;&#x6E05;&#x695A;&#x5730;&#x77E5;&#x9053;&#x67D0;&#x4E2A;&#x7279;&#x5B9A;&#x53D8;&#x91CF;&#x7684;&#x76EE;&#x7684;&#x662F;&#x4EC0;&#x4E48;&#x3002;</p>
<p>&#x5728;&#x8BB8;&#x591A;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x7531;&#x4E8E;&#x6587;&#x6863;&#x4E0D;&#x8DB3;&#x800C;&#x5BFC;&#x81F4;&#x6A21;&#x7CCA;&#x4E0D;&#x6E05;&#x3002;&#x7B2C; 13 &#x7AE0;&#x8BA8;&#x8BBA;&#x4E86;&#x8FD9;&#x4E2A;&#x4E3B;&#x9898;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x6A21;&#x7CCA;&#x6027;&#x4E5F;&#x662F;&#x8BBE;&#x8BA1;&#x95EE;&#x9898;&#x3002;&#x5982;&#x679C;&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;&#x7B80;&#x6D01;&#x660E;&#x4E86;&#xFF0C;&#x5219;&#x6240;&#x9700;&#x7684;&#x6587;&#x6863;&#x5C06;&#x66F4;&#x5C11;&#x3002;&#x5BF9;&#x5927;&#x91CF;&#x6587;&#x6863;&#x7684;&#x9700;&#x6C42;&#x901A;&#x5E38;&#x662F;&#x4E00;&#x4E2A;&#x8B66;&#x544A;&#xFF0C;&#x5373;&#x8BBE;&#x8BA1;&#x4E0D;&#x6B63;&#x786E;&#x3002;&#x51CF;&#x5C11;&#x6A21;&#x7CCA;&#x6027;&#x7684;&#x6700;&#x4F73;&#x65B9;&#x6CD5;&#x662F;&#x7B80;&#x5316;&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;&#x3002;</p>
<p>&#x4F9D;&#x8D56;&#x6027;&#x548C;&#x6A21;&#x7CCA;&#x6027;&#x5171;&#x540C;&#x6784;&#x6210;&#x4E86;&#x7B2C; 2.2 &#x8282;&#x4E2D;&#x63CF;&#x8FF0;&#x7684;&#x4E09;&#x79CD;&#x590D;&#x6742;&#x6027;&#x8868;&#x73B0;&#x3002;&#x4F9D;&#x8D56;&#x6027;&#x5BFC;&#x81F4;&#x53D8;&#x5316;&#x653E;&#x5927;&#x548C;&#x9AD8;&#x8BA4;&#x77E5;&#x8D1F;&#x8377;&#x3002;&#x6666;&#x6DA9;&#x4F1A;&#x4EA7;&#x751F;&#x672A;&#x77E5;&#x7684;&#x672A;&#x77E5;&#x6570;&#xFF0C;&#x8FD8;&#x4F1A;&#x589E;&#x52A0;&#x8BA4;&#x77E5;&#x8D1F;&#x62C5;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x627E;&#x5230;&#x6700;&#x5C0F;&#x5316;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x548C;&#x6A21;&#x7CCA;&#x6027;&#x7684;&#x8BBE;&#x8BA1;&#x6280;&#x672F;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x964D;&#x4F4E;&#x8F6F;&#x4EF6;&#x7684;&#x590D;&#x6742;&#x6027;&#x3002;</p>
<h2 id="24-&#x590D;&#x6742;&#x5EA6;&#x662F;&#x9012;&#x589E;&#x7684;">2.4 &#x590D;&#x6742;&#x5EA6;&#x662F;&#x9012;&#x589E;&#x7684;</h2>
<p>&#x590D;&#x6742;&#x6027;&#x4E0D;&#x662F;&#x7531;&#x5355;&#x4E2A;&#x707E;&#x96BE;&#x6027;&#x9519;&#x8BEF;&#x5F15;&#x8D77;&#x7684;&#xFF1B;&#x5B83;&#x5806;&#x79EF;&#x6210;&#x8BB8;&#x591A;&#x5C0F;&#x5757;&#x3002;&#x5355;&#x4E2A;&#x4F9D;&#x8D56;&#x9879;&#x6216;&#x6A21;&#x7CCA;&#x6027;&#x672C;&#x8EAB;&#x4E0D;&#x592A;&#x53EF;&#x80FD;&#x663E;&#x7740;&#x5F71;&#x54CD;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x53EF;&#x7EF4;&#x62A4;&#x6027;&#x3002;&#x4E4B;&#x6240;&#x4EE5;&#x4F1A;&#x51FA;&#x73B0;&#x590D;&#x6742;&#x6027;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x6D41;&#x901D;&#xFF0C;&#x6210;&#x5343;&#x4E0A;&#x4E07;&#x7684;&#x5C0F;&#x4F9D;&#x8D56;&#x6027;&#x548C;&#x6A21;&#x7CCA;&#x6027;&#x9010;&#x6E10;&#x5F62;&#x6210;&#x3002;&#x6700;&#x7EC8;&#xFF0C;&#x8FD9;&#x4E9B;&#x5C0F;&#x95EE;&#x9898;&#x592A;&#x591A;&#x4E86;&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;&#x5BF9;&#x7CFB;&#x7EDF;&#x7684;&#x6BCF;&#x6B21;&#x53EF;&#x80FD;&#x66F4;&#x6539;&#x90FD;&#x4F1A;&#x53D7;&#x5230;&#x5176;&#x4E2D;&#x51E0;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x5F71;&#x54CD;&#x3002;</p>
<p>&#x590D;&#x6742;&#x6027;&#x7684;&#x589E;&#x91CF;&#x6027;&#x8D28;&#x4F7F;&#x5176;&#x96BE;&#x4EE5;&#x63A7;&#x5236;&#x3002;&#x53EF;&#x4EE5;&#x5F88;&#x5BB9;&#x6613;&#x5730;&#x8BF4;&#x670D;&#x81EA;&#x5DF1;&#xFF0C;&#x5F53;&#x524D;&#x66F4;&#x6539;&#x6240;&#x5E26;&#x6765;&#x7684;&#x4E00;&#x70B9;&#x70B9;&#x590D;&#x6742;&#x6027;&#x6CA1;&#x4EC0;&#x4E48;&#x5927;&#x4E0D;&#x4E86;&#x7684;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x6BCF;&#x4E2A;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5BF9;&#x6BCF;&#x79CD;&#x66F4;&#x6539;&#x90FD;&#x91C7;&#x7528;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#xFF0C;&#x90A3;&#x4E48;&#x590D;&#x6742;&#x6027;&#x5C31;&#x4F1A;&#x8FC5;&#x901F;&#x7D2F;&#x79EF;&#x3002;&#x4E00;&#x65E6;&#x79EF;&#x7D2F;&#x4E86;&#x590D;&#x6742;&#x6027;&#xFF0C;&#x5C31;&#x5F88;&#x96BE;&#x6D88;&#x9664;&#x5B83;&#xFF0C;&#x56E0;&#x4E3A;&#x4FEE;&#x590D;&#x5355;&#x4E2A;&#x4F9D;&#x8D56;&#x9879;&#x6216;&#x6A21;&#x7CCA;&#x6027;&#x672C;&#x8EAB;&#x4E0D;&#x4F1A;&#x4EA7;&#x751F;&#x5F88;&#x5927;&#x7684;&#x53D8;&#x5316;&#x3002;&#x4E3A;&#x4E86;&#x51CF;&#x7F13;&#x590D;&#x6742;&#x6027;&#x7684;&#x589E;&#x957F;&#xFF0C;&#x60A8;&#x5FC5;&#x987B;&#x91C7;&#x7528;&#x7B2C; 3 &#x7AE0;&#x4E2D;&#x8BA8;&#x8BBA;&#x7684;&#x201C;&#x96F6;&#x5BB9;&#x5FCD;&#x201D;&#x7406;&#x5FF5;</p>
<h2 id="25-&#x7ED3;&#x8BBA;">2.5 &#x7ED3;&#x8BBA;</h2>
<p>&#x590D;&#x6742;&#x6027;&#x6765;&#x81EA;&#x4E8E;&#x4F9D;&#x8D56;&#x6027;&#x548C;&#x6A21;&#x7CCA;&#x6027;&#x7684;&#x79EF;&#x7D2F;&#x3002;&#x968F;&#x7740;&#x590D;&#x6742;&#x6027;&#x7684;&#x589E;&#x52A0;&#xFF0C;&#x5B83;&#x4F1A;&#x5BFC;&#x81F4;&#x53D8;&#x5316;&#x653E;&#x5927;&#xFF0C;&#x9AD8;&#x8BA4;&#x77E5;&#x8D1F;&#x8377;&#x548C;&#x672A;&#x77E5;&#x7684;&#x672A;&#x77E5;&#x6570;&#x3002;&#x7ED3;&#x679C;&#xFF0C;&#x9700;&#x8981;&#x66F4;&#x591A;&#x7684;&#x4EE3;&#x7801;&#x4FEE;&#x6539;&#x624D;&#x80FD;&#x5B9E;&#x73B0;&#x6BCF;&#x4E2A;&#x65B0;&#x529F;&#x80FD;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x82B1;&#x8D39;&#x66F4;&#x591A;&#x65F6;&#x95F4;&#x83B7;&#x53D6;&#x8DB3;&#x591F;&#x7684;&#x4FE1;&#x606F;&#x4EE5;&#x5B89;&#x5168;&#x5730;&#x8FDB;&#x884C;&#x66F4;&#x6539;&#xFF0C;&#x5728;&#x6700;&#x574F;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4ED6;&#x4EEC;&#x751A;&#x81F3;&#x627E;&#x4E0D;&#x5230;&#x6240;&#x9700;&#x7684;&#x6240;&#x6709;&#x4FE1;&#x606F;&#x3002;&#x6700;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x590D;&#x6742;&#x6027;&#x4F7F;&#x5F97;&#x4FEE;&#x6539;&#x73B0;&#x6709;&#x4EE3;&#x7801;&#x5E93;&#x53D8;&#x5F97;&#x56F0;&#x96BE;&#x4E14;&#x5192;&#x9669;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="ch1.html" class="navigation navigation-prev " aria-label="Previous page: 第一章：介绍">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="ch3.html" class="navigation navigation-next " aria-label="Next page: 第三章：工作代码是不够的（战略与战术编程）">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第二章：复杂性的本质","level":"1.5","depth":1,"next":{"title":"第三章：工作代码是不够的（战略与战术编程）","level":"1.6","depth":1,"path":"docs/ch3.md","ref":"./docs/ch3.md","articles":[]},"previous":{"title":"第一章：介绍","level":"1.4","depth":1,"path":"docs/ch1.md","ref":"./docs/ch1.md","articles":[]},"dir":"ltr"},"config":{"plugins":["back-to-top-button","expandable-chapters-small","page-toc-button","livereload"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"livereload":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"page-toc-button":{},"back-to-top-button":{},"expandable-chapters-small":{},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"John Ousterhout","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"软件设计哲学","language":"zh-hans","gitbook":"*","description":"书中讨论了软件设计的主题：如何将复杂的软件系统分解成可以相对独立实现的模块(如类和方法)"},"file":{"path":"docs/ch2.md","mtime":"2020-08-06T16:26:19.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-02-06T04:55:41.669Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-page-toc-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

