
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第二十章: 设计性能 · 软件设计哲学</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="John Ousterhout">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-page-toc-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="ch21.html" />
    
    
    <link rel="prev" href="ch19.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    首页
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="preface">
            
                <span>
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="ch1.html">
            
                <a href="ch1.html">
            
                    
                    第一章：介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="ch2.html">
            
                <a href="ch2.html">
            
                    
                    第二章：复杂性的本质
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="ch3.html">
            
                <a href="ch3.html">
            
                    
                    第三章：工作代码是不够的（战略与战术编程）
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="ch4.html">
            
                <a href="ch4.html">
            
                    
                    第四章：模块应该是深的
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="ch5.html">
            
                <a href="ch5.html">
            
                    
                    第五章：信息隐藏(和泄露)
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="ch6.html">
            
                <a href="ch6.html">
            
                    
                    第六章：通用模块更深入
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="ch7.html">
            
                <a href="ch7.html">
            
                    
                    第七章: 不同的层，不同的抽象
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="ch8.html">
            
                <a href="ch8.html">
            
                    
                    第八章: 降低复杂性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="ch9.html">
            
                <a href="ch9.html">
            
                    
                    第九章: 在一起更好还是分开更好？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="ch10.html">
            
                <a href="ch10.html">
            
                    
                    第十章: 定义不存在的错误
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="ch11.html">
            
                <a href="ch11.html">
            
                    
                    第十一章: 设计它两次
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="ch12.html">
            
                <a href="ch12.html">
            
                    
                    第十二章: 为什么写注释？四个理由
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="ch13.html">
            
                <a href="ch13.html">
            
                    
                    第十三章: 注释应该描述代码中不明显的内容
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="ch14.html">
            
                <a href="ch14.html">
            
                    
                    第十四章: 选择的名字
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="ch15.html">
            
                <a href="ch15.html">
            
                    
                    第十五章: 先写注释
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="ch16.html">
            
                <a href="ch16.html">
            
                    
                    第十六章: 修改现有的代码
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.20" data-path="ch17.html">
            
                <a href="ch17.html">
            
                    
                    第十七章: 一致性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.21" data-path="ch18.html">
            
                <a href="ch18.html">
            
                    
                    第十八章: 代码应该是显而易见的
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.22" data-path="ch19.html">
            
                <a href="ch19.html">
            
                    
                    第十九章: 软件发展趋势
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.23" data-path="ch20.html">
            
                <a href="ch20.html">
            
                    
                    第二十章: 设计性能
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.24" data-path="ch21.html">
            
                <a href="ch21.html">
            
                    
                    第二十一章: 结论
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.25" data-path="summary.html">
            
                <a href="summary.html">
            
                    
                    总结
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >第二十章: 设计性能</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7B2C;-20-&#x7AE0;-&#x8BBE;&#x8BA1;&#x6027;&#x80FD;">&#x7B2C; 20 &#x7AE0; &#x8BBE;&#x8BA1;&#x6027;&#x80FD;</h1>
<p>&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#xFF0C;&#x5173;&#x4E8E;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x7684;&#x8BA8;&#x8BBA;&#x90FD;&#x96C6;&#x4E2D;&#x5728;&#x590D;&#x6742;&#x6027;&#x4E0A;&#x3002;&#x76EE;&#x6807;&#x662F;&#x4F7F;&#x8F6F;&#x4EF6;&#x5C3D;&#x53EF;&#x80FD;&#x7B80;&#x5355;&#x6613;&#x61C2;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x60A8;&#x5728;&#x9700;&#x8981;&#x5FEB;&#x901F;&#x7684;&#x7CFB;&#x7EDF;&#x4E0A;&#x5DE5;&#x4F5C;&#xFF0C;&#x8BE5;&#x600E;&#x4E48;&#x529E;&#xFF1F;&#x6027;&#x80FD;&#x65B9;&#x9762;&#x7684;&#x8003;&#x8651;&#x5E94;&#x5982;&#x4F55;&#x5F71;&#x54CD;&#x8BBE;&#x8BA1;&#x8FC7;&#x7A0B;&#xFF1F;&#x672C;&#x7AE0;&#x8BA8;&#x8BBA;&#x5982;&#x4F55;&#x5728;&#x4E0D;&#x727A;&#x7272;&#x7B80;&#x6D01;&#x8BBE;&#x8BA1;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x5B9E;&#x73B0;&#x9AD8;&#x6027;&#x80FD;&#x3002;&#x6700;&#x91CD;&#x8981;&#x7684;&#x60F3;&#x6CD5;&#x4ECD;&#x7136;&#x662F;&#x7B80;&#x5355;&#x6027;&#xFF1A;&#x7B80;&#x5355;&#x6027;&#x4E0D;&#x4EC5;&#x53EF;&#x4EE5;&#x6539;&#x5584;&#x7CFB;&#x7EDF;&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x800C;&#x4E14;&#x901A;&#x5E38;&#x53EF;&#x4EE5;&#x4F7F;&#x7CFB;&#x7EDF;&#x66F4;&#x5FEB;&#x3002;</p>
<h2 id="201-&#x5982;&#x4F55;&#x8003;&#x8651;&#x6027;&#x80FD;">20.1 &#x5982;&#x4F55;&#x8003;&#x8651;&#x6027;&#x80FD;</h2>
<p>&#x8981;&#x89E3;&#x51B3;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x662F;&#x201C;&#x60A8;&#x5728;&#x6B63;&#x5E38;&#x7684;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#x5E94;&#x8BE5;&#x4E3A;&#x6027;&#x80FD;&#x591A;&#x5C11;&#x62C5;&#x5FC3;&#xFF1F;&#x201D; &#x5982;&#x679C;&#x60A8;&#x5C1D;&#x8BD5;&#x4F18;&#x5316;&#x6BCF;&#x6761;&#x8BED;&#x53E5;&#x4EE5;&#x83B7;&#x5F97;&#x6700;&#x5927;&#x901F;&#x5EA6;&#xFF0C;&#x5219;&#x5B83;&#x5C06;&#x51CF;&#x6162;&#x5F00;&#x53D1;&#x901F;&#x5EA6;&#x5E76;&#x4EA7;&#x751F;&#x8BB8;&#x591A;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x590D;&#x6742;&#x6027;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x8BB8;&#x591A;&#x201C;&#x4F18;&#x5316;&#x201D;&#x5B9E;&#x9645;&#x4E0A;&#x5BF9;&#x6027;&#x80FD;&#x6CA1;&#x6709;&#x5E2E;&#x52A9;&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x5982;&#x679C;&#x60A8;&#x5B8C;&#x5168;&#x5FFD;&#x7565;&#x4E86;&#x6027;&#x80FD;&#x95EE;&#x9898;&#xFF0C;&#x5219;&#x5F88;&#x5BB9;&#x6613;&#x5BFC;&#x81F4;&#x904D;&#x53CA;&#x6574;&#x4E2A;&#x4EE3;&#x7801;&#x7684;&#x5927;&#x91CF;&#x6548;&#x7387;&#x4F4E;&#x4E0B;&#x3002;&#x7ED3;&#x679C;&#x7CFB;&#x7EDF;&#x5F88;&#x5BB9;&#x6613;&#x6BD4;&#x6240;&#x9700;&#x7684;&#x901F;&#x5EA6;&#x6162; 5&#x2013;10 &#x500D;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x201C;&#x5343;&#x5200;&#x780D;&#x6B7B;&#x201D;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4EE5;&#x540E;&#x5F88;&#x96BE;&#x518D;&#x56DE;&#x6765;&#x63D0;&#x9AD8;&#x6027;&#x80FD;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x6CA1;&#x6709;&#x5355;&#x4E00;&#x7684;&#x6539;&#x8FDB;&#x4F1A;&#x4EA7;&#x751F;&#x5F88;&#x5927;&#x7684;&#x5F71;&#x54CD;&#x3002;</p>
<p> &#x6700;&#x597D;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x4ECB;&#x4E8E;&#x8FD9;&#x4E24;&#x79CD;&#x6781;&#x7AEF;&#x4E4B;&#x95F4;&#xFF0C;&#x5728;&#x8FD9;&#x79CD;&#x6781;&#x7AEF;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x6027;&#x80FD;&#x7684;&#x57FA;&#x672C;&#x77E5;&#x8BC6;&#x6765;&#x9009;&#x62E9;&#x201C;&#x81EA;&#x7136;&#x9AD8;&#x6548;&#x201D;&#x4F46;&#x53C8;&#x5E72;&#x51C0;&#x53C8;&#x7B80;&#x5355;&#x7684;&#x8BBE;&#x8BA1;&#x66FF;&#x4EE3;&#x65B9;&#x6848;&#x3002;&#x5173;&#x952E;&#x662F;&#x8981;&#x4E86;&#x89E3;&#x54EA;&#x4E9B;&#x64CD;&#x4F5C;&#x6839;&#x672C;&#x662F;&#x6602;&#x8D35;&#x7684;&#x3002;&#x4EE5;&#x4E0B;&#x662F;&#x4E00;&#x4E9B;&#x4ECA;&#x5929;&#x76F8;&#x5BF9;&#x6602;&#x8D35;&#x7684;&#x64CD;&#x4F5C;&#x793A;&#x4F8B;&#xFF1A;</p>
<ul>
<li>&#x7F51;&#x7EDC;&#x901A;&#x4FE1;&#xFF1A;&#x5373;&#x4F7F;&#x5728;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x5185;&#xFF0C;&#x5F80;&#x8FD4;&#x6D88;&#x606F;&#x4EA4;&#x6362;&#x4E5F;&#x53EF;&#x80FD;&#x82B1;&#x8D39; 10&#x2013;50 &#xB5;s&#xFF0C;&#x8FD9;&#x662F;&#x6570;&#x4EE5;&#x4E07;&#x8BA1;&#x7684;&#x6307;&#x4EE4;&#x65F6;&#x95F4;&#x3002;&#x5E7F;&#x57DF;&#x5F80;&#x8FD4;&#x53EF;&#x80FD;&#x9700;&#x8981; 10 &#x5230; 100 &#x6BEB;&#x79D2;&#x3002;</li>
<li>I/O &#x5230;&#x8F85;&#x52A9;&#x5B58;&#x50A8;&#xFF1A;&#x78C1;&#x76D8; I/O &#x64CD;&#x4F5C;&#x901A;&#x5E38;&#x9700;&#x8981; 5 &#x5230; 10 &#x6BEB;&#x79D2;&#xFF0C;&#x8FD9;&#x662F;&#x6570;&#x767E;&#x4E07;&#x6761;&#x6307;&#x4EE4;&#x65F6;&#x95F4;&#x3002;&#x95EA;&#x5B58;&#x5B58;&#x50A8;&#x9700;&#x8981; 10&#x2013;100 &#xB5;s&#x3002;&#x65B0;&#x51FA;&#x73B0;&#x7684;&#x975E;&#x6613;&#x5931;&#x6027;&#x5B58;&#x50A8;&#x5668;&#x7684;&#x901F;&#x5EA6;&#x53EF;&#x80FD;&#x9AD8;&#x8FBE; 1 &#xB5;s&#xFF0C;&#x4F46;&#x8FD9;&#x4ECD;&#x7EA6;&#x4E3A; 2000 &#x6761;&#x6307;&#x4EE4;&#x65F6;&#x95F4;&#x3002;</li>
<li>&#x52A8;&#x6001;&#x5185;&#x5B58;&#x5206;&#x914D;&#xFF08;C &#x8BED;&#x8A00;&#x4E2D;&#x7684; malloc&#xFF0C;C ++&#x6216; Java &#x4E2D;&#x7684;&#x65B0;&#x589E;&#x529F;&#x80FD;&#xFF09;&#x901A;&#x5E38;&#x6D89;&#x53CA;&#x5206;&#x914D;&#xFF0C;&#x91CA;&#x653E;&#x548C;&#x5783;&#x573E;&#x56DE;&#x6536;&#x7684;&#x5927;&#x91CF;&#x5F00;&#x9500;&#x3002;</li>
<li>&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x672A;&#x547D;&#x4E2D;&#xFF1A;&#x5C06;&#x6570;&#x636E;&#x4ECE; DRAM &#x63D0;&#x53D6;&#x5230;&#x7247;&#x4E0A;&#x5904;&#x7406;&#x5668;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x4E2D;&#x9700;&#x8981;&#x6570;&#x767E;&#x6761;&#x6307;&#x4EE4;&#x65F6;&#x95F4;&#xFF1B;&#x5728;&#x8BB8;&#x591A;&#x7A0B;&#x5E8F;&#x4E2D;&#xFF0C;&#x6574;&#x4F53;&#x6027;&#x80FD;&#x53D6;&#x51B3;&#x4E8E;&#x7F13;&#x5B58;&#x672A;&#x547D;&#x4E2D;&#x548C;&#x8BA1;&#x7B97;&#x6210;&#x672C;&#x3002;</li>
</ul>
<p>&#x4E86;&#x89E3;&#x54EA;&#x4E9B;&#x4E1C;&#x897F;&#x6700;&#x6602;&#x8D35;&#x7684;&#x6700;&#x597D;&#x65B9;&#x6CD5;&#x662F;&#x8FD0;&#x884C;&#x5FAE;&#x57FA;&#x51C6;&#x6D4B;&#x8BD5;&#xFF08;&#x5C0F;&#x578B;&#x7A0B;&#x5E8F;&#xFF0C;&#x8FD9;&#x4E9B;&#x7A0B;&#x5E8F;&#x5355;&#x72EC;&#x6D4B;&#x91CF;&#x5355;&#x4E2A;&#x64CD;&#x4F5C;&#x7684;&#x6210;&#x672C;&#xFF09;&#x3002;&#x5728; RAMCloud &#x9879;&#x76EE;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x8BE5;&#x7A0B;&#x5E8F;&#x63D0;&#x4F9B;&#x4E86;&#x5FAE;&#x57FA;&#x51C6;&#x6D4B;&#x8BD5;&#x7684;&#x6846;&#x67B6;&#x3002;&#x521B;&#x5EFA;&#x8BE5;&#x6846;&#x67B6;&#x82B1;&#x4E86;&#x51E0;&#x5929;&#x65F6;&#x95F4;&#xFF0C;&#x4F46;&#x662F;&#x8BE5;&#x6846;&#x67B6;&#x4F7F;&#x5728;&#x4E94;&#x5230;&#x5341;&#x5206;&#x949F;&#x5185;&#x6DFB;&#x52A0;&#x65B0;&#x7684;&#x5FAE;&#x57FA;&#x51C6;&#x6210;&#x4E3A;&#x53EF;&#x80FD;&#x3002;&#x8FD9;&#x4F7F;&#x6211;&#x4EEC;&#x79EF;&#x7D2F;&#x4E86;&#x51E0;&#x5341;&#x4E2A;&#x5FAE;&#x57FA;&#x51C6;&#x3002;&#x6211;&#x4EEC;&#x65E2;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5B83;&#x4EEC;&#x6765;&#x4E86;&#x89E3; RAMCloud &#x4E2D;&#x4F7F;&#x7528;&#x7684;&#x73B0;&#x6709;&#x5E93;&#x7684;&#x6027;&#x80FD;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x8861;&#x91CF;&#x4E3A; RAMCloud &#x7F16;&#x5199;&#x7684;&#x65B0;&#x7C7B;&#x7684;&#x6027;&#x80FD;&#x3002;</p>
<p>&#x4E00;&#x65E6;&#x5BF9;&#x4EC0;&#x4E48;&#x662F;&#x6602;&#x8D35;&#x548C;&#x4EC0;&#x4E48;&#x4FBF;&#x5B9C;&#x6709;&#x4E86;&#x4E00;&#x822C;&#x7684;&#x8BA4;&#x8BC6;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x8BE5;&#x4FE1;&#x606F;&#x5C3D;&#x53EF;&#x80FD;&#x5730;&#x9009;&#x62E9;&#x4FBF;&#x5B9C;&#x7684;&#x4E1A;&#x52A1;&#x3002;&#x5728;&#x8BB8;&#x591A;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x66F4;&#x6709;&#x6548;&#x7684;&#x65B9;&#x6CD5;&#x5C06;&#x4E0E;&#x8F83;&#x6162;&#x7684;&#x65B9;&#x6CD5;&#x4E00;&#x6837;&#x7B80;&#x5355;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5F53;&#x5B58;&#x50A8;&#x5C06;&#x4F7F;&#x7528;&#x952E;&#x503C;&#x67E5;&#x627E;&#x7684;&#x5927;&#x91CF;&#x5BF9;&#x8C61;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x54C8;&#x5E0C;&#x8868;&#x6216;&#x6709;&#x5E8F;&#x6620;&#x5C04;&#x3002;&#x4E24;&#x8005;&#x90FD;&#x901A;&#x5E38;&#x5728;&#x5E93;&#x5305;&#x4E2D;&#x63D0;&#x4F9B;&#xFF0C;&#x5E76;&#x4E14;&#x90FD;&#x7B80;&#x5355;&#x6613;&#x7528;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x54C8;&#x5E0C;&#x8868;&#x53EF;&#x4EE5;&#x8F7B;&#x677E;&#x5730;&#x5FEB; 5-10 &#x500D;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x9664;&#x975E;&#x9700;&#x8981;&#x5730;&#x56FE;&#x63D0;&#x4F9B;&#x7684;&#x6392;&#x5E8F;&#x5C5E;&#x6027;&#xFF0C;&#x5426;&#x5219;&#x5E94;&#x59CB;&#x7EC8;&#x4F7F;&#x7528;&#x54C8;&#x5E0C;&#x8868;&#x3002;</p>
<p>&#x4F5C;&#x4E3A;&#x53E6;&#x4E00;&#x4E2A;&#x793A;&#x4F8B;&#xFF0C;&#x8BF7;&#x8003;&#x8651;&#x4F7F;&#x7528;&#x8BF8;&#x5982; C &#x6216; C ++&#x4E4B;&#x7C7B;&#x7684;&#x8BED;&#x8A00;&#x5206;&#x914D;&#x7ED3;&#x6784;&#x6570;&#x7EC4;&#x3002;&#x6709;&#x4E24;&#x79CD;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x6267;&#x884C;&#x6B64;&#x64CD;&#x4F5C;&#x3002;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x8BA9;&#x6570;&#x7EC4;&#x4FDD;&#x7559;&#x6307;&#x5411;&#x7ED3;&#x6784;&#x7684;&#x6307;&#x9488;&#xFF0C;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x60A8;&#x5FC5;&#x987B;&#x9996;&#x5148;&#x4E3A;&#x6570;&#x7EC4;&#x5206;&#x914D;&#x7A7A;&#x95F4;&#xFF0C;&#x7136;&#x540E;&#x4E3A;&#x6BCF;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x7ED3;&#x6784;&#x5206;&#x914D;&#x7A7A;&#x95F4;&#x3002;&#x5C06;&#x7ED3;&#x6784;&#x5B58;&#x50A8;&#x5728;&#x6570;&#x7EC4;&#x672C;&#x8EAB;&#x4E2D;&#x6548;&#x7387;&#x8981;&#x9AD8;&#x5F97;&#x591A;&#xFF0C;&#x56E0;&#x6B64;&#x60A8;&#x53EA;&#x4E3A;&#x6240;&#x6709;&#x5185;&#x5BB9;&#x5206;&#x914D;&#x4E00;&#x4E2A;&#x5927;&#x5757;&#x3002;</p>
<p>&#x5982;&#x679C;&#x63D0;&#x9AD8;&#x6548;&#x7387;&#x7684;&#x552F;&#x4E00;&#x65B9;&#x6CD5;&#x662F;&#x589E;&#x52A0;&#x590D;&#x6742;&#x6027;&#xFF0C;&#x90A3;&#x4E48;&#x9009;&#x62E9;&#x5C31;&#x66F4;&#x52A0;&#x56F0;&#x96BE;&#x3002;&#x5982;&#x679C;&#x66F4;&#x9AD8;&#x6548;&#x7684;&#x8BBE;&#x8BA1;&#x4EC5;&#x589E;&#x52A0;&#x4E86;&#x5C11;&#x91CF;&#x590D;&#x6742;&#x6027;&#xFF0C;&#x5E76;&#x4E14;&#x590D;&#x6742;&#x6027;&#x662F;&#x9690;&#x85CF;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x5B83;&#x4E0D;&#x5F71;&#x54CD;&#x4EFB;&#x4F55;&#x63A5;&#x53E3;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x53EF;&#x80FD;&#x662F;&#x503C;&#x5F97;&#x7684;&#xFF08;&#x4F46;&#x8981;&#x6CE8;&#x610F;&#xFF1A;&#x590D;&#x6742;&#x6027;&#x662F;&#x9012;&#x589E;&#x7684;&#xFF09;&#x3002;&#x5982;&#x679C;&#x66F4;&#x5FEB;&#x7684;&#x8BBE;&#x8BA1;&#x589E;&#x52A0;&#x4E86;&#x5F88;&#x591A;&#x5B9E;&#x73B0;&#x590D;&#x6742;&#x6027;&#xFF0C;&#x6216;&#x8005;&#x5BFC;&#x81F4;&#x66F4;&#x590D;&#x6742;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x90A3;&#x4E48;&#x6700;&#x597D;&#x662F;&#x4ECE;&#x66F4;&#x7B80;&#x5355;&#x7684;&#x65B9;&#x6CD5;&#x5F00;&#x59CB;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x6027;&#x80FD;&#x51FA;&#x73B0;&#x95EE;&#x9898;&#x65F6;&#x8FDB;&#x884C;&#x4F18;&#x5316;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x60A8;&#x6709;&#x660E;&#x786E;&#x7684;&#x8BC1;&#x636E;&#x8868;&#x660E;&#x6027;&#x80FD;&#x5728;&#x7279;&#x5B9A;&#x60C5;&#x51B5;&#x4E0B;&#x5F88;&#x91CD;&#x8981;&#xFF0C;&#x90A3;&#x4E48;&#x60A8;&#x6700;&#x597D;&#x7ACB;&#x5373;&#x5B9E;&#x65BD;&#x66F4;&#x5FEB;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x5728; RAMCloud &#x9879;&#x76EE;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x603B;&#x4F53;&#x76EE;&#x6807;&#x4E4B;&#x4E00;&#x662F;&#x4E3A;&#x5BA2;&#x6237;&#x7AEF;&#x8BA1;&#x7B97;&#x673A;&#x901A;&#x8FC7;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x7F51;&#x7EDC;&#x8BBF;&#x95EE;&#x5B58;&#x50A8;&#x7CFB;&#x7EDF;&#x63D0;&#x4F9B;&#x5C3D;&#x53EF;&#x80FD;&#x4F4E;&#x7684;&#x5EF6;&#x8FDF;&#x3002;&#x7ED3;&#x679C;&#xFF0C;&#x6211;&#x4EEC;&#x51B3;&#x5B9A;&#x4F7F;&#x7528;&#x7279;&#x6B8A;&#x7684;&#x786C;&#x4EF6;&#x8FDB;&#x884C;&#x8054;&#x7F51;&#xFF0C;&#x4ECE;&#x800C;&#x4F7F; RAMCloud &#x7ED5;&#x8FC7;&#x5185;&#x6838;&#x5E76;&#x76F4;&#x63A5;&#x4E0E;&#x7F51;&#x7EDC;&#x63A5;&#x53E3;&#x63A7;&#x5236;&#x5668;&#x8FDB;&#x884C;&#x901A;&#x4FE1;&#x4EE5;&#x53D1;&#x9001;&#x548C;&#x63A5;&#x6536;&#x6570;&#x636E;&#x5305;&#x3002;&#x5373;&#x4F7F;&#x589E;&#x52A0;&#x4E86;&#x590D;&#x6742;&#x6027;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x662F;&#x505A;&#x51FA;&#x4E86;&#x8FD9;&#x4E2A;&#x51B3;&#x5B9A;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x4ECE;&#x5148;&#x524D;&#x7684;&#x6D4B;&#x91CF;&#x4E2D;&#x77E5;&#x9053;&#xFF0C;&#x57FA;&#x4E8E;&#x5185;&#x6838;&#x7684;&#x7F51;&#x7EDC;&#x592A;&#x6162;&#x4E86;&#xFF0C;&#x65E0;&#x6CD5;&#x6EE1;&#x8DB3;&#x6211;&#x4EEC;&#x7684;&#x9700;&#x6C42;&#x3002;&#x5728;&#x5176;&#x4F59;&#x7684; RAMCloud &#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x80FD;&#x591F;&#x8FDB;&#x884C;&#x7B80;&#x5355;&#x8BBE;&#x8BA1;&#x3002;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x5927;&#x95EE;&#x9898;&#x201C;&#x5BF9;&#x201D;&#x4F7F;&#x5176;&#x4ED6;&#x4E8B;&#x60C5;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x5BB9;&#x6613;&#x3002;</p>
<p>&#x901A;&#x5E38;&#xFF0C;&#x8F83;&#x7B80;&#x5355;&#x7684;&#x4EE3;&#x7801;&#x5F80;&#x5F80;&#x6BD4;&#x590D;&#x6742;&#x7684;&#x4EE3;&#x7801;&#x8FD0;&#x884C;&#x66F4;&#x5FEB;&#x3002;&#x5982;&#x679C;&#x60A8;&#x5B9A;&#x4E49;&#x4E86;&#x7279;&#x6B8A;&#x60C5;&#x51B5;&#x548C;&#x4F8B;&#x5916;&#xFF0C;&#x5219;&#x65E0;&#x9700;&#x4EE3;&#x7801;&#x5373;&#x53EF;&#x68C0;&#x67E5;&#x8FD9;&#x4E9B;&#x60C5;&#x51B5;&#xFF0C;&#x5E76;&#x4E14;&#x7CFB;&#x7EDF;&#x8FD0;&#x884C;&#x901F;&#x5EA6;&#x66F4;&#x5FEB;&#x3002;&#x6DF1;&#x5C42;&#x7C7B;&#x6BD4;&#x6D45;&#x5C42;&#x7C7B;&#x66F4;&#x6709;&#x6548;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x4E3A;&#x6BCF;&#x4E2A;&#x65B9;&#x6CD5;&#x8C03;&#x7528;&#x5B8C;&#x6210;&#x4E86;&#x66F4;&#x591A;&#x5DE5;&#x4F5C;&#x3002;&#x6D45;&#x7C7B;&#x4F1A;&#x5BFC;&#x81F4;&#x66F4;&#x591A;&#x7684;&#x5C42;&#x4EA4;&#x53C9;&#xFF0C;&#x5E76;&#x4E14;&#x6BCF;&#x4E2A;&#x5C42;&#x4EA4;&#x53C9;&#x90FD;&#x4F1A;&#x589E;&#x52A0;&#x5F00;&#x9500;&#x3002;</p>
<h2 id="202-measure-before-modifying-&#x4FEE;&#x6539;&#x524D;&#x7684;&#x5EA6;&#x91CF;">20.2 Measure before modifying &#x4FEE;&#x6539;&#x524D;&#x7684;&#x5EA6;&#x91CF;</h2>
<p>&#x4F46;&#x662F;&#xFF0C;&#x5373;&#x4F7F;&#x60A8;&#x5982;&#x4E0A;&#x6240;&#x8FF0;&#x8FDB;&#x884C;&#x8BBE;&#x8BA1;&#xFF0C;&#x4E5F;&#x8BF7;&#x5047;&#x8BBE;&#x60A8;&#x7684;&#x7CFB;&#x7EDF;&#x4ECD;&#x7136;&#x592A;&#x6162;&#x3002;&#x6839;&#x636E;&#x60A8;&#x5BF9;&#x6162;&#x901F;&#x8FD0;&#x52A8;&#x7684;&#x76F4;&#x89C9;&#xFF0C;&#x6025;&#x4E8E;&#x7740;&#x624B;&#x5F00;&#x59CB;&#x8FDB;&#x884C;&#x6027;&#x80FD;&#x8C03;&#x6574;&#x3002;&#x4E0D;&#x8981;&#x8FD9;&#x6837;&#xFF01;&#x7A0B;&#x5E8F;&#x5458;&#x5BF9;&#x6027;&#x80FD;&#x7684;&#x76F4;&#x89C9;&#x662F;&#x4E0D;&#x53EF;&#x9760;&#x7684;&#x3002;&#x5373;&#x4F7F;&#x5BF9;&#x4E8E;&#x6709;&#x7ECF;&#x9A8C;&#x7684;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x4E5F;&#x662F;&#x5982;&#x6B64;&#x3002;&#x5982;&#x679C;&#x60A8;&#x5F00;&#x59CB;&#x6839;&#x636E;&#x76F4;&#x89C9;&#x8FDB;&#x884C;&#x66F4;&#x6539;&#xFF0C;&#x5219;&#x4F1A;&#x6D6A;&#x8D39;&#x65F6;&#x95F4;&#x5728;&#x5B9E;&#x9645;&#x4E0A;&#x65E0;&#x6CD5;&#x63D0;&#x9AD8;&#x6027;&#x80FD;&#x7684;&#x4E8B;&#x60C5;&#x4E0A;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x80FD;&#x4F1A;&#x4F7F;&#x7CFB;&#x7EDF;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x590D;&#x6742;&#x3002;</p>
<p>&#x8FDB;&#x884C;&#x4EFB;&#x4F55;&#x66F4;&#x6539;&#x4E4B;&#x524D;&#xFF0C;&#x8BF7;&#x6D4B;&#x91CF;&#x7CFB;&#x7EDF;&#x7684;&#x73B0;&#x6709;&#x884C;&#x4E3A;&#x3002;&#x8FD9;&#x6709;&#x4E24;&#x4E2A;&#x76EE;&#x7684;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x8FD9;&#x4E9B;&#x6D4B;&#x91CF;&#x5C06;&#x786E;&#x5B9A;&#x6027;&#x80FD;&#x8C03;&#x6574;&#x5C06;&#x4EA7;&#x751F;&#x6700;&#x5927;&#x5F71;&#x54CD;&#x7684;&#x5730;&#x65B9;&#x3002;&#x4EC5;&#x4EC5;&#x6D4B;&#x91CF;&#x9876;&#x7EA7;&#x7CFB;&#x7EDF;&#x6027;&#x80FD;&#x662F;&#x4E0D;&#x591F;&#x7684;&#x3002;&#x8FD9;&#x53EF;&#x80FD;&#x4F1A;&#x544A;&#x8BC9;&#x60A8;&#x7CFB;&#x7EDF;&#x901F;&#x5EA6;&#x592A;&#x6162;&#xFF0C;&#x4F46;&#x4E0D;&#x4F1A;&#x544A;&#x8BC9;&#x60A8;&#x539F;&#x56E0;&#x3002;&#x60A8;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x66F4;&#x6DF1;&#x5165;&#x7684;&#x8861;&#x91CF;&#xFF0C;&#x4EE5;&#x8BE6;&#x7EC6;&#x786E;&#x5B9A;&#x5F71;&#x54CD;&#x6574;&#x4F53;&#x7EE9;&#x6548;&#x7684;&#x56E0;&#x7D20;&#xFF1B;&#x76EE;&#x6807;&#x662F;&#x786E;&#x5B9A;&#x7CFB;&#x7EDF;&#x5F53;&#x524D;&#x82B1;&#x8D39;&#x5927;&#x91CF;&#x65F6;&#x95F4;&#x7684;&#x5C11;&#x91CF;&#x975E;&#x5E38;&#x5177;&#x4F53;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x4EE5;&#x53CA;&#x60A8;&#x6709;&#x6539;&#x8FDB;&#x60F3;&#x6CD5;&#x7684;&#x5730;&#x65B9;&#x3002;&#x6D4B;&#x91CF;&#x7684;&#x7B2C;&#x4E8C;&#x4E2A;&#x76EE;&#x7684;&#x662F;&#x63D0;&#x4F9B;&#x57FA;&#x7EBF;&#xFF0C;&#x4EE5;&#x4FBF;&#x60A8;&#x53EF;&#x4EE5;&#x5728;&#x8FDB;&#x884C;&#x66F4;&#x6539;&#x540E;&#x91CD;&#x65B0;&#x6D4B;&#x91CF;&#x6027;&#x80FD;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;&#x6027;&#x80FD;&#x5F97;&#x5230;&#x5B9E;&#x9645;&#x6539;&#x5584;&#x3002;&#x5982;&#x679C;&#x8FD9;&#x4E9B;&#x66F4;&#x6539;&#x5E76;&#x672A;&#x5728;&#x6548;&#x679C;&#x4E0A;&#x5E26;&#x6765;&#x53EF;&#x8861;&#x91CF;&#x7684;&#x53D8;&#x5316;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x5176;&#x9000;&#x51FA;&#xFF08;&#x9664;&#x975E;&#x5B83;&#x4EEC;&#x4F7F;&#x7CFB;&#x7EDF;&#x66F4;&#x7B80;&#x5355;&#xFF09;&#x3002;&#x9664;&#x975E;&#x80FD;&#x591F;&#x663E;&#x7740;&#x63D0;&#x9AD8;&#x901F;&#x5EA6;&#xFF0C;&#x5426;&#x5219;&#x4FDD;&#x6301;&#x590D;&#x6742;&#x6027;&#x6BEB;&#x65E0;&#x610F;&#x4E49;&#x3002;</p>
<h2 id="203-design-around-the-critical-path-&#x56F4;&#x7ED5;&#x5173;&#x952E;&#x8DEF;&#x5F84;&#x8FDB;&#x884C;&#x8BBE;&#x8BA1;">20.3 Design around the critical path &#x56F4;&#x7ED5;&#x5173;&#x952E;&#x8DEF;&#x5F84;&#x8FDB;&#x884C;&#x8BBE;&#x8BA1;</h2>
<p>&#x5728;&#x8FD9;&#x4E00;&#x70B9;&#x4E0A;&#xFF0C;&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x60A8;&#x5DF2;&#x7ECF;&#x4ED4;&#x7EC6;&#x5206;&#x6790;&#x4E86;&#x6027;&#x80FD;&#xFF0C;&#x5E76;&#x786E;&#x5B9A;&#x4E86;&#x4E00;&#x6BB5;&#x7F13;&#x6162;&#x7684;&#x4EE3;&#x7801;&#x6765;&#x5F71;&#x54CD;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x7684;&#x6027;&#x80FD;&#x3002;&#x6539;&#x5584;&#x5176;&#x6027;&#x80FD;&#x7684;&#x6700;&#x4F73;&#x65B9;&#x6CD5;&#x662F;&#x8FDB;&#x884C;&#x201C;&#x6839;&#x672C;&#x201D;&#x66F4;&#x6539;&#xFF0C;&#x4F8B;&#x5982;&#x5F15;&#x5165;&#x7F13;&#x5B58;&#xFF0C;&#x6216;&#x4F7F;&#x7528;&#x5176;&#x4ED6;&#x7B97;&#x6CD5;&#x65B9;&#x6CD5;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x5E73;&#x8861;&#x6811;&#x4E0E;&#x5217;&#x8868;&#xFF09;&#x3002;&#x6211;&#x4EEC;&#x51B3;&#x5B9A;&#x7ED5;&#x8FC7;&#x5185;&#x6838;&#x8FDB;&#x884C; RAMCloud &#x4E2D;&#x7684;&#x7F51;&#x7EDC;&#x901A;&#x4FE1;&#x7684;&#x51B3;&#x5B9A;&#x662F;&#x4E00;&#x4E2A;&#x57FA;&#x672C;&#x4FEE;&#x8865;&#x7A0B;&#x5E8F;&#x7684;&#x793A;&#x4F8B;&#x3002;&#x5982;&#x679C;&#x60A8;&#x53EF;&#x4EE5;&#x786E;&#x5B9A;&#x57FA;&#x672C;&#x4FEE;&#x590D;&#x7A0B;&#x5E8F;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x524D;&#x9762;&#x5404;&#x7AE0;&#x4E2D;&#x8BA8;&#x8BBA;&#x7684;&#x8BBE;&#x8BA1;&#x6280;&#x672F;&#x6765;&#x5B9E;&#x65BD;&#x5B83;&#x3002;</p>
<p>&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x6709;&#x65F6;&#x4F1A;&#x51FA;&#x73B0;&#x4E00;&#x4E9B;&#x6839;&#x672C;&#x65E0;&#x6CD5;&#x89E3;&#x51B3;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x8FD9;&#x5C06;&#x6211;&#x4EEC;&#x5E26;&#x5230;&#x672C;&#x7AE0;&#x7684;&#x6838;&#x5FC3;&#x95EE;&#x9898;&#xFF0C;&#x5373;&#x5982;&#x4F55;&#x91CD;&#x65B0;&#x8BBE;&#x8BA1;&#x73B0;&#x6709;&#x4EE3;&#x7801;&#xFF0C;&#x4F7F;&#x5176;&#x8FD0;&#x884C;&#x66F4;&#x5FEB;&#x3002;&#x8FD9;&#x5E94;&#x8BE5;&#x662F;&#x60A8;&#x7684;&#x4E0D;&#x5F97;&#x5DF2;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5E76;&#x4E14;&#x4E0D;&#x5E94;&#x8BE5;&#x7ECF;&#x5E38;&#x53D1;&#x751F;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#x5B83;&#x53EF;&#x80FD;&#x4F1A;&#x5E26;&#x6765;&#x5F88;&#x5927;&#x7684;&#x4E0D;&#x540C;&#x3002;&#x5173;&#x952E;&#x601D;&#x60F3;&#x662F;&#x56F4;&#x7ED5;&#x5173;&#x952E;&#x8DEF;&#x5F84;&#x8BBE;&#x8BA1;&#x4EE3;&#x7801;&#x3002;</p>
<p>&#x9996;&#x5148;&#xFF0C;&#x95EE;&#x81EA;&#x5DF1;&#x5728;&#x901A;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#x6267;&#x884C;&#x6240;&#x9700;&#x4EFB;&#x52A1;&#x5FC5;&#x987B;&#x6267;&#x884C;&#x7684;&#x6700;&#x5C11;&#x4EE3;&#x7801;&#x91CF;&#x662F;&#x591A;&#x5C11;&#x3002;&#x5FFD;&#x7565;&#x4EFB;&#x4F55;&#x73B0;&#x6709;&#x7684;&#x4EE3;&#x7801;&#x7ED3;&#x6784;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x60F3;&#x8C61;&#x4E00;&#x4E0B;&#x60A8;&#x6B63;&#x5728;&#x7F16;&#x5199;&#x4E00;&#x4E2A;&#x4EC5;&#x5B9E;&#x73B0;&#x5173;&#x952E;&#x8DEF;&#x5F84;&#x7684;&#x65B0;&#x65B9;&#x6CD5;&#xFF0C;&#x8FD9;&#x662F;&#x5728;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x5FC5;&#x987B;&#x6267;&#x884C;&#x7684;&#x6700;&#x5C11;&#x4EE3;&#x7801;&#x91CF;&#x3002;&#x5F53;&#x524D;&#x7684;&#x4EE3;&#x7801;&#x53EF;&#x80FD;&#x5145;&#x6EE1;&#x7279;&#x6B8A;&#x60C5;&#x51B5;&#x3002;&#x5728;&#x6B64;&#x7EC3;&#x4E60;&#x4E2D;&#xFF0C;&#x8BF7;&#x5FFD;&#x7565;&#x5B83;&#x4EEC;&#x3002;&#x5F53;&#x524D;&#x7684;&#x4EE3;&#x7801;&#x53EF;&#x80FD;&#x4F1A;&#x5728;&#x5173;&#x952E;&#x8DEF;&#x5F84;&#x4E0A;&#x901A;&#x8FC7;&#x591A;&#x4E2A;&#x65B9;&#x6CD5;&#x8C03;&#x7528;&#x3002;&#x60F3;&#x8C61;&#x4E00;&#x4E0B;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x5C06;&#x6240;&#x6709;&#x76F8;&#x5173;&#x4EE3;&#x7801;&#x653E;&#x5728;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x4E2D;&#x3002;&#x5F53;&#x524D;&#x4EE3;&#x7801;&#x8FD8;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5404;&#x79CD;&#x53D8;&#x91CF;&#x548C;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;&#x4EC5;&#x8003;&#x8651;&#x5173;&#x952E;&#x8DEF;&#x5F84;&#x6240;&#x9700;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5E76;&#x5047;&#x5B9A;&#x6700;&#x9002;&#x5408;&#x5173;&#x952E;&#x8DEF;&#x5F84;&#x7684;&#x4EFB;&#x4F55;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5C06;&#x591A;&#x4E2A;&#x53D8;&#x91CF;&#x5408;&#x5E76;&#x4E3A;&#x4E00;&#x4E2A;&#x503C;&#x53EF;&#x80FD;&#x5F88;&#x6709;&#x610F;&#x4E49;&#x3002;&#x5047;&#x8BBE;&#x60A8;&#x53EF;&#x4EE5;&#x5B8C;&#x5168;&#x91CD;&#x65B0;&#x8BBE;&#x8BA1;&#x7CFB;&#x7EDF;&#xFF0C;&#x4EE5;&#x6700;&#x5927;&#x7A0B;&#x5EA6;&#x5730;&#x51CF;&#x5C11;&#x5FC5;&#x987B;&#x4E3A;&#x5173;&#x952E;&#x8DEF;&#x5F84;&#x6267;&#x884C;&#x7684;&#x4EE3;&#x7801;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x6B64;&#x4EE3;&#x7801;&#x79F0;&#x4E3A;&#x201C;&#x7406;&#x60F3;&#x201D;&#x3002;</p>
<p>&#x7406;&#x60F3;&#x7684;&#x4EE3;&#x7801;&#x53EF;&#x80FD;&#x4F1A;&#x4E0E;&#x60A8;&#x73B0;&#x6709;&#x7684;&#x7C7B;&#x7ED3;&#x6784;&#x51B2;&#x7A81;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x80FD;&#x4E0D;&#x5207;&#x5B9E;&#x9645;&#xFF0C;&#x4F46;&#x5B83;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x76EE;&#x6807;&#xFF1A;&#x8FD9;&#x4EE3;&#x8868;&#x4E86;&#x4EE3;&#x7801;&#x53EF;&#x80FD;&#x662F;&#x6700;&#x7B80;&#x5355;&#xFF0C;&#x6700;&#x5FEB;&#x7684;&#x3002;&#x4E0B;&#x4E00;&#x6B65;&#x662F;&#x5BFB;&#x627E;&#x4E00;&#x79CD;&#x65B0;&#x8BBE;&#x8BA1;&#xFF0C;&#x4F7F;&#x5176;&#x5C3D;&#x53EF;&#x80FD;&#x63A5;&#x8FD1;&#x7406;&#x60F3;&#x72B6;&#x6001;&#xFF0C;&#x540C;&#x65F6;&#x53C8;&#x8981;&#x4FDD;&#x6301;&#x5E72;&#x51C0;&#x7684;&#x7ED3;&#x6784;&#x3002;&#x60A8;&#x53EF;&#x4EE5;&#x5E94;&#x7528;&#x672C;&#x4E66;&#x524D;&#x9762;&#x5404;&#x7AE0;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x8BBE;&#x8BA1;&#x601D;&#x60F3;&#xFF0C;&#x4F46;&#x8981;&#x4FDD;&#x6301;&#xFF08;&#x6700;&#x597D;&#xFF09;&#x4FDD;&#x6301;&#x7406;&#x60F3;&#x4EE3;&#x7801;&#x7684;&#x9644;&#x52A0;&#x7EA6;&#x675F;&#x3002;&#x60A8;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x5728;&#x7406;&#x60F3;&#x60C5;&#x51B5;&#x4E0B;&#x6DFB;&#x52A0;&#x4E00;&#x4E9B;&#x989D;&#x5916;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x4EE5;&#x5141;&#x8BB8;&#x4F7F;&#x7528;&#x7B80;&#x6D01;&#x7684;&#x62BD;&#x8C61;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x4EE3;&#x7801;&#x6D89;&#x53CA;&#x54C8;&#x5E0C;&#x8868;&#x67E5;&#x627E;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x5411;&#x901A;&#x7528;&#x54C8;&#x5E0C;&#x8868;&#x7C7B;&#x5F15;&#x5165;&#x989D;&#x5916;&#x7684;&#x65B9;&#x6CD5;&#x8C03;&#x7528;&#x3002;&#x4EE5;&#x6211;&#x7684;&#x7ECF;&#x9A8C;&#xFF0C;&#x51E0;&#x4E4E;&#x603B;&#x662F;&#x53EF;&#x4EE5;&#x627E;&#x5230;&#x5E72;&#x51C0;&#x7B80;&#x6D01;&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x4F46;&#x975E;&#x5E38;&#x63A5;&#x8FD1;&#x7406;&#x60F3;&#x3002;</p>
<p>&#x5728;&#x6B64;&#x8FC7;&#x7A0B;&#x4E2D;&#x53D1;&#x751F;&#x7684;&#x6700;&#x91CD;&#x8981;&#x7684;&#x4E8B;&#x60C5;&#x4E4B;&#x4E00;&#x662F;&#x4ECE;&#x5173;&#x952E;&#x8DEF;&#x5F84;&#x4E2D;&#x9664;&#x53BB;&#x7279;&#x6B8A;&#x60C5;&#x51B5;&#x3002;&#x5F53;&#x4EE3;&#x7801;&#x8FD0;&#x884C;&#x7F13;&#x6162;&#x65F6;&#xFF0C;&#x901A;&#x5E38;&#x662F;&#x56E0;&#x4E3A;&#x5B83;&#x5FC5;&#x987B;&#x5904;&#x7406;&#x5404;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x5E76;&#x4E14;&#x4EE3;&#x7801;&#x7ECF;&#x8FC7;&#x7ED3;&#x6784;&#x5316;&#x4EE5;&#x7B80;&#x5316;&#x6240;&#x6709;&#x4E0D;&#x540C;&#x60C5;&#x51B5;&#x7684;&#x5904;&#x7406;&#x3002;&#x6BCF;&#x4E2A;&#x7279;&#x6B8A;&#x60C5;&#x51B5;&#x90FD;&#x4EE5;&#x989D;&#x5916;&#x7684;&#x6761;&#x4EF6;&#x8BED;&#x53E5;&#x548C;/&#x6216;&#x65B9;&#x6CD5;&#x8C03;&#x7528;&#x7684;&#x5F62;&#x5F0F;&#x5411;&#x5173;&#x952E;&#x8DEF;&#x5F84;&#x6DFB;&#x52A0;&#x4E86;&#x4E00;&#x4E9B;&#x4EE3;&#x7801;&#x3002;&#x8FD9;&#x4E9B;&#x6DFB;&#x52A0;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x90FD;&#x4F1A;&#x4F7F;&#x4EE3;&#x7801;&#x53D8;&#x6162;&#x3002;&#x91CD;&#x65B0;&#x8BBE;&#x8BA1;&#x6027;&#x80FD;&#x65F6;&#xFF0C;&#x8BF7;&#x5C1D;&#x8BD5;&#x51CF;&#x5C11;&#x5FC5;&#x987B;&#x68C0;&#x67E5;&#x7684;&#x7279;&#x6B8A;&#x60C5;&#x51B5;&#x7684;&#x6570;&#x91CF;&#x3002;&#x7406;&#x60F3;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5F00;&#x5934;&#x5E94;&#x8BE5;&#x6709;&#x4E00;&#x4E2A; if &#x8BED;&#x53E5;&#xFF0C;&#x8BE5;&#x8BED;&#x53E5;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x6D4B;&#x8BD5;&#x68C0;&#x6D4B;&#x6240;&#x6709;&#x7279;&#x6B8A;&#x60C5;&#x51B5;&#x3002;&#x5728;&#x6B63;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x4E00;&#x9879;&#x6D4B;&#x8BD5;&#xFF0C;&#x4E4B;&#x540E;&#x5C31;&#x53EF;&#x4EE5;&#x6267;&#x884C;&#x5173;&#x952E;&#x8DEF;&#x5F84;&#xFF0C;&#x800C;&#x5BF9;&#x4E8E;&#x7279;&#x6B8A;&#x60C5;&#x51B5;&#x5219;&#x65E0;&#x9700;&#x8FDB;&#x884C;&#x5176;&#x4ED6;&#x6D4B;&#x8BD5;&#x3002;&#x5982;&#x679C;&#x521D;&#x59CB;&#x6D4B;&#x8BD5;&#x5931;&#x8D25;&#xFF08;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x53D1;&#x751F;&#x4E86;&#x7279;&#x6B8A;&#x60C5;&#x51B5;&#xFF09;&#xFF0C;&#x5219;&#x4EE3;&#x7801;&#x53EF;&#x4EE5;&#x5206;&#x652F;&#x5230;&#x5173;&#x952E;&#x8DEF;&#x5F84;&#x4E4B;&#x5916;&#x7684;&#x5355;&#x72EC;&#x4F4D;&#x7F6E;&#x4EE5;&#x8FDB;&#x884C;&#x5904;&#x7406;&#x3002;&#x5BF9;&#x4E8E;&#x7279;&#x6B8A;&#x60C5;&#x51B5;&#xFF0C;&#x6027;&#x80FD;&#x5E76;&#x4E0D;&#x662F;&#x90A3;&#x4E48;&#x91CD;&#x8981;&#xFF0C;&#x56E0;&#x6B64;&#x60A8;&#x53EF;&#x4EE5;&#x4E3A;&#x7B80;&#x5316;&#x800C;&#x4E0D;&#x662F;&#x6027;&#x80FD;&#x6765;&#x6784;&#x9020;&#x7279;&#x6B8A;&#x60C5;&#x51B5;&#x7684;&#x4EE3;&#x7801;&#x3002;</p>
<h2 id="204-an-example-ramcloud-buffers-&#x793A;&#x4F8B;&#xFF1A;ramcloud-&#x7F13;&#x51B2;&#x533A;">20.4 An example: RAMCloud Buffers &#x793A;&#x4F8B;&#xFF1A;RAMCloud &#x7F13;&#x51B2;&#x533A;</h2>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x8003;&#x8651;&#x4E00;&#x4E2A;&#x793A;&#x4F8B;&#xFF0C;&#x5176;&#x4E2D; RAMCloud &#x5B58;&#x50A8;&#x7CFB;&#x7EDF;&#x7684; Buffer &#x7C7B;&#x7ECF;&#x8FC7;&#x4F18;&#x5316;&#xFF0C;&#x4EE5;&#x4F7F;&#x5927;&#x591A;&#x6570;&#x5E38;&#x89C1;&#x64CD;&#x4F5C;&#x7684;&#x901F;&#x5EA6;&#x63D0;&#x9AD8;&#x7EA6; 2 &#x500D;&#x3002;</p>
<p>RAMCloud &#x4F7F;&#x7528; Buffer &#x5BF9;&#x8C61;&#x7BA1;&#x7406;&#x53EF;&#x53D8;&#x957F;&#x5EA6;&#x7684;&#x5185;&#x5B58;&#x6570;&#x7EC4;&#xFF0C;&#x4F8B;&#x5982;&#x8FDC;&#x7A0B;&#x8FC7;&#x7A0B;&#x8C03;&#x7528;&#x7684;&#x8BF7;&#x6C42;&#x548C;&#x54CD;&#x5E94;&#x6D88;&#x606F;&#x3002;&#x7F13;&#x51B2;&#x533A;&#x65E8;&#x5728;&#x51CF;&#x5C11;&#x5185;&#x5B58;&#x590D;&#x5236;&#x548C;&#x52A8;&#x6001;&#x5B58;&#x50A8;&#x5206;&#x914D;&#x7684;&#x5F00;&#x9500;&#x3002;&#x7F13;&#x51B2;&#x533A;&#x5B58;&#x50A8;&#x770B;&#x4F3C;&#x7EBF;&#x6027;&#x7684;&#x5B57;&#x8282;&#x6570;&#x7EC4;&#xFF0C;&#x4F46;&#x662F;&#x4E3A;&#x4E86;&#x63D0;&#x9AD8;&#x6548;&#x7387;&#xFF0C;&#x5B83;&#x5141;&#x8BB8;&#x5C06;&#x5E95;&#x5C42;&#x5B58;&#x50A8;&#x5212;&#x5206;&#x4E3A;&#x591A;&#x4E2A;&#x4E0D;&#x8FDE;&#x7EED;&#x7684;&#x5185;&#x5B58;&#x5757;&#xFF0C;&#x5982;&#x56FE; 20.1 &#x6240;&#x793A;&#x3002;&#x901A;&#x8FC7;&#x9644;&#x52A0;&#x6570;&#x636E;&#x5757;&#x6765;&#x521B;&#x5EFA;&#x7F13;&#x51B2;&#x533A;&#x3002;&#x6BCF;&#x4E2A;&#x5757;&#x90FD;&#x662F;&#x5916;&#x90E8;&#x7684;&#x6216;&#x5185;&#x90E8;&#x7684;&#x3002;&#x5982;&#x679C;&#x5757;&#x5728;&#x5916;&#x90E8;&#xFF0C;&#x5219;&#x5176;&#x5B58;&#x50A8;&#x7531;&#x8C03;&#x7528;&#x65B9;&#x62E5;&#x6709;&#xFF1B;&#x7F13;&#x51B2;&#x533A;&#x4FDD;&#x7559;&#x5BF9;&#x6B64;&#x5B58;&#x50A8;&#x7684;&#x5F15;&#x7528;&#x3002;&#x5916;&#x90E8;&#x5757;&#x901A;&#x5E38;&#x7528;&#x4E8E;&#x5927;&#x578B;&#x5757;&#xFF0C;&#x4EE5;&#x907F;&#x514D;&#x5185;&#x5B58;&#x590D;&#x5236;&#x3002;&#x5982;&#x679C;&#x5185;&#x90E8;&#x6709;&#x5757;&#xFF0C;&#x5219; Buffer &#x62E5;&#x6709;&#x8BE5;&#x5757;&#x7684;&#x5B58;&#x50A8;&#xFF1B;&#x8C03;&#x7528;&#x8005;&#x63D0;&#x4F9B;&#x7684;&#x6570;&#x636E;&#x5C06;&#x88AB;&#x590D;&#x5236;&#x5230;&#x7F13;&#x51B2;&#x533A;&#x7684;&#x5185;&#x90E8;&#x5B58;&#x50A8;&#x5668;&#x4E2D;&#x3002;&#x6BCF;&#x4E2A;&#x7F13;&#x51B2;&#x533A;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x5C0F;&#x7684;&#x5185;&#x7F6E;&#x5206;&#x914D;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5185;&#x5B58;&#x5757;&#xFF0C;&#x53EF;&#x7528;&#x4E8E;&#x5B58;&#x50A8;&#x5185;&#x90E8;&#x5757;&#x3002;&#x5982;&#x679C;&#x6B64;&#x7A7A;&#x95F4;&#x5DF2;&#x7528;&#x5B8C;&#xFF0C;&#x5219;&#x7F13;&#x51B2;&#x533A;&#x5C06;&#x521B;&#x5EFA;&#x5176;&#x4ED6;&#x5206;&#x914D;&#xFF0C;&#x9500;&#x6BC1;&#x7F13;&#x51B2;&#x533A;&#x65F6;&#x5FC5;&#x987B;&#x91CA;&#x653E;&#x8FD9;&#x4E9B;&#x5206;&#x914D;&#x3002;&#x5185;&#x90E8;&#x5757;&#x5BF9;&#x4E8E;&#x5185;&#x5B58;&#x590D;&#x5236;&#x6210;&#x672C;&#x53EF;&#x5FFD;&#x7565;&#x4E0D;&#x8BA1;&#x7684;&#x5C0F;&#x5757;&#x5F88;&#x65B9;&#x4FBF;&#x3002;&#x56FE; 20.1 &#x663E;&#x793A;&#x4E86;&#x5177;&#x6709; 5 &#x4E2A;&#x5757;&#x7684; Buffer&#xFF1A;&#x7B2C;&#x4E00;&#x4E2A;&#x5757;&#x662F;&#x5185;&#x90E8;&#x7684;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x4E24;&#x4E2A;&#x5757;&#x662F;&#x5916;&#x90E8;&#x7684;&#xFF0C;&#x6700;&#x540E;&#x4E24;&#x4E2A;&#x5757;&#x662F;&#x5185;&#x90E8;&#x7684;&#x3002;</p>
<p><img src="figures/00022.jpeg" alt=""></p>
<p> &#x56FE; 20.1&#xFF1A;Buffer &#x5BF9;&#x8C61;&#x4F7F;&#x7528;&#x5185;&#x5B58;&#x5757;&#x7684;&#x96C6;&#x5408;&#x6765;&#x5B58;&#x50A8;&#x770B;&#x4F3C;&#x7EBF;&#x6027;&#x5B57;&#x8282;&#x6570;&#x7EC4;&#x3002;&#x5185;&#x90E8;&#x5757;&#x7531; Buffer &#x62E5;&#x6709;&#xFF0C;&#x5E76;&#x5728; Buffer &#x9500;&#x6BC1;&#x65F6;&#x91CA;&#x653E;&#xFF1B;&#x5916;&#x90E8;&#x5757;&#x4E0D;&#x5C5E;&#x4E8E;&#x7F13;&#x51B2;&#x533A;&#x3002;</p>
<p>Buffer &#x7C7B;&#x672C;&#x8EAB;&#x4EE3;&#x8868;&#x201C;&#x6839;&#x672C;&#x6027;&#x7684;&#x4FEE;&#x8865;&#x7A0B;&#x5E8F;&#x201D;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x6D88;&#x9664;&#x4E86;&#x6CA1;&#x6709;&#x5B83;&#x5C31;&#x9700;&#x8981;&#x7684;&#x6602;&#x8D35;&#x7684;&#x5185;&#x5B58;&#x526F;&#x672C;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5728; RAMCloud &#x5B58;&#x50A8;&#x7CFB;&#x7EDF;&#x4E2D;&#x7EC4;&#x88C5;&#x5305;&#x542B;&#x77ED;&#x6807;&#x5934;&#x548C;&#x5927;&#x5BF9;&#x8C61;&#x5185;&#x5BB9;&#x7684;&#x54CD;&#x5E94;&#x6D88;&#x606F;&#x65F6;&#xFF0C;RAMCloud &#x4F7F;&#x7528;&#x5E26;&#x6709;&#x4E24;&#x4E2A;&#x5757;&#x7684; Buffer&#x3002;&#x7B2C;&#x4E00;&#x4E2A;&#x5757;&#x662F;&#x5305;&#x542B;&#x5934;&#x7684;&#x5185;&#x90E8;&#x5757;&#xFF1B;&#x7B2C;&#x4E8C;&#x4E2A;&#x5757;&#x662F;&#x4E00;&#x4E2A;&#x5916;&#x90E8;&#x5757;&#xFF0C;&#x5B83;&#x5F15;&#x7528; RAMCloud &#x5B58;&#x50A8;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x5BF9;&#x8C61;&#x5185;&#x5BB9;&#x3002;&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x590D;&#x5236;&#x5927;&#x5BF9;&#x8C61;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x5C06;&#x54CD;&#x5E94;&#x6536;&#x96C6;&#x5230;&#x7F13;&#x51B2;&#x533A;&#x4E2D;&#x3002;</p>
<p>&#x9664;&#x4E86;&#x5141;&#x8BB8;&#x4E0D;&#x8FDE;&#x7EED;&#x5757;&#x7684;&#x57FA;&#x672C;&#x65B9;&#x6CD5;&#x5916;&#xFF0C;&#x6211;&#x4EEC;&#x6CA1;&#x6709;&#x5C1D;&#x8BD5;&#x5728;&#x539F;&#x59CB;&#x5B9E;&#x73B0;&#x4E2D;&#x4F18;&#x5316; Buffer &#x7C7B;&#x7684;&#x4EE3;&#x7801;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x6D41;&#x901D;&#xFF0C;&#x6211;&#x4EEC;&#x6CE8;&#x610F;&#x5230;&#x7F13;&#x51B2;&#x533A;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x5730;&#x88AB;&#x4F7F;&#x7528;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5728;&#x6BCF;&#x4E2A;&#x8FDC;&#x7A0B;&#x8FC7;&#x7A0B;&#x8C03;&#x7528;&#x7684;&#x6267;&#x884C;&#x671F;&#x95F4;&#xFF0C;&#x81F3;&#x5C11;&#x521B;&#x5EFA;&#x56DB;&#x4E2A;&#x7F13;&#x51B2;&#x533A;&#x3002;&#x6700;&#x7EC8;&#xFF0C;&#x5F88;&#x660E;&#x663E;&#xFF0C;&#x52A0;&#x901F; Buffer &#x7684;&#x5B9E;&#x73B0;&#x53EF;&#x80FD;&#x4F1A;&#x5BF9;&#x6574;&#x4F53;&#x7CFB;&#x7EDF;&#x6027;&#x80FD;&#x4EA7;&#x751F;&#x663E;&#x7740;&#x5F71;&#x54CD;&#x3002;&#x6211;&#x4EEC;&#x51B3;&#x5B9A;&#x770B;&#x770B;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x63D0;&#x9AD8; Buffer &#x7C7B;&#x7684;&#x6027;&#x80FD;&#x3002;</p>
<p>Buffer &#x6700;&#x5E38;&#x89C1;&#x7684;&#x64CD;&#x4F5C;&#x662F;&#x4F7F;&#x7528;&#x5185;&#x90E8;&#x5757;&#x4E3A;&#x5C11;&#x91CF;&#x65B0;&#x6570;&#x636E;&#x5206;&#x914D;&#x7A7A;&#x95F4;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5728;&#x4E3A;&#x8BF7;&#x6C42;&#x548C;&#x54CD;&#x5E94;&#x6D88;&#x606F;&#x521B;&#x5EFA;&#x6807;&#x9898;&#x65F6;&#xFF0C;&#x5C31;&#x4F1A;&#x53D1;&#x751F;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x3002;&#x6211;&#x4EEC;&#x51B3;&#x5B9A;&#x5C06;&#x6B64;&#x64CD;&#x4F5C;&#x7528;&#x4F5C;&#x4F18;&#x5316;&#x7684;&#x5173;&#x952E;&#x8DEF;&#x5F84;&#x3002;&#x5728;&#x6700;&#x7B80;&#x5355;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x6269;&#x5927; Buffer &#x4E2D;&#x6700;&#x540E;&#x5B58;&#x5728;&#x7684;&#x5757;&#x6765;&#x5206;&#x914D;&#x7A7A;&#x95F4;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x53EA;&#x6709;&#x5728;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x73B0;&#x6709;&#x5757;&#x4F4D;&#x4E8E;&#x5185;&#x90E8;&#xFF0C;&#x5E76;&#x4E14;&#x5176;&#x5206;&#x914D;&#x4E2D;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x7A7A;&#x95F4;&#x6765;&#x5BB9;&#x7EB3;&#x65B0;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x624D;&#x6709;&#x53EF;&#x80FD;&#x8FD9;&#x6837;&#x505A;&#x3002;&#x7406;&#x60F3;&#x7684;&#x4EE3;&#x7801;&#x5C06;&#x6267;&#x884C;&#x4E00;&#x6B21;&#x68C0;&#x67E5;&#x4EE5;&#x786E;&#x8BA4;&#x7B80;&#x5355;&#x65B9;&#x6CD5;&#x662F;&#x5426;&#x53EF;&#x884C;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x8C03;&#x6574;&#x73B0;&#x6709;&#x5757;&#x7684;&#x5927;&#x5C0F;&#x3002;</p>
<p>&#x56FE; 20.2 &#x663E;&#x793A;&#x4E86;&#x5173;&#x952E;&#x8DEF;&#x5F84;&#x7684;&#x539F;&#x59CB;&#x4EE3;&#x7801;&#xFF0C;&#x8BE5;&#x4EE3;&#x7801;&#x4EE5; Buffer :: alloc &#x65B9;&#x6CD5;&#x5F00;&#x5934;&#x3002;&#x5728;&#x6700;&#x5FEB;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;Buffer :: alloc &#x8C03;&#x7528; Buffer :: allocateAppend&#xFF0C;&#x540E;&#x8005;&#x8C03;&#x7528; Buffer :: Allocation :: allocateAppend&#x3002;&#x4ECE;&#x6027;&#x80FD;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x6B64;&#x4EE3;&#x7801;&#x6709;&#x4E24;&#x4E2A;&#x95EE;&#x9898;&#x3002;&#x7B2C;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x662F;&#x8981;&#x5355;&#x72EC;&#x68C0;&#x67E5;&#x8BB8;&#x591A;&#x7279;&#x6B8A;&#x60C5;&#x51B5;&#xFF1A;</p>
<ul>
<li>Buffer::allocateAppend &#x68C0;&#x67E5;&#x7F13;&#x51B2;&#x533A;&#x5F53;&#x524D;&#x662F;&#x5426;&#x6709;&#x4EFB;&#x4F55;&#x5206;&#x914D;&#x3002;</li>
<li>&#x4EE3;&#x7801;&#x68C0;&#x67E5;&#x4E24;&#x6B21;&#x4EE5;&#x67E5;&#x770B;&#x5F53;&#x524D;&#x5206;&#x914D;&#x662F;&#x5426;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x7A7A;&#x95F4;&#x5BB9;&#x7EB3;&#x65B0;&#x6570;&#x636E;&#xFF1A;&#x4E00;&#x6B21;&#x5728; Buffer::Allocation::allocateAppend &#x4E2D;&#xFF0C;&#x4E00;&#x6B21;&#x5728;&#x5176;&#x8FD4;&#x56DE;&#x503C;&#x7531; Buffer::allocateAppend &#x6D4B;&#x8BD5;&#x65F6;&#x3002;</li>
<li>Buffer::alloc &#x6D4B;&#x8BD5; Buffer::allocAppend &#x7684;&#x8FD4;&#x56DE;&#x503C;&#xFF0C;&#x4EE5;&#x518D;&#x6B21;&#x786E;&#x8BA4;&#x5206;&#x914D;&#x6210;&#x529F;&#x3002;</li>
</ul>
<p>&#x6B64;&#x5916;&#xFF0C;&#x8BE5;&#x4EE3;&#x7801;&#x6CA1;&#x6709;&#x5C1D;&#x8BD5;&#x76F4;&#x63A5;&#x6269;&#x5C55;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x5757;&#xFF0C;&#x800C;&#x662F;&#x5728;&#x4E0D;&#x8003;&#x8651;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x5757;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x5206;&#x914D;&#x4E86;&#x65B0;&#x7A7A;&#x95F4;&#x3002;&#x7136;&#x540E;&#xFF0C;Buffer::alloc &#x68C0;&#x67E5;&#x8BE5;&#x7A7A;&#x95F4;&#x662F;&#x5426;&#x6070;&#x597D;&#x4E0E;&#x6700;&#x540E;&#x4E00;&#x5757;&#x76F8;&#x90BB;&#xFF0C;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5B83;&#x5C06;&#x65B0;&#x7A7A;&#x95F4;&#x4E0E;&#x73B0;&#x6709;&#x5757;&#x5408;&#x5E76;&#x3002;&#x8FD9;&#x5BFC;&#x81F4;&#x5176;&#x4ED6;&#x68C0;&#x67E5;&#x3002;&#x603B;&#x4F53;&#x800C;&#x8A00;&#xFF0C;&#x6B64;&#x4EE3;&#x7801;&#x6D4B;&#x8BD5;&#x5173;&#x952E;&#x8DEF;&#x5F84;&#x4E2D;&#x7684; 6 &#x79CD;&#x4E0D;&#x540C;&#x6761;&#x4EF6;&#x3002;</p>
<p>&#x539F;&#x59CB;&#x4EE3;&#x7801;&#x7684;&#x7B2C;&#x4E8C;&#x4E2A;&#x95EE;&#x9898;&#x662F;&#x5B83;&#x5177;&#x6709;&#x592A;&#x591A;&#x7684;&#x5C42;&#xFF0C;&#x6240;&#x6709;&#x5C42;&#x90FD;&#x5F88;&#x6D45;&#x3002;&#x8FD9;&#x65E2;&#x662F;&#x6027;&#x80FD;&#x95EE;&#x9898;&#xFF0C;&#x4E5F;&#x662F;&#x8BBE;&#x8BA1;&#x95EE;&#x9898;&#x3002;&#x5173;&#x952E;&#x8DEF;&#x5F84;&#x9664;&#x4E86;&#x5BF9; Buffer::alloc &#x7684;&#x539F;&#x59CB;&#x8C03;&#x7528;&#x4E4B;&#x5916;&#xFF0C;&#x8FD8;&#x8FDB;&#x884C;&#x4E86;&#x53E6;&#x5916;&#x4E24;&#x4E2A;&#x65B9;&#x6CD5;&#x8C03;&#x7528;&#x3002;&#x6BCF;&#x4E2A;&#x65B9;&#x6CD5;&#x8C03;&#x7528;&#x82B1;&#x8D39;&#x989D;&#x5916;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x5E76;&#x4E14;&#x6BCF;&#x4E2A;&#x8C03;&#x7528;&#x7684;&#x7ED3;&#x679C;&#x5FC5;&#x987B;&#x7531;&#x5176;&#x8C03;&#x7528;&#x8005;&#x68C0;&#x67E5;&#xFF0C;&#x8FD9;&#x5BFC;&#x81F4;&#x9700;&#x8981;&#x8003;&#x8651;&#x66F4;&#x591A;&#x7279;&#x6B8A;&#x60C5;&#x51B5;&#x3002;&#x7B2C; 7 &#x7AE0;&#x8BA8;&#x8BBA;&#x4E86;&#x5F53;&#x60A8;&#x4ECE;&#x4E00;&#x5C42;&#x4F20;&#x9012;&#x5230;&#x53E6;&#x4E00;&#x5C42;&#x65F6;&#xFF0C;&#x62BD;&#x8C61;&#x901A;&#x5E38;&#x5E94;&#x8BE5;&#x5982;&#x4F55;&#x53D8;&#x5316;&#xFF0C;&#x4F46;&#x662F;&#x56FE; 20.2 &#x4E2D;&#x7684;&#x6240;&#x6709;&#x4E09;&#x79CD;&#x65B9;&#x6CD5;&#x90FD;&#x5177;&#x6709;&#x76F8;&#x540C;&#x7684;&#x7B7E;&#x540D;&#xFF0C;&#x5E76;&#x4E14;&#x5B83;&#x4EEC;&#x63D0;&#x4F9B;&#x4E86;&#x57FA;&#x672C;&#x76F8;&#x540C;&#x7684;&#x62BD;&#x8C61;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5371;&#x9669;&#x4FE1;&#x53F7;&#x3002;Buffer::allocateAppend &#x51E0;&#x4E4E;&#x662F;&#x4E00;&#x4E2A;&#x4F20;&#x9012;&#x65B9;&#x6CD5;&#xFF1B;&#x5B83;&#x7684;&#x552F;&#x4E00;&#x4F5C;&#x7528;&#x662F;&#x5728;&#x9700;&#x8981;&#x65F6;&#x521B;&#x5EFA;&#x65B0;&#x7684;&#x5206;&#x914D;&#x3002;&#x989D;&#x5916;&#x7684;&#x5C42;&#x4F7F;&#x4EE3;&#x7801;&#x65E2;&#x6162;&#x53C8;&#x590D;&#x6742;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x4EEC;&#x91CD;&#x6784;&#x4E86; Buffer &#x7C7B;&#xFF0C;&#x4F7F;&#x5176;&#x8BBE;&#x8BA1;&#x56F4;&#x7ED5;&#x6700;&#x5173;&#x952E;&#x6027;&#x80FD;&#x7684;&#x8DEF;&#x5F84;&#x8FDB;&#x884C;&#x3002;&#x6211;&#x4EEC;&#x4E0D;&#x4EC5;&#x8003;&#x8651;&#x4E86;&#x4E0A;&#x9762;&#x7684;&#x5206;&#x914D;&#x4EE3;&#x7801;&#xFF0C;&#x8FD8;&#x8003;&#x8651;&#x4E86;&#x5176; &#x200B;&#x200B; &#x4ED6;&#x51E0;&#x79CD;&#x5E38;&#x7528;&#x7684;&#x6267;&#x884C;&#x8DEF;&#x5F84;&#xFF0C;&#x4F8B;&#x5982;&#x68C0;&#x7D22;&#x5F53;&#x524D;&#x5B58;&#x50A8;&#x5728; Buffer &#x4E2D;&#x7684;&#x6570;&#x636E;&#x7684;&#x5B57;&#x8282;&#x603B;&#x6570;&#x3002;&#x5BF9;&#x4E8E;&#x8FD9;&#x4E9B;&#x5173;&#x952E;&#x8DEF;&#x5F84;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#xFF0C;&#x6211;&#x4EEC;&#x8BD5;&#x56FE;&#x786E;&#x5B9A;&#x5728;&#x901A;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#x5FC5;&#x987B;&#x6267;&#x884C;&#x7684;&#x6700;&#x5C11;&#x4EE3;&#x7801;&#x91CF;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x56F4;&#x7ED5;&#x8FD9;&#x4E9B;&#x5173;&#x952E;&#x8DEF;&#x5F84;&#x8BBE;&#x8BA1;&#x4E86;&#x8BFE;&#x7A0B;&#x7684;&#x5176;&#x4F59;&#x90E8;&#x5206;&#x3002;&#x6211;&#x4EEC;&#x8FD8;&#x5E94;&#x7528;&#x4E86;&#x672C;&#x4E66;&#x4E2D;&#x7684;&#x8BBE;&#x8BA1;&#x539F;&#x5219;&#x6765;&#x7B80;&#x5316;&#x6574;&#x4E2A;&#x7C7B;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x6211;&#x4EEC;&#x6D88;&#x9664;&#x4E86;&#x6D45;&#x5C42;&#x5E76;&#x521B;&#x5EFA;&#x4E86;&#x66F4;&#x6DF1;&#x7684;&#x5185;&#x90E8;&#x62BD;&#x8C61;&#x3002;&#x91CD;&#x6784;&#x7684;&#x7C7B;&#x6BD4;&#x539F;&#x59CB;&#x7248;&#x672C;&#x5C0F; 20&#xFF05;&#xFF08;1476 &#x884C;&#x4EE3;&#x7801;&#xFF0C;&#x800C;&#x539F;&#x59CB;&#x7248;&#x672C;&#x4E3A; 1886 &#x884C;&#xFF09;&#x3002;</p>
<p><img src="figures/00023.gif" alt=""></p>
<p>&#x56FE; 20.2&#xFF1A;&#x4F7F;&#x7528;&#x5185;&#x90E8;&#x5757;&#x5728; Buffer &#x7684;&#x672B;&#x5C3E;&#x5206;&#x914D;&#x65B0;&#x7A7A;&#x95F4;&#x7684;&#x539F;&#x59CB;&#x4EE3;&#x7801;&#x3002;</p>
<p><img src="figures/00024.gif" alt=""></p>
<p>&#x56FE; 20.3&#xFF1A;&#x7528;&#x4E8E;&#x5728; Buffer &#x7684;&#x5185;&#x90E8;&#x5757;&#x4E2D;&#x5206;&#x914D;&#x65B0;&#x7A7A;&#x95F4;&#x7684;&#x65B0;&#x4EE3;&#x7801;&#x3002;</p>
<p>&#x56FE; 20.3 &#x663E;&#x793A;&#x4E86;&#x7528;&#x4E8E;&#x5728; Buffer &#x4E2D;&#x5206;&#x914D;&#x5185;&#x90E8;&#x7A7A;&#x95F4;&#x7684;&#x65B0;&#x5173;&#x952E;&#x8DEF;&#x5F84;&#x3002;&#x65B0;&#x4EE3;&#x7801;&#x4E0D;&#x4EC5;&#x901F;&#x5EA6;&#x66F4;&#x5FEB;&#xFF0C;&#x800C;&#x4E14;&#x66F4;&#x5BB9;&#x6613;&#x9605;&#x8BFB;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x907F;&#x514D;&#x4E86;&#x6D45;&#x5C42;&#x62BD;&#x8C61;&#x3002;&#x6574;&#x4E2A;&#x8DEF;&#x5F84;&#x4F7F;&#x7528;&#x5355;&#x4E00;&#x65B9;&#x6CD5;&#x5904;&#x7406;&#xFF0C;&#x5E76;&#x4E14;&#x4F7F;&#x7528;&#x5355;&#x4E00;&#x6D4B;&#x8BD5;&#x6392;&#x9664;&#x6240;&#x6709;&#x7279;&#x6B8A;&#x60C5;&#x51B5;&#x3002;&#x65B0;&#x4EE3;&#x7801;&#x5F15;&#x5165;&#x4E86;&#x65B0;&#x7684;&#x5B9E;&#x4F8B;&#x53D8;&#x91CF; extraAppendBytes&#xFF0C;&#x4EE5;&#x7B80;&#x5316;&#x5173;&#x952E;&#x8DEF;&#x5F84;&#x3002;&#x6B64;&#x53D8;&#x91CF;&#x8DDF;&#x8E2A;&#x7F13;&#x51B2;&#x533A;&#x4E2D;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x5757;&#x4E4B;&#x540E;&#x7ACB;&#x5373;&#x6709;&#x591A;&#x5C11;&#x672A;&#x4F7F;&#x7528;&#x7A7A;&#x95F4;&#x53EF;&#x7528;&#x3002;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x53EF;&#x7528;&#x7A7A;&#x95F4;&#xFF0C;&#x6216;&#x8005; Buffer &#x4E2D;&#x7684;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x5757;&#x4E0D;&#x662F;&#x5185;&#x90E8;&#x5757;&#xFF0C;&#x6216;&#x8005; Buffer &#x6839;&#x672C;&#x4E0D;&#x5305;&#x542B;&#x4EFB;&#x4F55;&#x5757;&#xFF0C;&#x5219; extraAppendBytes &#x4E3A;&#x96F6;&#x3002;&#x56FE; 20.3 &#x4E2D;&#x7684;&#x4EE3;&#x7801;&#x8868;&#x793A;&#x5904;&#x7406;&#x8FD9;&#x79CD;&#x5E38;&#x89C1;&#x60C5;&#x51B5;&#x7684;&#x6700;&#x5C11;&#x4EE3;&#x7801;&#x91CF;&#x3002;</p>
<p>&#x6CE8;&#x610F;&#xFF1A;&#x53EA;&#x8981;&#x9700;&#x8981;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x91CD;&#x65B0;&#x8BA1;&#x7B97;&#x5404;&#x4E2A;&#x5757;&#x7684;&#x603B;&#x7F13;&#x51B2;&#x533A;&#x957F;&#x5EA6;&#x6765;&#x6D88;&#x9664;&#x5BF9; totalLength &#x7684;&#x66F4;&#x65B0;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x5BF9;&#x4E8E;&#x5177;&#x6709;&#x8BB8;&#x591A;&#x5757;&#x7684;&#x5927;&#x578B; Buffer &#x800C;&#x8A00;&#x5C06;&#x662F;&#x6602;&#x8D35;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x83B7;&#x53D6; Buffer &#x7684;&#x603B;&#x957F;&#x5EA6;&#x662F;&#x53E6;&#x4E00;&#x79CD;&#x5E38;&#x89C1;&#x7684;&#x64CD;&#x4F5C;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x9009;&#x62E9;&#x6DFB;&#x52A0;&#x5C11;&#x91CF;&#x989D;&#x5916;&#x7684;&#x5F00;&#x9500;&#x6765;&#x5206;&#x914D;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD; Buffer &#x957F;&#x5EA6;&#x59CB;&#x7EC8;&#x7ACB;&#x5373;&#x53EF;&#x7528;&#x3002;</p>
<p>&#x65B0;&#x4EE3;&#x7801;&#x7684;&#x901F;&#x5EA6;&#x7EA6;&#x4E3A;&#x65E7;&#x4EE3;&#x7801;&#x7684;&#x4E24;&#x500D;&#xFF1A;&#x4F7F;&#x7528;&#x5185;&#x90E8;&#x5B58;&#x50A8;&#x5C06; 1 &#x5B57;&#x8282;&#x5B57;&#x7B26;&#x4E32;&#x9644;&#x52A0;&#x5230;&#x7F13;&#x51B2;&#x533A;&#x7684;&#x603B;&#x65F6;&#x95F4;&#x4ECE; 8.8 ns &#x964D;&#x4F4E;&#x5230; 4.75 ns&#x3002;&#x7531;&#x4E8E;&#x4FEE;&#x8BA2;&#xFF0C;&#x8BB8;&#x591A;&#x5176;&#x4ED6;&#x7F13;&#x51B2;&#x533A;&#x64CD;&#x4F5C;&#x4E5F;&#x52A0;&#x5FEB;&#x4E86;&#x901F;&#x5EA6;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x6784;&#x5EFA;&#x65B0;&#x7F13;&#x51B2;&#x533A;&#xFF0C;&#x5728;&#x5185;&#x90E8;&#x5B58;&#x50A8;&#x4E2D;&#x9644;&#x52A0;&#x4E00;&#x5C0F;&#x5757;&#x5E76;&#x9500;&#x6BC1;&#x7F13;&#x51B2;&#x533A;&#x6240;&#x9700;&#x7684;&#x65F6;&#x95F4;&#x4ECE; 24 ns &#x964D;&#x81F3; 12 ns&#x3002;</p>
<h2 id="205-conclusion-&#x7ED3;&#x8BBA;">20.5 Conclusion &#x7ED3;&#x8BBA;</h2>
<p>&#x672C;&#x7AE0;&#x6700;&#x91CD;&#x8981;&#x7684;&#x603B;&#x4F53;&#x6559;&#x8BAD;&#x662F;&#xFF0C;&#x5E72;&#x51C0;&#x7684;&#x8BBE;&#x8BA1;&#x548C;&#x9AD8;&#x6027;&#x80FD;&#x662F;&#x517C;&#x5BB9;&#x7684;&#x3002;&#x91CD;&#x5199; Buffer &#x7C7B;&#x53EF;&#x5C06;&#x5176;&#x6027;&#x80FD;&#x63D0;&#x9AD8; 2 &#x500D;&#xFF0C;&#x540C;&#x65F6;&#x7B80;&#x5316;&#x5176;&#x8BBE;&#x8BA1;&#x5E76;&#x5C06;&#x4EE3;&#x7801;&#x5927;&#x5C0F;&#x51CF;&#x5C11; 20&#xFF05;&#x3002;&#x590D;&#x6742;&#x7684;&#x4EE3;&#x7801;&#x901A;&#x5E38;&#x4F1A;&#x5F88;&#x6162;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4F1A;&#x6267;&#x884C;&#x591A;&#x4F59;&#x6216;&#x591A;&#x4F59;&#x7684;&#x5DE5;&#x4F5C;&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x5982;&#x679C;&#x60A8;&#x7F16;&#x5199;&#x5E72;&#x51C0;&#xFF0C;&#x7B80;&#x5355;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x5219;&#x7CFB;&#x7EDF;&#x53EF;&#x80FD;&#x4F1A;&#x8DB3;&#x591F;&#x5FEB;&#xFF0C;&#x56E0;&#x6B64;&#x60A8;&#x4E00;&#x5F00;&#x59CB;&#x5C31;&#x4E0D;&#x5FC5;&#x62C5;&#x5FC3;&#x6027;&#x80FD;&#x3002;&#x5728;&#x5C11;&#x6570;&#x9700;&#x8981;&#x4F18;&#x5316;&#x6027;&#x80FD;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5173;&#x952E;&#x518D;&#x6B21;&#x662F;&#x7B80;&#x5355;&#x6027;&#xFF1A;&#x627E;&#x5230;&#x5BF9;&#x6027;&#x80FD;&#x6700;&#x91CD;&#x8981;&#x7684;&#x5173;&#x952E;&#x8DEF;&#x5F84;&#x5E76;&#x4F7F;&#x5B83;&#x4EEC;&#x5C3D;&#x53EF;&#x80FD;&#x7B80;&#x5355;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="ch19.html" class="navigation navigation-prev " aria-label="Previous page: 第十九章: 软件发展趋势">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="ch21.html" class="navigation navigation-next " aria-label="Next page: 第二十一章: 结论">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第二十章: 设计性能","level":"1.23","depth":1,"next":{"title":"第二十一章: 结论","level":"1.24","depth":1,"path":"docs/ch21.md","ref":"./docs/ch21.md","articles":[]},"previous":{"title":"第十九章: 软件发展趋势","level":"1.22","depth":1,"path":"docs/ch19.md","ref":"./docs/ch19.md","articles":[]},"dir":"ltr"},"config":{"plugins":["back-to-top-button","expandable-chapters-small","page-toc-button","livereload"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"livereload":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"page-toc-button":{},"back-to-top-button":{},"expandable-chapters-small":{},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"John Ousterhout","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"软件设计哲学","language":"zh-hans","gitbook":"*","description":"书中讨论了软件设计的主题：如何将复杂的软件系统分解成可以相对独立实现的模块(如类和方法)"},"file":{"path":"docs/ch20.md","mtime":"2020-08-06T16:26:19.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-02-06T04:55:41.669Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-page-toc-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

