
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第三章：工作代码是不够的（战略与战术编程） · 软件设计哲学</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="John Ousterhout">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-page-toc-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="ch4.html" />
    
    
    <link rel="prev" href="ch2.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    首页
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="preface">
            
                <span>
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="ch1.html">
            
                <a href="ch1.html">
            
                    
                    第一章：介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="ch2.html">
            
                <a href="ch2.html">
            
                    
                    第二章：复杂性的本质
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.6" data-path="ch3.html">
            
                <a href="ch3.html">
            
                    
                    第三章：工作代码是不够的（战略与战术编程）
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="ch4.html">
            
                <a href="ch4.html">
            
                    
                    第四章：模块应该是深的
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="ch5.html">
            
                <a href="ch5.html">
            
                    
                    第五章：信息隐藏(和泄露)
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="ch6.html">
            
                <a href="ch6.html">
            
                    
                    第六章：通用模块更深入
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="ch7.html">
            
                <a href="ch7.html">
            
                    
                    第七章: 不同的层，不同的抽象
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="ch8.html">
            
                <a href="ch8.html">
            
                    
                    第八章: 降低复杂性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="ch9.html">
            
                <a href="ch9.html">
            
                    
                    第九章: 在一起更好还是分开更好？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="ch10.html">
            
                <a href="ch10.html">
            
                    
                    第十章: 定义不存在的错误
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="ch11.html">
            
                <a href="ch11.html">
            
                    
                    第十一章: 设计它两次
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="ch12.html">
            
                <a href="ch12.html">
            
                    
                    第十二章: 为什么写注释？四个理由
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="ch13.html">
            
                <a href="ch13.html">
            
                    
                    第十三章: 注释应该描述代码中不明显的内容
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="ch14.html">
            
                <a href="ch14.html">
            
                    
                    第十四章: 选择的名字
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="ch15.html">
            
                <a href="ch15.html">
            
                    
                    第十五章: 先写注释
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="ch16.html">
            
                <a href="ch16.html">
            
                    
                    第十六章: 修改现有的代码
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.20" data-path="ch17.html">
            
                <a href="ch17.html">
            
                    
                    第十七章: 一致性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.21" data-path="ch18.html">
            
                <a href="ch18.html">
            
                    
                    第十八章: 代码应该是显而易见的
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.22" data-path="ch19.html">
            
                <a href="ch19.html">
            
                    
                    第十九章: 软件发展趋势
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.23" data-path="ch20.html">
            
                <a href="ch20.html">
            
                    
                    第二十章: 设计性能
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.24" data-path="ch21.html">
            
                <a href="ch21.html">
            
                    
                    第二十一章: 结论
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.25" data-path="summary.html">
            
                <a href="summary.html">
            
                    
                    总结
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >第三章：工作代码是不够的（战略与战术编程）</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7B2C;&#x4E09;&#x7AE0;&#xFF1A;&#x5DE5;&#x4F5C;&#x4EE3;&#x7801;&#x662F;&#x4E0D;&#x591F;&#x7684;&#xFF08;&#x6218;&#x7565;&#x4E0E;&#x6218;&#x672F;&#x7F16;&#x7A0B;&#xFF09;">&#x7B2C;&#x4E09;&#x7AE0;&#xFF1A;&#x5DE5;&#x4F5C;&#x4EE3;&#x7801;&#x662F;&#x4E0D;&#x591F;&#x7684;&#xFF08;&#x6218;&#x7565;&#x4E0E;&#x6218;&#x672F;&#x7F16;&#x7A0B;&#xFF09;</h1>
<p>&#x597D;&#x7684;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x4E2D;&#x6700;&#x91CD;&#x8981;&#x7684;&#x5143;&#x7D20;&#x4E4B;&#x4E00;&#x662F;&#x60A8;&#x5728;&#x6267;&#x884C;&#x7F16;&#x7A0B;&#x4EFB;&#x52A1;&#x65F6;&#x6240;&#x91C7;&#x7528;&#x7684;&#x601D;&#x7EF4;&#x65B9;&#x5F0F;&#x3002;&#x8BB8;&#x591A;&#x7EC4;&#x7EC7;&#x90FD;&#x9F13;&#x52B1;&#x91C7;&#x53D6;&#x6218;&#x672F;&#x601D;&#x7EF4;&#x65B9;&#x5F0F;&#xFF0C;&#x7740;&#x773C;&#x4E8E;&#x4F7F;&#x529F;&#x80FD;&#x5C3D;&#x5FEB;&#x8FD0;&#x884C;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x60A8;&#x60F3;&#x8981;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x5219;&#x5FC5;&#x987B;&#x91C7;&#x53D6;&#x66F4;&#x5177;&#x6218;&#x7565;&#x6027;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5728;&#x6B64;&#x4E0A;&#x82B1;&#x8D39;&#x65F6;&#x95F4;&#x6765;&#x5236;&#x4F5C;&#x5E72;&#x51C0;&#x7684;&#x8BBE;&#x8BA1;&#x5E76;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x3002;&#x672C;&#x7AE0;&#x8BA8;&#x8BBA;&#x4E86;&#x4ECE;&#x957F;&#x8FDC;&#x6765;&#x770B;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x6218;&#x7565;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x4EA7;&#x751F;&#x66F4;&#x597D;&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x800C;&#x5B9E;&#x9645;&#x4E0A;&#x5374;&#x6BD4;&#x6218;&#x672F;&#x65B9;&#x6CD5;&#x4FBF;&#x5B9C;&#x3002;</p>
<h4 id="31-&#x6218;&#x672F;&#x7F16;&#x7A0B;">3.1 &#x6218;&#x672F;&#x7F16;&#x7A0B;</h4>
<p>&#x5927;&#x591A;&#x6570;&#x7A0B;&#x5E8F;&#x5458;&#x4EE5;&#x6211;&#x79F0;&#x4E3A;&#x6218;&#x672F;&#x7F16;&#x7A0B;&#x7684;&#x5FC3;&#x6001;&#x6765;&#x8FDB;&#x884C;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x3002;&#x5728;&#x6218;&#x672F;&#x65B9;&#x6CD5;&#x4E2D;&#xFF0C;&#x60A8;&#x7684;&#x4E3B;&#x8981;&#x91CD;&#x70B9;&#x662F;&#x4F7F;&#x67D0;&#x4E9B;&#x529F;&#x80FD;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#xFF0C;&#x4F8B;&#x5982;&#x65B0;&#x529F;&#x80FD;&#x6216;&#x9519;&#x8BEF;&#x4FEE;&#x590D;&#x3002;&#x4E4D;&#x4E00;&#x770B;&#xFF0C;&#x8FD9;&#x4F3C;&#x4E4E;&#x662F;&#x5B8C;&#x5168;&#x5408;&#x7406;&#x7684;&#xFF1A;&#x8FD8;&#x6709;&#x4EC0;&#x4E48;&#x6BD4;&#x7F16;&#x5199;&#x6709;&#x6548;&#x7684;&#x4EE3;&#x7801;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x5462;&#xFF1F;&#x4F46;&#x662F;&#xFF0C;&#x6218;&#x672F;&#x7F16;&#x7A0B;&#x51E0;&#x4E4E;&#x4E0D;&#x53EF;&#x80FD;&#x4EA7;&#x751F;&#x51FA;&#x826F;&#x597D;&#x7684;&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;&#x3002;</p>
<p>&#x6218;&#x672F;&#x7F16;&#x7A0B;&#x7684;&#x95EE;&#x9898;&#x662F;&#x5B83;&#x662F;&#x77ED;&#x89C6;&#x7684;&#x3002;&#x5982;&#x679C;&#x60A8;&#x662F;&#x6218;&#x672F;&#x7F16;&#x7A0B;&#x4EBA;&#x5458;&#xFF0C;&#x90A3;&#x4E48;&#x60A8;&#x5C06;&#x5C1D;&#x8BD5;&#x5C3D;&#x5FEB;&#x5B8C;&#x6210;&#x4EFB;&#x52A1;&#x3002;&#x4E5F;&#x8BB8;&#x60A8;&#x6709;&#x4E00;&#x4E2A;&#x8270;&#x96BE;&#x7684;&#x671F;&#x9650;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x4E3A;&#x672A;&#x6765;&#x505A;&#x8BA1;&#x5212;&#x4E0D;&#x662F;&#x4F18;&#x5148;&#x4E8B;&#x9879;&#x3002;&#x60A8;&#x4E0D;&#x4F1A;&#x82B1;&#x8D39;&#x592A;&#x591A;&#x65F6;&#x95F4;&#x6765;&#x5BFB;&#x627E;&#x6700;&#x4F73;&#x8BBE;&#x8BA1;&#x3002;&#x60A8;&#x53EA;&#x60F3;&#x5C3D;&#x5FEB;&#x4F7F;&#x67D0;&#x4EF6;&#x4E8B;&#x8D77;&#x4F5C;&#x7528;&#x3002;&#x60A8;&#x544A;&#x8BC9;&#x81EA;&#x5DF1;&#xFF0C;&#x53EF;&#x4EE5;&#x589E;&#x52A0;&#x4E00;&#x4E9B;&#x590D;&#x6742;&#x6027;&#x6216;&#x5F15;&#x5165;&#x4E00;&#x4E24;&#x4E2A;&#x5C0F;&#x9519;&#x8BEF;&#xFF0C;&#x5982;&#x679C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x4F7F;&#x5F53;&#x524D;&#x4EFB;&#x52A1;&#x66F4;&#x5FEB;&#x5730;&#x5B8C;&#x6210;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x3002;</p>
<p>&#x8FD9;&#x5C31;&#x662F;&#x7CFB;&#x7EDF;&#x53D8;&#x5F97;&#x590D;&#x6742;&#x7684;&#x65B9;&#x5F0F;&#x3002;&#x5982;&#x4E0A;&#x4E00;&#x7AE0;&#x6240;&#x8FF0;&#xFF0C;&#x590D;&#x6742;&#x5EA6;&#x662F;&#x9012;&#x589E;&#x7684;&#x3002;&#x4E0D;&#x662F;&#x4F7F;&#x7CFB;&#x7EDF;&#x590D;&#x6742;&#x7684;&#x7279;&#x5B9A;&#x4E8B;&#x7269;&#xFF0C;&#x800C;&#x662F;&#x6570;&#x5341;&#x6216;&#x6570;&#x767E;&#x4E2A;&#x5C0F;&#x4E8B;&#x7269;&#x7684;&#x79EF;&#x7D2F;&#x3002;&#x5982;&#x679C;&#x60A8;&#x8FDB;&#x884C;&#x6218;&#x672F;&#x7F16;&#x7A0B;&#xFF0C;&#x5219;&#x6BCF;&#x4E2A;&#x7F16;&#x7A0B;&#x4EFB;&#x52A1;&#x90FD;&#x4F1A;&#x5E26;&#x6765;&#x4E00;&#x4E9B;&#x6B64;&#x7C7B;&#x590D;&#x6742;&#x6027;&#x3002;&#x4E3A;&#x4E86;&#x5FEB;&#x901F;&#x5B8C;&#x6210;&#x5F53;&#x524D;&#x4EFB;&#x52A1;&#xFF0C;&#x4ED6;&#x4EEC;&#x6BCF;&#x4E2A;&#x4EBA;&#x4F3C;&#x4E4E;&#x90FD;&#x662F;&#x4E00;&#x4E2A;&#x5408;&#x7406;&#x7684;&#x6298;&#x8877;&#x65B9;&#x6848;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x590D;&#x6742;&#x6027;&#x8FC5;&#x901F;&#x7D2F;&#x79EF;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x5982;&#x679C;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x5728;&#x6218;&#x672F;&#x4E0A;&#x8FDB;&#x884C;&#x7F16;&#x7A0B;&#x7684;&#x65F6;&#x5019;&#x3002;</p>
<p>&#x4E0D;&#x4E45;&#x4E4B;&#x540E;&#xFF0C;&#x67D0;&#x4E9B;&#x590D;&#x6742;&#x6027;&#x5C06;&#x5F00;&#x59CB;&#x5F15;&#x8D77;&#x95EE;&#x9898;&#xFF0C;&#x5E76;&#x4E14;&#x60A8;&#x5C06;&#x5F00;&#x59CB;&#x5E0C;&#x671B;&#x60A8;&#x6CA1;&#x6709;&#x91C7;&#x7528;&#x8FD9;&#x4E9B;&#x65E9;&#x671F;&#x7684;&#x6377;&#x5F84;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x60A8;&#x4F1A;&#x544A;&#x8BC9;&#x81EA;&#x5DF1;&#xFF0C;&#x4F7F;&#x4E0B;&#x4E00;&#x4E2A;&#x529F;&#x80FD;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#x6BD4;&#x8FD4;&#x56DE;&#x5E76;&#x91CD;&#x6784;&#x73B0;&#x6709;&#x4EE3;&#x7801;&#x66F4;&#x4E3A;&#x91CD;&#x8981;&#x3002;&#x4ECE;&#x957F;&#x8FDC;&#x6765;&#x770B;&#xFF0C;&#x91CD;&#x6784;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x6240;&#x5E2E;&#x52A9;&#xFF0C;&#x4F46;&#x662F;&#x80AF;&#x5B9A;&#x4F1A;&#x51CF;&#x6162;&#x5F53;&#x524D;&#x7684;&#x4EFB;&#x52A1;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x60A8;&#x9700;&#x8981;&#x5FEB;&#x901F;&#x4FEE;&#x8865;&#x7A0B;&#x5E8F;&#x6765;&#x89E3;&#x51B3;&#x9047;&#x5230;&#x7684;&#x4EFB;&#x4F55;&#x95EE;&#x9898;&#x3002;&#x8FD9;&#x53EA;&#x4F1A;&#x589E;&#x52A0;&#x590D;&#x6742;&#x6027;&#xFF0C;&#x7136;&#x540E;&#x9700;&#x8981;&#x66F4;&#x591A;&#x8865;&#x4E01;&#x3002;&#x5F88;&#x5FEB;&#x4EE3;&#x7801;&#x53D8;&#x5F97;&#x4E00;&#x56E2;&#x7CDF;&#xFF0C;&#x4F46;&#x662F;&#x5230;&#x73B0;&#x5728;&#x4E3A;&#x6B62;&#xFF0C;&#x60C5;&#x51B5;&#x5DF2;&#x7ECF;&#x5F88;&#x7CDF;&#x7CD5;&#x4E86;&#xFF0C;&#x6E05;&#x7406;&#x5B83;&#x9700;&#x8981;&#x82B1;&#x8D39;&#x6570;&#x6708;&#x7684;&#x65F6;&#x95F4;&#x3002;&#x60A8;&#x7684;&#x65E5;&#x7A0B;&#x5B89;&#x6392;&#x65E0;&#x6CD5;&#x5BB9;&#x5FCD;&#x8FD9;&#x79CD;&#x5EF6;&#x8FDF;&#xFF0C;&#x89E3;&#x51B3;&#x4E00;&#x4E2A;&#x6216;&#x4E24;&#x4E2A;&#x95EE;&#x9898;&#x4F3C;&#x4E4E;&#x5E76;&#x6CA1;&#x6709;&#x592A;&#x5927;&#x7684;&#x533A;&#x522B;&#xFF0C;&#x56E0;&#x6B64;&#x60A8;&#x53EA;&#x662F;&#x5728;&#x6218;&#x672F;&#x4E0A;&#x4FDD;&#x6301;&#x7F16;&#x7A0B;&#x3002;</p>
<p>&#x5982;&#x679C;&#x60A8;&#x4ECE;&#x4E8B;&#x5927;&#x578B;&#x8F6F;&#x4EF6;&#x9879;&#x76EE;&#x7684;&#x65F6;&#x95F4;&#x5F88;&#x957F;&#xFF0C;&#x6211;&#x6000;&#x7591;&#x60A8;&#x5728;&#x5DE5;&#x4F5C;&#x4E2D;&#x5DF2;&#x7ECF;&#x770B;&#x5230;&#x4E86;&#x6218;&#x672F;&#x7F16;&#x7A0B;&#xFF0C;&#x5E76;&#x4E14;&#x9047;&#x5230;&#x4E86;&#x5BFC;&#x81F4;&#x7684;&#x95EE;&#x9898;&#x3002;&#x4E00;&#x65E6;&#x60A8;&#x6CBF;&#x7740;&#x6218;&#x672F;&#x8DEF;&#x7EBF;&#x8D70;&#xFF0C;&#x5C31;&#x5F88;&#x96BE;&#x6539;&#x53D8;&#x3002;</p>
<p>&#x51E0;&#x4E4E;&#x6BCF;&#x4E2A;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x7EC4;&#x7EC7;&#x90FD;&#x6709;&#x81F3;&#x5C11;&#x4E00;&#x4E2A;&#x5C06;&#x6218;&#x672F;&#x7F16;&#x7A0B;&#x53D1;&#x6325;&#x5230;&#x6781;&#x81F4;&#x7684;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#xFF1A;&#x6218;&#x672F;&#x9F99;&#x5377;&#x98CE;&#x3002;&#x6218;&#x672F;&#x9F99;&#x5377;&#x98CE;&#x662F;&#x4E00;&#x4F4D;&#x591A;&#x4EA7;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#xFF0C;&#x4ED6;&#x62BD;&#x51FA;&#x4EE3;&#x7801;&#x7684;&#x901F;&#x5EA6;&#x6BD4;&#x5176;&#x4ED6;&#x4EBA;&#x5FEB;&#x5F97;&#x591A;&#xFF0C;&#x4F46;&#x5B8C;&#x5168;&#x4EE5;&#x6218;&#x672F;&#x65B9;&#x5F0F;&#x5DE5;&#x4F5C;&#x3002;&#x5B9E;&#x65BD;&#x5FEB;&#x901F;&#x529F;&#x80FD;&#x65F6;&#xFF0C;&#x6CA1;&#x6709;&#x4EBA;&#x80FD;&#x6BD4;&#x6218;&#x672F;&#x9F99;&#x5377;&#x98CE;&#x66F4;&#x5FEB;&#x5730;&#x5B8C;&#x6210;&#x4EFB;&#x52A1;&#x3002;&#x5728;&#x67D0;&#x4E9B;&#x7EC4;&#x7EC7;&#x4E2D;&#xFF0C;&#x7BA1;&#x7406;&#x5C42;&#x5C06;&#x6218;&#x672F;&#x9F99;&#x5377;&#x98CE;&#x89C6;&#x4E3A;&#x82F1;&#x96C4;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x6218;&#x672F;&#x9F99;&#x5377;&#x98CE;&#x7559;&#x4E0B;&#x4E86;&#x6BC1;&#x706D;&#x7684;&#x75D5;&#x8FF9;&#x3002;&#x4ED6;&#x4EEC;&#x5F88;&#x5C11;&#x88AB;&#x5C06;&#x6765;&#x5FC5;&#x987B;&#x4F7F;&#x7528;&#x5176;&#x4EE3;&#x7801;&#x7684;&#x5DE5;&#x7A0B;&#x5E08;&#x89C6;&#x4E3A;&#x82F1;&#x96C4;&#x3002;&#x901A;&#x5E38;&#xFF0C;&#x5176;&#x4ED6;&#x5DE5;&#x7A0B;&#x5E08;&#x5FC5;&#x987B;&#x6E05;&#x7406;&#x6218;&#x672F;&#x9F99;&#x5377;&#x98CE;&#x7559;&#x4E0B;&#x7684;&#x6DF7;&#x4E71;&#x5C40;&#x9762;&#xFF0C;&#x8FD9;&#x4F7F;&#x5F97;&#x90A3;&#x4E9B;&#x5DE5;&#x7A0B;&#x5E08;&#xFF08;&#x4ED6;&#x4EEC;&#x662F;&#x771F;&#x6B63;&#x7684;&#x82F1;&#x96C4;&#xFF09;&#x7684;&#x8FDB;&#x6B65;&#x4F3C;&#x4E4E;&#x6BD4;&#x6218;&#x672F;&#x9F99;&#x5377;&#x98CE;&#x6162;&#x3002;</p>
<p>&#x6210;&#x4E3A;&#x4E00;&#x540D;&#x4F18;&#x79C0;&#x7684;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x5E08;&#x7684;&#x7B2C;&#x4E00;&#x6B65;&#x662F;&#x8981;&#x610F;&#x8BC6;&#x5230;&#x4EC5;&#x5DE5;&#x4F5C;&#x4EE3;&#x7801;&#x662F;&#x4E0D;&#x591F;&#x7684;&#x3002;&#x5F15;&#x5165;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x590D;&#x6742;&#x6027;&#x4EE5;&#x66F4;&#x5FEB;&#x5730;&#x5B8C;&#x6210;&#x5F53;&#x524D;&#x4EFB;&#x52A1;&#x662F;&#x4E0D;&#x53EF;&#x63A5;&#x53D7;&#x7684;&#x3002;&#x6700;&#x91CD;&#x8981;&#x7684;&#x662F;&#x7CFB;&#x7EDF;&#x7684;&#x957F;&#x671F;&#x7ED3;&#x6784;&#x3002;&#x4EFB;&#x4F55;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x5927;&#x591A;&#x6570;&#x4EE3;&#x7801;&#x90FD;&#x662F;&#x901A;&#x8FC7;&#x6269;&#x5C55;&#x73B0;&#x6709;&#x4EE3;&#x7801;&#x5E93;&#x7F16;&#x5199;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x4F5C;&#x4E3A;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#xFF0C;&#x6700;&#x91CD;&#x8981;&#x7684;&#x5DE5;&#x4F5C;&#x5C31;&#x662F;&#x4FC3;&#x8FDB;&#x8FD9;&#x4E9B;&#x5C06;&#x6765;&#x7684;&#x6269;&#x5C55;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5C3D;&#x7BA1;&#x60A8;&#x7684;&#x4EE3;&#x7801;&#x5F53;&#x7136;&#x5FC5;&#x987B;&#x5DE5;&#x4F5C;&#xFF0C;&#x4F46;&#x60A8;&#x4E0D;&#x5E94;&#x5C06;&#x201C;&#x5DE5;&#x4F5C;&#x4EE3;&#x7801;&#x201D;&#x89C6;&#x4E3A;&#x4E3B;&#x8981;&#x76EE;&#x6807;&#x3002;&#x60A8;&#x7684;&#x4E3B;&#x8981;&#x76EE;&#x6807;&#x5FC5;&#x987B;&#x662F;&#x5236;&#x4F5C;&#x51FA;&#x51FA;&#x8272;&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x5E76;&#x4E14;&#x8FD9;&#x79CD;&#x8BBE;&#x8BA1;&#x4E5F;&#x4F1A;&#x8D77;&#x4F5C;&#x7528;&#x3002;&#x8FD9;&#x662F;&#x6218;&#x7565;&#x8BA1;&#x5212;&#x3002;</p>
<p>&#x6218;&#x7565;&#x6027;&#x7F16;&#x7A0B;&#x9700;&#x8981;&#x4E00;&#x79CD;&#x6295;&#x8D44;&#x5FC3;&#x6001;&#x3002;&#x60A8;&#x5FC5;&#x987B;&#x82B1;&#x8D39;&#x65F6;&#x95F4;&#x6765;&#x6539;&#x8FDB;&#x7CFB;&#x7EDF;&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x91C7;&#x53D6;&#x6700;&#x5FEB;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x5B8C;&#x6210;&#x5F53;&#x524D;&#x7684;&#x9879;&#x76EE;&#x3002;&#x8FD9;&#x4E9B;&#x6295;&#x8D44;&#x4F1A;&#x5728;&#x77ED;&#x671F;&#x5185;&#x8BA9;&#x60A8;&#x653E;&#x6162;&#x811A;&#x6B65;&#xFF0C;&#x4F46;&#x4ECE;&#x957F;&#x8FDC;&#x6765;&#x770B;&#x4F1A;&#x52A0;&#x5FEB;&#x60A8;&#x7684;&#x901F;&#x5EA6;&#xFF0C;&#x5982;&#x56FE; 3.1 &#x6240;&#x793A;&#x3002;</p>
<p>&#x4E00;&#x4E9B;&#x6295;&#x8D44;&#x5C06;&#x662F;&#x79EF;&#x6781;&#x7684;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x503C;&#x5F97;&#x82B1;&#x4E00;&#x4E9B;&#x65F6;&#x95F4;&#x4E3A;&#x6BCF;&#x4E2A;&#x65B0;&#x7C7B;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x8BBE;&#x8BA1;&#x3002;&#x800C;&#x4E0D;&#x662F;&#x5B9E;&#x65BD;&#x60F3;&#x5230;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x60F3;&#x6CD5;&#xFF0C;&#x8BF7;&#x5C1D;&#x8BD5;&#x51E0;&#x79CD;&#x66FF;&#x4EE3;&#x8BBE;&#x8BA1;&#x5E76;&#x9009;&#x62E9;&#x6700;&#x7B80;&#x6D01;&#x7684;&#x8BBE;&#x8BA1;&#x3002;&#x8BD5;&#x60F3;&#x4E00;&#x4E0B;&#x5C06;&#x6765;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x66F4;&#x6539;&#x7CFB;&#x7EDF;&#x7684;&#x51E0;&#x79CD;&#x65B9;&#x5F0F;&#xFF0C;&#x5E76;&#x786E;&#x4FDD;&#x8BBE;&#x8BA1;&#x5BB9;&#x6613;&#x3002;&#x7F16;&#x5199;&#x597D;&#x7684;&#x6587;&#x6863;&#x662F;&#x4E3B;&#x52A8;&#x6295;&#x8D44;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x3002;</p>
<h2 id="32-&#x6218;&#x7565;&#x89C4;&#x5212;">3.2 &#x6218;&#x7565;&#x89C4;&#x5212;</h2>
<p>&#x6210;&#x4E3A;&#x4E00;&#x540D;&#x4F18;&#x79C0;&#x7684;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x5E08;&#x7684;&#x7B2C;&#x4E00;&#x6B65;&#x662F;&#x8981;&#x610F;&#x8BC6;&#x5230;&#x4EC5;&#x5DE5;&#x4F5C;&#x4EE3;&#x7801;&#x662F;&#x4E0D;&#x591F;&#x7684;&#x3002;&#x5F15;&#x5165;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x590D;&#x6742;&#x6027;&#x4EE5;&#x66F4;&#x5FEB;&#x5730;&#x5B8C;&#x6210;&#x5F53;&#x524D;&#x4EFB;&#x52A1;&#x662F;&#x4E0D;&#x53EF;&#x63A5;&#x53D7;&#x7684;&#x3002;&#x6700;&#x91CD;&#x8981;&#x7684;&#x662F;&#x7CFB;&#x7EDF;&#x7684;&#x957F;&#x671F;&#x7ED3;&#x6784;&#x3002;&#x4EFB;&#x4F55;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x5927;&#x591A;&#x6570;&#x4EE3;&#x7801;&#x90FD;&#x662F;&#x901A;&#x8FC7;&#x6269;&#x5C55;&#x73B0;&#x6709;&#x4EE3;&#x7801;&#x5E93;&#x7F16;&#x5199;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x4F5C;&#x4E3A;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#xFF0C;&#x6700;&#x91CD;&#x8981;&#x7684;&#x5DE5;&#x4F5C;&#x5C31;&#x662F;&#x4FC3;&#x8FDB;&#x8FD9;&#x4E9B;&#x5C06;&#x6765;&#x7684;&#x6269;&#x5C55;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5C3D;&#x7BA1;&#x60A8;&#x7684;&#x4EE3;&#x7801;&#x5F53;&#x7136;&#x5FC5;&#x987B;&#x5DE5;&#x4F5C;&#xFF0C;&#x4F46;&#x60A8;&#x4E0D;&#x5E94;&#x5C06;&#x201C;&#x5DE5;&#x4F5C;&#x4EE3;&#x7801;&#x201D;&#x89C6;&#x4E3A;&#x4E3B;&#x8981;&#x76EE;&#x6807;&#x3002;&#x60A8;&#x7684;&#x4E3B;&#x8981;&#x76EE;&#x6807;&#x5FC5;&#x987B;&#x662F;&#x5236;&#x4F5C;&#x51FA;&#x51FA;&#x8272;&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x5E76;&#x4E14;&#x8FD9;&#x79CD;&#x8BBE;&#x8BA1;&#x4E5F;&#x4F1A;&#x8D77;&#x4F5C;&#x7528;&#x3002;&#x8FD9;&#x662F;&#x6218;&#x7565;&#x8BA1;&#x5212;&#x3002;</p>
<p>&#x6218;&#x7565;&#x6027;&#x7F16;&#x7A0B;&#x9700;&#x8981;&#x4E00;&#x79CD;&#x6295;&#x8D44;&#x5FC3;&#x6001;&#x3002;&#x60A8;&#x5FC5;&#x987B;&#x82B1;&#x8D39;&#x65F6;&#x95F4;&#x6765;&#x6539;&#x8FDB;&#x7CFB;&#x7EDF;&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x91C7;&#x53D6;&#x6700;&#x5FEB;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x5B8C;&#x6210;&#x5F53;&#x524D;&#x7684;&#x9879;&#x76EE;&#x3002;&#x8FD9;&#x4E9B;&#x6295;&#x8D44;&#x4F1A;&#x5728;&#x77ED;&#x671F;&#x5185;&#x8BA9;&#x60A8;&#x653E;&#x6162;&#x811A;&#x6B65;&#xFF0C;&#x4F46;&#x4ECE;&#x957F;&#x8FDC;&#x6765;&#x770B;&#x4F1A;&#x52A0;&#x5FEB;&#x60A8;&#x7684;&#x901F;&#x5EA6;&#xFF0C;&#x5982;&#x56FE; 3.1 &#x6240;&#x793A;&#x3002;</p>
<p>&#x4E00;&#x4E9B;&#x6295;&#x8D44;&#x5C06;&#x662F;&#x79EF;&#x6781;&#x7684;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x503C;&#x5F97;&#x82B1;&#x4E00;&#x4E9B;&#x65F6;&#x95F4;&#x4E3A;&#x6BCF;&#x4E2A;&#x65B0;&#x7C7B;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x8BBE;&#x8BA1;&#x3002;&#x800C;&#x4E0D;&#x662F;&#x5B9E;&#x65BD;&#x60F3;&#x5230;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x60F3;&#x6CD5;&#xFF0C;&#x8BF7;&#x5C1D;&#x8BD5;&#x51E0;&#x79CD;&#x66FF;&#x4EE3;&#x8BBE;&#x8BA1;&#x5E76;&#x9009;&#x62E9;&#x6700;&#x7B80;&#x6D01;&#x7684;&#x8BBE;&#x8BA1;&#x3002;&#x8BD5;&#x60F3;&#x4E00;&#x4E0B;&#x5C06;&#x6765;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x66F4;&#x6539;&#x7CFB;&#x7EDF;&#x7684;&#x51E0;&#x79CD;&#x65B9;&#x5F0F;&#xFF0C;&#x5E76;&#x786E;&#x4FDD;&#x8BBE;&#x8BA1;&#x5BB9;&#x6613;&#x3002;&#x7F16;&#x5199;&#x597D;&#x7684;&#x6587;&#x6863;&#x662F;&#x4E3B;&#x52A8;&#x6295;&#x8D44;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x3002;</p>
<p>&#x5176;&#x4ED6;&#x6295;&#x8D44;&#x5C06;&#x662F;&#x88AB;&#x52A8;&#x7684;&#x3002;&#x65E0;&#x8BBA;&#x60A8;&#x9884;&#x5148;&#x6295;&#x5165;&#x591A;&#x5C11;&#xFF0C;&#x8BBE;&#x8BA1;&#x51B3;&#x7B56;&#x4E2D;&#x90FD;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#x5730;&#x4F1A;&#x51FA;&#x73B0;&#x9519;&#x8BEF;&#x3002;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x6D41;&#x901D;&#xFF0C;&#x8FD9;&#x4E9B;&#x9519;&#x8BEF;&#x5C06;&#x53D8;&#x5F97;&#x663E;&#x800C;&#x6613;&#x89C1;&#x3002;&#x53D1;&#x73B0;&#x8BBE;&#x8BA1;&#x95EE;&#x9898;&#x65F6;&#xFF0C;&#x4E0D;&#x8981;&#x53EA;&#x662F;&#x5FFD;&#x7565;&#x5B83;&#x6216;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x4FEE;&#x8865;&#x3002;&#x82B1;&#x4E00;&#x4E9B;&#x989D;&#x5916;&#x7684;&#x65F6;&#x95F4;&#x6765;&#x4FEE;&#x590D;&#x5B83;&#x3002;&#x5982;&#x679C;&#x60A8;&#x8FDB;&#x884C;&#x6218;&#x7565;&#x6027;&#x7F16;&#x7A0B;&#xFF0C;&#x5219;&#x5C06;&#x4E0D;&#x65AD;&#x5BF9;&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;&#x8FDB;&#x884C;&#x5C0F;&#x5E45;&#x6539;&#x8FDB;&#x3002;&#x8FD9;&#x4E0E;&#x6218;&#x672F;&#x7F16;&#x7A0B;&#x76F8;&#x53CD;&#xFF0C;&#x5728;&#x6218;&#x672F;&#x7F16;&#x7A0B;&#x4E2D;&#xFF0C;&#x60A8;&#x4E0D;&#x65AD;&#x589E;&#x52A0;&#x4E00;&#x4E9B;&#x590D;&#x6742;&#x6027;&#xFF0C;&#x8FD9;&#x4E9B;&#x590D;&#x6742;&#x6027;&#x5C06;&#x6765;&#x4F1A;&#x5F15;&#x8D77;&#x95EE;&#x9898;&#x3002;</p>
<h2 id="33-&#x6295;&#x8D44;&#x591A;&#x5C11;&#xFF1F;">3.3 &#x6295;&#x8D44;&#x591A;&#x5C11;&#xFF1F;</h2>
<p>&#x90A3;&#x4E48;&#xFF0C;&#x6B63;&#x786E;&#x7684;&#x6295;&#x8D44;&#x989D;&#x662F;&#x591A;&#x5C11;&#xFF1F;&#x5927;&#x91CF;&#x7684;&#x524D;&#x671F;&#x6295;&#x8D44;&#xFF08;&#x4F8B;&#x5982;&#x5C1D;&#x8BD5;&#x8BBE;&#x8BA1;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#xFF09;&#x5C06;&#x4E0D;&#x4F1A;&#x6709;&#x6548;&#x3002;&#x8FD9;&#x662F;&#x7011;&#x5E03;&#x65B9;&#x6CD5;&#xFF0C;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x5B83;&#x4E0D;&#x8D77;&#x4F5C;&#x7528;&#x3002;&#x968F;&#x7740;&#x60A8;&#x5BF9;&#x7CFB;&#x7EDF;&#x7684;&#x4E86;&#x89E3;&#xFF0C;&#x7406;&#x60F3;&#x7684;&#x8BBE;&#x8BA1;&#x8D8B;&#x4E8E;&#x96F6;&#x788E;&#x51FA;&#x73B0;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6700;&#x597D;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x8FDE;&#x7EED;&#x8FDB;&#x884C;&#x5927;&#x91CF;&#x5C0F;&#x989D;&#x6295;&#x8D44; &#x200B;&#x200B;&#x3002;&#x6211;&#x5EFA;&#x8BAE;&#x60A8;&#x5C06;&#x603B;&#x5F00;&#x53D1;&#x65F6;&#x95F4;&#x7684; 10&#xFF05;&#x5230; 20&#xFF05;&#x7528;&#x4E8E;&#x6295;&#x8D44;&#x3002;&#x8BE5;&#x91D1;&#x989D;&#x8DB3;&#x591F;&#x5C0F;&#xFF0C;&#x4E0D;&#x4F1A;&#x5BF9;&#x60A8;&#x7684;&#x65E5;&#x7A0B;&#x5B89;&#x6392;&#x4EA7;&#x751F;&#x91CD;&#x5927;&#x5F71;&#x54CD;&#xFF0C;&#x4F46;&#x53C8;&#x8DB3;&#x591F;&#x5927;&#xFF0C;&#x53EF;&#x4EE5;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x63A8;&#x79FB;&#x4EA7;&#x751F;&#x91CD;&#x5927;&#x6536;&#x76CA;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x60A8;&#x7684;&#x521D;&#x59CB;&#x9879;&#x76EE;&#x5C06;&#x6BD4;&#x7EAF;&#x6218;&#x672F;&#x65B9;&#x6CD5;&#x82B1;&#x8D39; 10-20&#xFF05;&#x7684;&#x65F6;&#x95F4;&#x3002;&#x989D;&#x5916;&#x7684;&#x65F6;&#x95F4;&#x5C06;&#x5E26;&#x6765;&#x66F4;&#x597D;&#x7684;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#xFF0C;&#x5E76;&#x4E14;&#x60A8;&#x5C06;&#x5728;&#x51E0;&#x4E2A;&#x6708;&#x5185;&#x5F00;&#x59CB;&#x4F53;&#x9A8C;&#x5230;&#x8FD9;&#x4E9B;&#x597D;&#x5904;&#x3002;&#x4E0D;&#x4E45;&#x4E4B;&#x540E;&#xFF0C;&#x60A8;&#x7684;&#x5F00;&#x53D1;&#x901F;&#x5EA6;&#x5C06;&#x6BD4;&#x6218;&#x672F;&#x7F16;&#x7A0B;&#x5FEB;&#x81F3;&#x5C11; 10&#x2013;20&#xFF05;&#x3002;&#x5728;&#x8FD9;&#x4E00;&#x70B9;&#x4E0A;&#xFF0C;&#x60A8;&#x7684;&#x6295;&#x8D44;&#x5C06;&#x514D;&#x8D39;&#xFF1A;&#x60A8;&#x8FC7;&#x53BB;&#x6295;&#x8D44;&#x7684;&#x6536;&#x76CA;&#x5C06;&#x8282;&#x7701;&#x8DB3;&#x591F;&#x7684;&#x65F6;&#x95F4;&#x6765;&#x652F;&#x4ED8;&#x672A;&#x6765;&#x6295;&#x8D44;&#x7684;&#x8D39;&#x7528;&#x3002;&#x60A8;&#x5C06;&#x8FC5;&#x901F;&#x6536;&#x56DE;&#x521D;&#x59CB;&#x6295;&#x8D44;&#x7684;&#x6210;&#x672C;&#x3002;&#x56FE; 3.1 &#x8BF4;&#x660E;&#x4E86;&#x8FD9;&#x79CD;&#x73B0;&#x8C61;&#x3002;
<img src="https://s1.ax1x.com/2020/07/03/NvkcJe.png" alt="NvkcJe.png"></p>
<blockquote>
<p>&#x56FE; 3.1&#xFF1A;&#x4E00;&#x5F00;&#x59CB;&#xFF0C;&#x6218;&#x672F;&#x6027;&#x7684;&#x7F16;&#x7A0B;&#x65B9;&#x6CD5;&#x5C06;&#x6BD4;&#x6218;&#x7565;&#x6027;&#x65B9;&#x6CD5;&#x66F4;&#x5FEB;&#x5730;&#x53D6;&#x5F97;&#x8FDB;&#x5C55;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5728;&#x6218;&#x672F;&#x65B9;&#x6CD5;&#x4E0B;&#xFF0C;&#x590D;&#x6742;&#x6027;&#x79EF;&#x7D2F;&#x5F97;&#x66F4;&#x5FEB;&#xFF0C;&#x4ECE;&#x800C;&#x964D;&#x4F4E;&#x4E86;&#x751F;&#x4EA7;&#x7387;&#x3002;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x6D41;&#x901D;&#xFF0C;&#x6218;&#x7565;&#x65B9;&#x9488;&#x4F1A;&#x5E26;&#x6765;&#x66F4;&#x5927;&#x7684;&#x8FDB;&#x6B65;&#x3002;&#x6CE8;&#x610F;&#xFF1A;&#x6B64;&#x56FE;&#x4EC5;&#x7528;&#x4E8E;&#x5B9A;&#x6027;&#x8BF4;&#x660E;&#xFF1B;&#x6211;&#x4E0D;&#x77E5;&#x9053;&#x5BF9;&#x66F2;&#x7EBF;&#x7CBE;&#x786E;&#x5F62;&#x72B6;&#x7684;&#x4EFB;&#x4F55;&#x7ECF;&#x9A8C;&#x6D4B;&#x91CF;&#x3002;</p>
</blockquote>
<p>&#x76F8;&#x53CD;&#xFF0C;&#x5982;&#x679C;&#x60A8;&#x8FDB;&#x884C;&#x6218;&#x672F;&#x7F16;&#x7A0B;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x5C06;&#x7B2C;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x5B8C;&#x6210;&#x7684;&#x901F;&#x5EA6;&#x63D0;&#x9AD8; 10&#xFF05;&#x5230; 20&#xFF05;&#xFF0C;&#x4F46;&#x662F;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x63A8;&#x79FB;&#xFF0C;&#x590D;&#x6742;&#x6027;&#x7684;&#x7D2F;&#x79EF;&#x4F1A;&#x964D;&#x4F4E;&#x5F00;&#x53D1;&#x901F;&#x5EA6;&#x3002;&#x4E0D;&#x4E45;&#x4E4B;&#x540E;&#xFF0C;&#x60A8;&#x7684;&#x7F16;&#x7A0B;&#x901F;&#x5EA6;&#x81F3;&#x5C11;&#x4F1A;&#x964D;&#x4F4E; 10&#x2013;20&#xFF05;&#x3002;&#x60A8;&#x5C06;&#x5F88;&#x5FEB;&#x9000;&#x56DE;&#x5728;&#x5F00;&#x59CB;&#x65F6;&#x4FDD;&#x5B58;&#x7684;&#x6240;&#x6709;&#x65F6;&#x95F4;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x7CFB;&#x7EDF;&#x7684;&#x6574;&#x4E2A;&#x751F;&#x547D;&#x5468;&#x671F;&#x4E2D;&#xFF0C;&#x4E0E;&#x91C7;&#x7528;&#x7B56;&#x7565;&#x6027;&#x65B9;&#x6CD5;&#x76F8;&#x6BD4;&#xFF0C;&#x60A8;&#x7684;&#x5F00;&#x53D1;&#x901F;&#x5EA6;&#x5C06;&#x66F4;&#x52A0;&#x7F13;&#x6162;&#x3002;&#x5982;&#x679C;&#x60A8;&#x4ECE;&#x672A;&#x4F7F;&#x7528;&#x8FC7;&#x4E25;&#x91CD;&#x964D;&#x7EA7;&#x7684;&#x4EE3;&#x7801;&#x5E93;&#xFF0C;&#x8BF7;&#x4E0E;&#x6709;&#x7ECF;&#x9A8C;&#x7684;&#x4EBA;&#x8054;&#x7CFB;&#x3002;&#x4ED6;&#x4EEC;&#x4F1A;&#x544A;&#x8BC9;&#x60A8;&#x4E0D;&#x826F;&#x7684;&#x4EE3;&#x7801;&#x8D28;&#x91CF;&#x4F1A;&#x4F7F;&#x5F00;&#x53D1;&#x901F;&#x5EA6;&#x81F3;&#x5C11;&#x964D;&#x4F4E; 20&#xFF05;</p>
<h2 id="34-&#x521B;&#x4E1A;&#x4E0E;&#x6295;&#x8D44;">3.4 &#x521B;&#x4E1A;&#x4E0E;&#x6295;&#x8D44;</h2>
<p>&#x5728;&#x67D0;&#x4E9B;&#x73AF;&#x5883;&#x4E2D;&#xFF0C;&#x5F3A;&#x5927;&#x7684;&#x529B;&#x91CF;&#x4E0E;&#x6218;&#x7565;&#x65B9;&#x6CD5;&#x80CC;&#x9053;&#x800C;&#x9A70;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x65E9;&#x671F;&#x7684;&#x521D;&#x521B;&#x516C;&#x53F8;&#x611F;&#x5230;&#x5DE8;&#x5927;&#x7684;&#x538B;&#x529B;&#xFF0C;&#x9700;&#x8981;&#x5C3D;&#x5FEB;&#x53D1;&#x5E03;&#x5176;&#x65E9;&#x671F;&#x7248;&#x672C;&#x3002;&#x5728;&#x8FD9;&#x4E9B;&#x516C;&#x53F8;&#x4E2D;&#xFF0C;&#x751A;&#x81F3; 10&#xFF05;&#x81F3; 20&#xFF05;&#x7684;&#x6295;&#x8D44;&#x4F3C;&#x4E4E;&#x4E5F;&#x8D1F;&#x62C5;&#x4E0D;&#x8D77;&#x3002;&#x7ED3;&#x679C;&#xFF0C;&#x8BB8;&#x591A;&#x521D;&#x521B;&#x516C;&#x53F8;&#x91C7;&#x53D6;&#x4E86;&#x6218;&#x672F;&#x6027;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5728;&#x8BBE;&#x8BA1;&#x4E0A;&#x82B1;&#x8D39;&#x4E86;&#x5F88;&#x5C11;&#x7684;&#x7CBE;&#x529B;&#xFF0C;&#x800C;&#x5728;&#x95EE;&#x9898;&#x51FA;&#x73B0;&#x65F6;&#x5219;&#x82B1;&#x8D39;&#x4E86;&#x66F4;&#x5C11;&#x7684;&#x7CBE;&#x529B;&#x8FDB;&#x884C;&#x6E05;&#x7406;&#x3002;&#x4ED6;&#x4EEC;&#x8BA4;&#x4E3A;&#xFF0C;&#x5982;&#x679C;&#x6210;&#x529F;&#xFF0C;&#x4ED6;&#x4EEC;&#x5C06;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x94B1;&#x8058;&#x8BF7;&#x989D;&#x5916;&#x7684;&#x5DE5;&#x7A0B;&#x5E08;&#x6765;&#x6E05;&#x7406;&#x95EE;&#x9898;&#xFF0C;&#x4ECE;&#x800C;&#x4F7F;&#x5176;&#x5408;&#x7406;&#x5316;&#x3002;</p>
<p>&#x5982;&#x679C;&#x60A8;&#x662F;&#x4E00;&#x5BB6;&#x671D;&#x7740;&#x8FD9;&#x4E2A;&#x65B9;&#x5411;&#x53D1;&#x5C55;&#x7684;&#x516C;&#x53F8;&#xFF0C;&#x5219;&#x5E94;&#x8BE5;&#x610F;&#x8BC6;&#x5230;&#xFF0C;&#x4E00;&#x65E6;&#x4EE3;&#x7801;&#x5E93;&#x53D8;&#x6210;&#x4E86;&#x610F;&#x5927;&#x5229;&#x9762;&#x6761;&#xFF0C;&#x51E0;&#x4E4E;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x4FEE;&#x590D;&#x7684;&#x3002;&#x60A8;&#x53EF;&#x80FD;&#x4F1A;&#x4E3A;&#x4EA7;&#x54C1;&#x7684;&#x4F7F;&#x7528;&#x5BFF;&#x547D;&#x4ED8;&#x51FA;&#x9AD8;&#x6602;&#x7684;&#x5F00;&#x53D1;&#x6210;&#x672C;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x597D;&#x7684;&#xFF08;&#x6216;&#x574F;&#x7684;&#xFF09;&#x8BBE;&#x8BA1;&#x7684;&#x56DE;&#x62A5;&#x5F88;&#x5FEB;&#x5C31;&#x4F1A;&#x5230;&#x6765;&#xFF0C;&#x56E0;&#x6B64;&#x6218;&#x672F;&#x65B9;&#x6CD5;&#x5F88;&#x6709;&#x53EF;&#x80FD;&#x751A;&#x81F3;&#x4E0D;&#x4F1A;&#x52A0;&#x5FEB;&#x60A8;&#x7684;&#x9996;&#x4E2A;&#x4EA7;&#x54C1;&#x53D1;&#x5E03;&#x7684;&#x901F;&#x5EA6;&#x3002;</p>
<p>&#x8981;&#x8003;&#x8651;&#x7684;&#x53E6;&#x4E00;&#x4EF6;&#x4E8B;&#x662F;&#xFF0C;&#x516C;&#x53F8;&#x6210;&#x529F;&#x7684;&#x6700;&#x91CD;&#x8981;&#x56E0;&#x7D20;&#x4E4B;&#x4E00;&#x5C31;&#x662F;&#x5DE5;&#x7A0B;&#x5E08;&#x7684;&#x7D20;&#x8D28;&#x3002;&#x964D;&#x4F4E;&#x5F00;&#x53D1;&#x6210;&#x672C;&#x7684;&#x6700;&#x4F73;&#x65B9;&#x6CD5;&#x662F;&#x8058;&#x8BF7;&#x4F18;&#x79C0;&#x7684;&#x5DE5;&#x7A0B;&#x5E08;&#xFF1A;&#x4ED6;&#x4EEC;&#x7684;&#x6210;&#x672C;&#x4E0D;&#x4F1A;&#x6BD4;&#x666E;&#x901A;&#x5DE5;&#x7A0B;&#x5E08;&#x9AD8;&#x5F88;&#x591A;&#xFF0C;&#x4F46;&#x751F;&#x4EA7;&#x7387;&#x5374;&#x9AD8;&#x5F97;&#x591A;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x6700;&#x597D;&#x7684;&#x5DE5;&#x7A0B;&#x5E08;&#x5BF9;&#x826F;&#x597D;&#x7684;&#x8BBE;&#x8BA1;&#x6DF1;&#x611F;&#x5174;&#x8DA3;&#x3002;&#x5982;&#x679C;&#x60A8;&#x7684;&#x4EE3;&#x7801;&#x5E93;&#x5F88;&#x6B8B;&#x9177;&#xFF0C;&#x90A3;&#x4E48;&#x5355;&#x8BCD;&#x4F1A;&#x53D8;&#x5F97;&#x6BEB;&#x65E0;&#x7528;&#x5904;&#xFF0C;&#x8FD9;&#x5C06;&#x4F7F;&#x60A8;&#x96BE;&#x4EE5;&#x62DB;&#x52DF;&#x3002;&#x7ED3;&#x679C;&#xFF0C;&#x60A8;&#x6700;&#x7EC8;&#x53EF;&#x80FD;&#x4F1A;&#x9047;&#x5230;&#x666E;&#x901A;&#x7684;&#x5DE5;&#x7A0B;&#x5E08;&#x3002;&#x8FD9;&#x5C06;&#x589E;&#x52A0;&#x60A8;&#x7684;&#x672A;&#x6765;&#x6210;&#x672C;&#xFF0C;&#x5E76;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x7CFB;&#x7EDF;&#x7ED3;&#x6784;&#x8FDB;&#x4E00;&#x6B65;&#x9000;&#x5316;&#x3002;</p>
<p>Facebook &#x662F;&#x4E00;&#x4E2A;&#x9F13;&#x52B1;&#x6218;&#x672F;&#x7F16;&#x7A0B;&#x7684;&#x521B;&#x4E1A;&#x516C;&#x53F8;&#x7684;&#x4F8B;&#x5B50;&#x3002;&#x591A;&#x5E74;&#x6765;&#xFF0C;&#x516C;&#x53F8;&#x7684;&#x5EA7;&#x53F3;&#x94ED;&#x662F;&#x201C;&#x5FEB;&#x901F;&#x884C;&#x52A8;&#x5E76;&#x6253;&#x7834;&#x56F0;&#x5883;&#x201D;&#x3002;&#x9F13;&#x52B1;&#x521A;&#x5927;&#x5B66;&#x6BD5;&#x4E1A;&#x7684;&#x65B0;&#x5DE5;&#x7A0B;&#x5E08;&#x7ACB;&#x5373;&#x6DF1;&#x5165;&#x516C;&#x53F8;&#x7684;&#x4EE3;&#x7801;&#x5E93;&#xFF1B;&#x5DE5;&#x7A0B;&#x5E08;&#x5728;&#x5DE5;&#x4F5C;&#x7684;&#x7B2C;&#x4E00;&#x5468;&#x5C06;&#x627F;&#x8BFA;&#x6295;&#x5165;&#x751F;&#x4EA7;&#x662F;&#x5F88;&#x6B63;&#x5E38;&#x7684;&#x3002;&#x4ECE;&#x79EF;&#x6781;&#x7684;&#x4E00;&#x9762;&#x6765;&#x770B;&#xFF0C;Facebook &#x4F5C;&#x4E3A;&#x4E00;&#x5BB6;&#x8D4B;&#x4E88;&#x5458;&#x5DE5;&#x6743;&#x529B;&#x7684;&#x516C;&#x53F8;&#x800C;&#x4EAB;&#x6709;&#x58F0;&#x8A89;&#x3002;&#x5DE5;&#x7A0B;&#x5E08;&#x62E5;&#x6709;&#x6781;&#x5927;&#x7684;&#x81EA;&#x7531;&#x5EA6;&#xFF0C;&#x5E76;&#x4E14;&#x51E0;&#x4E4E;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x89C4;&#x5219;&#x548C;&#x9650;&#x5236;&#x3002;</p>
<p>Facebook &#x4F5C;&#x4E3A;&#x4E00;&#x5BB6;&#x516C;&#x53F8;&#x5DF2;&#x7ECF;&#x53D6;&#x5F97;&#x4E86;&#x4EE4;&#x4EBA;&#x77A9;&#x76EE;&#x7684;&#x6210;&#x529F;&#xFF0C;&#x4F46;&#x662F;&#x7531;&#x4E8E;&#x8BE5;&#x516C;&#x53F8;&#x7684;&#x6218;&#x672F;&#x65B9;&#x6CD5;&#xFF0C;&#x5176;&#x4EE3;&#x7801;&#x5E93;&#x53D7;&#x5230;&#x4E86;&#x5F71;&#x54CD;&#x3002;&#x8BB8;&#x591A;&#x4EE3;&#x7801;&#x4E0D;&#x7A33;&#x5B9A;&#x4E14;&#x96BE;&#x4EE5;&#x7406;&#x89E3;&#xFF0C;&#x51E0;&#x4E4E;&#x6CA1;&#x6709;&#x6CE8;&#x91CA;&#x6216;&#x6D4B;&#x8BD5;&#xFF0C;&#x5E76;&#x4E14;&#x4F7F;&#x7528;&#x8D77;&#x6765;&#x5F88;&#x75DB;&#x82E6;&#x3002;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x6D41;&#x901D;&#xFF0C;&#x8BE5;&#x516C;&#x53F8;&#x610F;&#x8BC6;&#x5230;&#x5176;&#x6587;&#x5316;&#x662F;&#x4E0D;&#x53EF;&#x6301;&#x7EED;&#x7684;&#x3002;&#x6700;&#x7EC8;&#xFF0C;Facebook &#x6539;&#x53D8;&#x4E86;&#x5EA7;&#x53F3;&#x94ED;&#xFF0C;&#x5373;&#x201C;&#x4EE5;&#x575A;&#x5B9E;&#x7684;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x5FEB;&#x901F;&#x79FB;&#x52A8;&#x201D;&#xFF0C;&#x4EE5;&#x9F13;&#x52B1;&#x5176;&#x5DE5;&#x7A0B;&#x5E08;&#x5728;&#x826F;&#x597D;&#x7684;&#x8BBE;&#x8BA1;&#x4E0A;&#x8FDB;&#x884C;&#x66F4;&#x591A;&#x7684;&#x6295;&#x8D44;&#x3002;Facebook &#x662F;&#x5426;&#x80FD;&#x591F;&#x6210;&#x529F;&#x6E05;&#x9664;&#x591A;&#x5E74;&#x6765;&#x6218;&#x672F;&#x7F16;&#x7A0B;&#x4E2D;&#x79EF;&#x7D2F;&#x7684;&#x95EE;&#x9898;&#x8FD8;&#x6709;&#x5F85;&#x89C2;&#x5BDF;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x516C;&#x5E73;&#x8D77;&#x89C1;&#xFF0C;&#x6211;&#x5E94;&#x8BE5;&#x6307;&#x51FA;&#xFF0C;Facebook &#x7684;&#x4EE3;&#x7801;&#x53EF;&#x80FD;&#x5E76;&#x4E0D;&#x6BD4;&#x521D;&#x521B;&#x516C;&#x53F8;&#x7684;&#x5E73;&#x5747;&#x6C34;&#x5E73;&#x5DEE;&#x5F88;&#x591A;&#x3002;&#x6218;&#x672F;&#x7F16;&#x7A0B;&#x5728;&#x521D;&#x521B;&#x4F01;&#x4E1A;&#x4E2D;&#x53F8;&#x7A7A;&#x89C1;&#x60EF;&#x3002;Facebook &#x6070;&#x597D;&#x662F;&#x4E00;&#x4E2A;&#x7279;&#x522B;&#x660E;&#x663E;&#x7684;&#x4F8B;&#x5B50;&#x3002;</p>
<p>&#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;&#x901A;&#x8FC7;&#x6218;&#x7565;&#x65B9;&#x6CD5;&#x4E5F;&#x6709;&#x53EF;&#x80FD;&#x5728;&#x7845;&#x8C37;&#x53D6;&#x5F97;&#x6210;&#x529F;&#x3002;Google &#x548C; VMware &#x4E0E; Facebook &#x5DEE;&#x4E0D;&#x591A;&#x540C;&#x65F6;&#x6210;&#x957F;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x4E24;&#x5BB6;&#x516C;&#x53F8;&#x90FD;&#x91C7;&#x7528;&#x4E86;&#x66F4;&#x5177;&#x6218;&#x7565;&#x610F;&#x4E49;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x4E24;&#x5BB6;&#x516C;&#x53F8;&#x90FD;&#x975E;&#x5E38;&#x91CD;&#x89C6;&#x9AD8;&#x8D28;&#x91CF;&#x7684;&#x4EE3;&#x7801;&#x548C;&#x826F;&#x597D;&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x5E76;&#x4E14;&#x4E24;&#x5BB6;&#x516C;&#x53F8;&#x90FD;&#x5F00;&#x53D1;&#x4E86;&#x590D;&#x6742;&#x7684;&#x4EA7;&#x54C1;&#xFF0C;&#x8FD9;&#x4E9B;&#x4EA7;&#x54C1;&#x901A;&#x8FC7;&#x53EF;&#x9760;&#x7684;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x89E3;&#x51B3;&#x4E86;&#x590D;&#x6742;&#x7684;&#x95EE;&#x9898;&#x3002;&#x516C;&#x53F8;&#x7684;&#x5F3A;&#x5927;&#x6280;&#x672F;&#x6587;&#x5316;&#x5728;&#x7845;&#x8C37;&#x5E7F;&#x4E3A;&#x4EBA;&#x77E5;&#x3002;&#x5F88;&#x5C11;&#x6709;&#x5176;&#x4ED6;&#x516C;&#x53F8;&#x53EF;&#x4EE5;&#x4E0E;&#x4ED6;&#x4EEC;&#x7ADE;&#x4E89;&#x8058;&#x8BF7;&#x9876;&#x7EA7;&#x6280;&#x672F;&#x4EBA;&#x624D;&#x3002;</p>
<p>&#x8FD9;&#x4E9B;&#x4F8B;&#x5B50;&#x8868;&#x660E;&#xFF0C;&#x4E00;&#x5BB6;&#x516C;&#x53F8;&#x53EF;&#x4EE5;&#x6210;&#x529F;&#x4F7F;&#x7528;&#x4EFB;&#x4F55;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5728;&#x4E00;&#x5BB6;&#x5173;&#x5FC3;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x5E76;&#x62E5;&#x6709;&#x6E05;&#x6670;&#x4EE3;&#x7801;&#x57FA;&#x7840;&#x7684;&#x516C;&#x53F8;&#x4E2D;&#x5DE5;&#x4F5C;&#x4F1A;&#x6709;&#x8DA3;&#x5F97;&#x591A;&#x3002;</p>
<h2 id="35-&#x7ED3;&#x8BBA;">3.5 &#x7ED3;&#x8BBA;</h2>
<p>&#x597D;&#x7684;&#x8BBE;&#x8BA1;&#x4E0D;&#x662F;&#x514D;&#x8D39;&#x7684;&#x3002;&#x5B83;&#x5FC5;&#x987B;&#x662F;&#x60A8;&#x4E0D;&#x65AD;&#x6295;&#x8D44;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x8FD9;&#x6837;&#x5C0F;&#x95EE;&#x9898;&#x624D;&#x4E0D;&#x4F1A;&#x7D2F;&#x79EF;&#x6210;&#x5927;&#x95EE;&#x9898;&#x3002;&#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;&#x597D;&#x7684;&#x8BBE;&#x8BA1;&#x6700;&#x7EC8;&#x4F1A;&#x6536;&#x56DE;&#x6210;&#x672C;&#xFF0C;&#x800C;&#x4E14;&#x6BD4;&#x60A8;&#x60F3;&#x8C61;&#x7684;&#x8981;&#x65E9;&#x3002;</p>
<p>&#x59CB;&#x7EC8;&#x5982;&#x4E00;&#x5730;&#x8FD0;&#x7528;&#x6218;&#x7565;&#x65B9;&#x6CD5;&#x5E76;&#x5C06;&#x6295;&#x8D44;&#x89C6;&#x4E3A;&#x4ECA;&#x5929;&#x800C;&#x4E0D;&#x662F;&#x660E;&#x5929;&#x8981;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x3002;&#x5F53;&#x60A8;&#x9677;&#x5165;&#x5371;&#x673A;&#x65F6;&#xFF0C;&#x5F88;&#x5BB9;&#x6613;&#x63A8;&#x8FDF;&#x6E05;&#x7406;&#xFF0C;&#x76F4;&#x5230;&#x5371;&#x673A;&#x7ED3;&#x675F;&#x4E4B;&#x540E;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x6E7F;&#x6ED1;&#x7684;&#x659C;&#x5761;&#x3002;&#x5728;&#x5F53;&#x524D;&#x7D27;&#x7F29;&#x4E4B;&#x540E;&#xFF0C;&#x51E0;&#x4E4E;&#x80AF;&#x5B9A;&#x4F1A;&#x518D;&#x51FA;&#x73B0;&#x4E00;&#x6B21;&#x3002;&#x4E00;&#x65E6;&#x5F00;&#x59CB;&#x5EF6;&#x8FDF;&#x8BBE;&#x8BA1;&#x6539;&#x8FDB;&#xFF0C;&#x5C31;&#x5F88;&#x5BB9;&#x6613;&#x4F7F;&#x5EF6;&#x8FDF;&#x6C38;&#x4E45;&#x5316;&#xFF0C;&#x5E76;&#x4F7F;&#x60A8;&#x7684;&#x6587;&#x5316;&#x9677;&#x5165;&#x6218;&#x672F;&#x65B9;&#x6CD5;&#x4E2D;&#x3002;&#x60A8;&#x7B49;&#x5F85;&#x89E3;&#x51B3;&#x8BBE;&#x8BA1;&#x95EE;&#x9898;&#x7684;&#x65F6;&#x95F4;&#x8D8A;&#x957F;&#xFF0C;&#x95EE;&#x9898;&#x5C31;&#x4F1A;&#x53D8;&#x5F97;&#x8D8A;&#x5927;&#xFF1B;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x4EE4;&#x4EBA;&#x751F;&#x754F;&#xFF0C;&#x8FD9;&#x4F7F;&#x5F97;&#x8F7B;&#x677E;&#x63A8;&#x8FDF;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x5BB9;&#x6613;&#x3002;&#x6700;&#x6709;&#x6548;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#xFF0C;&#x6BCF;&#x4F4D;&#x5DE5;&#x7A0B;&#x5E08;&#x90FD;&#x5BF9;&#x826F;&#x597D;&#x7684;&#x8BBE;&#x8BA1;&#x8FDB;&#x884C;&#x8FDE;&#x7EED;&#x7684;&#x5C11;&#x91CF;&#x6295;&#x8D44;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="ch2.html" class="navigation navigation-prev " aria-label="Previous page: 第二章：复杂性的本质">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="ch4.html" class="navigation navigation-next " aria-label="Next page: 第四章：模块应该是深的">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第三章：工作代码是不够的（战略与战术编程）","level":"1.6","depth":1,"next":{"title":"第四章：模块应该是深的","level":"1.7","depth":1,"path":"docs/ch4.md","ref":"./docs/ch4.md","articles":[]},"previous":{"title":"第二章：复杂性的本质","level":"1.5","depth":1,"path":"docs/ch2.md","ref":"./docs/ch2.md","articles":[]},"dir":"ltr"},"config":{"plugins":["back-to-top-button","expandable-chapters-small","page-toc-button","livereload"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"livereload":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"page-toc-button":{},"back-to-top-button":{},"expandable-chapters-small":{},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"John Ousterhout","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"软件设计哲学","language":"zh-hans","gitbook":"*","description":"书中讨论了软件设计的主题：如何将复杂的软件系统分解成可以相对独立实现的模块(如类和方法)"},"file":{"path":"docs/ch3.md","mtime":"2020-08-06T16:26:19.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-02-06T04:55:41.669Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-page-toc-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

