
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第四章：模块应该是深的 · 软件设计哲学</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="John Ousterhout">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-page-toc-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="ch5.html" />
    
    
    <link rel="prev" href="ch3.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    首页
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="preface">
            
                <span>
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="ch1.html">
            
                <a href="ch1.html">
            
                    
                    第一章：介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="ch2.html">
            
                <a href="ch2.html">
            
                    
                    第二章：复杂性的本质
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="ch3.html">
            
                <a href="ch3.html">
            
                    
                    第三章：工作代码是不够的（战略与战术编程）
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.7" data-path="ch4.html">
            
                <a href="ch4.html">
            
                    
                    第四章：模块应该是深的
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="ch5.html">
            
                <a href="ch5.html">
            
                    
                    第五章：信息隐藏(和泄露)
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="ch6.html">
            
                <a href="ch6.html">
            
                    
                    第六章：通用模块更深入
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="ch7.html">
            
                <a href="ch7.html">
            
                    
                    第七章: 不同的层，不同的抽象
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="ch8.html">
            
                <a href="ch8.html">
            
                    
                    第八章: 降低复杂性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="ch9.html">
            
                <a href="ch9.html">
            
                    
                    第九章: 在一起更好还是分开更好？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="ch10.html">
            
                <a href="ch10.html">
            
                    
                    第十章: 定义不存在的错误
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="ch11.html">
            
                <a href="ch11.html">
            
                    
                    第十一章: 设计它两次
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="ch12.html">
            
                <a href="ch12.html">
            
                    
                    第十二章: 为什么写注释？四个理由
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="ch13.html">
            
                <a href="ch13.html">
            
                    
                    第十三章: 注释应该描述代码中不明显的内容
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="ch14.html">
            
                <a href="ch14.html">
            
                    
                    第十四章: 选择的名字
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="ch15.html">
            
                <a href="ch15.html">
            
                    
                    第十五章: 先写注释
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="ch16.html">
            
                <a href="ch16.html">
            
                    
                    第十六章: 修改现有的代码
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.20" data-path="ch17.html">
            
                <a href="ch17.html">
            
                    
                    第十七章: 一致性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.21" data-path="ch18.html">
            
                <a href="ch18.html">
            
                    
                    第十八章: 代码应该是显而易见的
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.22" data-path="ch19.html">
            
                <a href="ch19.html">
            
                    
                    第十九章: 软件发展趋势
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.23" data-path="ch20.html">
            
                <a href="ch20.html">
            
                    
                    第二十章: 设计性能
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.24" data-path="ch21.html">
            
                <a href="ch21.html">
            
                    
                    第二十一章: 结论
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.25" data-path="summary.html">
            
                <a href="summary.html">
            
                    
                    总结
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >第四章：模块应该是深的</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7B2C;&#x56DB;&#x7AE0;&#xFF1A;&#x6A21;&#x5757;&#x5E94;&#x8BE5;&#x662F;&#x6DF1;&#x7684;">&#x7B2C;&#x56DB;&#x7AE0;&#xFF1A;&#x6A21;&#x5757;&#x5E94;&#x8BE5;&#x662F;&#x6DF1;&#x7684;</h1>
<p>&#x7BA1;&#x7406;&#x8F6F;&#x4EF6;&#x590D;&#x6742;&#x6027;&#x6700;&#x91CD;&#x8981;&#x7684;&#x6280;&#x672F;&#x4E4B;&#x4E00;&#x5C31;&#x662F;&#x8BBE;&#x8BA1;&#x7CFB;&#x7EDF;&#xFF0C;&#x4EE5;&#x4FBF;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5728;&#x4EFB;&#x4F55;&#x7ED9;&#x5B9A;&#x65F6;&#x95F4;&#x53EA;&#x9700;&#x8981;&#x9762;&#x5BF9;&#x6574;&#x4F53;&#x590D;&#x6742;&#x6027;&#x7684;&#x4E00;&#x5C0F;&#x90E8;&#x5206;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x79F0;&#x4E3A;&#x6A21;&#x5757;&#x5316;&#x8BBE;&#x8BA1;&#xFF0C;&#x672C;&#x7AE0;&#x4ECB;&#x7ECD;&#x5176;&#x57FA;&#x672C;&#x539F;&#x7406;&#x3002;</p>
<h4 id="41-&#x6A21;&#x5757;&#x5316;&#x8BBE;&#x8BA1;">4.1 &#x6A21;&#x5757;&#x5316;&#x8BBE;&#x8BA1;</h4>
<p>&#x5728;&#x6A21;&#x5757;&#x5316;&#x8BBE;&#x8BA1;&#x4E2D;&#xFF0C;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x88AB;&#x5206;&#x89E3;&#x4E3A;&#x76F8;&#x5BF9;&#x72EC;&#x7ACB;&#x7684;&#x6A21;&#x5757;&#x96C6;&#x5408;&#x3002;&#x6A21;&#x5757;&#x53EF;&#x4EE5;&#x91C7;&#x7528;&#x591A;&#x79CD;&#x5F62;&#x5F0F;&#xFF0C;&#x4F8B;&#x5982;&#x7C7B;&#xFF0C;&#x5B50;&#x7CFB;&#x7EDF;&#x6216;&#x670D;&#x52A1;&#x3002;&#x5728;&#x7406;&#x60F3;&#x7684;&#x4E16;&#x754C;&#x4E2D;&#xFF0C;&#x6BCF;&#x4E2A;&#x6A21;&#x5757;&#x90FD;&#x5C06;&#x5B8C;&#x5168;&#x72EC;&#x7ACB;&#x4E8E;&#x5176;&#x4ED6;&#x6A21;&#x5757;&#xFF1A;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x53EF;&#x4EE5;&#x5728;&#x4EFB;&#x4F55;&#x6A21;&#x5757;&#x4E2D;&#x5DE5;&#x4F5C;&#xFF0C;&#x800C;&#x65E0;&#x9700;&#x4E86;&#x89E3;&#x4EFB;&#x4F55;&#x5176;&#x4ED6;&#x6A21;&#x5757;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E0A;&#xFF0C;&#x7CFB;&#x7EDF;&#x7684;&#x590D;&#x6742;&#x6027;&#x5C31;&#x662F;&#x6700;&#x7CDF;&#x7CD5;&#x7684;&#x6A21;&#x5757;&#x7684;&#x590D;&#x6742;&#x6027;&#x3002;</p>
<p>&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x8FD9;&#x79CD;&#x7406;&#x60F3;&#x662F;&#x65E0;&#x6CD5;&#x5B9E;&#x73B0;&#x7684;&#x3002;&#x6A21;&#x5757;&#x5FC5;&#x987B;&#x901A;&#x8FC7;&#x8C03;&#x7528;&#x5F7C;&#x6B64;&#x7684;&#x51FD;&#x6570;&#x6216;&#x65B9;&#x6CD5;&#x6765;&#x534F;&#x540C;&#x5DE5;&#x4F5C;&#x3002;&#x7ED3;&#x679C;&#xFF0C;&#x6A21;&#x5757;&#x5FC5;&#x987B;&#x76F8;&#x4E92;&#x4E86;&#x89E3;&#x3002;&#x6A21;&#x5757;&#x4E4B;&#x95F4;&#x5C06;&#x5B58;&#x5728;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#xFF1A;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x6A21;&#x5757;&#x53D1;&#x751F;&#x66F4;&#x6539;&#xFF0C;&#x5219;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x66F4;&#x6539;&#x5176;&#x4ED6;&#x6A21;&#x5757;&#x4EE5;&#x8FDB;&#x884C;&#x5339;&#x914D;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x65B9;&#x6CD5;&#x7684;&#x53C2;&#x6570;&#x5728;&#x65B9;&#x6CD5;&#x4E0E;&#x8C03;&#x7528;&#x8BE5;&#x65B9;&#x6CD5;&#x7684;&#x4EFB;&#x4F55;&#x4EE3;&#x7801;&#x4E4B;&#x95F4;&#x521B;&#x5EFA;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x3002;&#x5982;&#x679C;&#x5FC5;&#x9700;&#x7684;&#x53C2;&#x6570;&#x66F4;&#x6539;&#xFF0C;&#x5219;&#x5FC5;&#x987B;&#x4FEE;&#x6539;&#x8BE5;&#x65B9;&#x6CD5;&#x7684;&#x6240;&#x6709;&#x8C03;&#x7528;&#x4EE5;&#x7B26;&#x5408;&#x65B0;&#x7684;&#x7B7E;&#x540D;&#x3002;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x53EF;&#x4EE5;&#x91C7;&#x7528;&#x8BB8;&#x591A;&#x5176;&#x4ED6;&#x5F62;&#x5F0F;&#xFF0C;&#x5E76;&#x4E14;&#x5B83;&#x4EEC;&#x53EF;&#x80FD;&#x975E;&#x5E38;&#x5FAE;&#x5999;&#x3002;&#x6A21;&#x5757;&#x5316;&#x8BBE;&#x8BA1;&#x7684;&#x76EE;&#x6807;&#x662F;&#x6700;&#x5927;&#x7A0B;&#x5EA6;&#x5730;&#x51CF;&#x5C11;&#x6A21;&#x5757;&#x4E4B;&#x95F4;&#x7684;&#x4F9D;&#x8D56;&#x6027;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x7BA1;&#x7406;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x6BCF;&#x4E2A;&#x6A21;&#x5757;&#x5206;&#x4E3A;&#x4E24;&#x4E2A;&#x90E8;&#x5206;&#xFF1A;&#x63A5;&#x53E3;&#x548C;&#x5B9E;&#x73B0;&#x3002;&#x63A5;&#x53E3;&#x5305;&#x542B;&#x4F7F;&#x7528;&#x5176;&#x4ED6;&#x6A21;&#x5757;&#x7684;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5FC5;&#x987B;&#x77E5;&#x9053;&#x7684;&#x6240;&#x6709;&#x5185;&#x5BB9;&#xFF0C;&#x624D;&#x80FD;&#x4F7F;&#x7528;&#x7ED9;&#x5B9A;&#x7684;&#x6A21;&#x5757;&#x3002;&#x901A;&#x5E38;&#xFF0C;&#x63A5;&#x53E3;&#x63CF;&#x8FF0;&#x6A21;&#x5757;&#x505A;&#x4EC0;&#x4E48;&#xFF0C;&#x800C;&#x4E0D;&#x63CF;&#x8FF0;&#x6A21;&#x5757;&#x5982;&#x4F55;&#x505A;&#x3002;&#x8BE5;&#x5B9E;&#x73B0;&#x7531;&#x6267;&#x884C;&#x63A5;&#x53E3;&#x6240;&#x627F;&#x8BFA;&#x7684;&#x4EE3;&#x7801;&#x7EC4;&#x6210;&#x3002;&#x5728;&#x7279;&#x5B9A;&#x6A21;&#x5757;&#x4E2D;&#x5DE5;&#x4F5C;&#x7684;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5FC5;&#x987B;&#x4E86;&#x89E3;&#x8BE5;&#x6A21;&#x5757;&#x7684;&#x63A5;&#x53E3;&#x548C;&#x5B9E;&#x73B0;&#xFF0C;&#x4EE5;&#x53CA;&#x7531;&#x7ED9;&#x5B9A;&#x6A21;&#x5757;&#x8C03;&#x7528;&#x7684;&#x4EFB;&#x4F55;&#x5176;&#x4ED6;&#x6A21;&#x5757;&#x7684;&#x63A5;&#x53E3;&#x3002;&#x9664;&#x4E86;&#x6B63;&#x5728;&#x4F7F;&#x7528;&#x7684;&#x6A21;&#x5757;&#x4EE5;&#x5916;&#xFF0C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x65E0;&#x9700;&#x4E86;&#x89E3;&#x5176;&#x4ED6;&#x6A21;&#x5757;&#x7684;&#x5B9E;&#x73B0;&#x3002;</p>
<p>&#x8003;&#x8651;&#x4E00;&#x4E2A;&#x5B9E;&#x73B0;&#x5E73;&#x8861;&#x6811;&#x7684;&#x6A21;&#x5757;&#x3002;&#x8BE5;&#x6A21;&#x5757;&#x53EF;&#x80FD;&#x5305;&#x542B;&#x590D;&#x6742;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;&#x6811;&#x4FDD;&#x6301;&#x5E73;&#x8861;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x6B64;&#x590D;&#x6742;&#x6027;&#x5BF9;&#x4E8E;&#x6A21;&#x5757;&#x7528;&#x6237;&#x800C;&#x8A00;&#x662F;&#x4E0D;&#x53EF;&#x89C1;&#x7684;&#x3002;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x4E00;&#x4E2A;&#x76F8;&#x5BF9;&#x7B80;&#x5355;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x7528;&#x4E8E;&#x8C03;&#x7528;&#x5728;&#x6811;&#x4E2D;&#x63D2;&#x5165;&#xFF0C;&#x5220;&#x9664;&#x548C;&#x83B7;&#x53D6;&#x8282;&#x70B9;&#x7684;&#x64CD;&#x4F5C;&#x3002;&#x8981;&#x8C03;&#x7528;&#x63D2;&#x5165;&#x64CD;&#x4F5C;&#xFF0C;&#x8C03;&#x7528;&#x8005;&#x53EA;&#x9700;&#x63D0;&#x4F9B;&#x65B0;&#x8282;&#x70B9;&#x7684;&#x952E;&#x548C;&#x503C;&#x5373;&#x53EF;&#x3002;&#x904D;&#x5386;&#x6811;&#x548C;&#x62C6;&#x5206;&#x8282;&#x70B9;&#x7684;&#x673A;&#x5236;&#x5728;&#x63A5;&#x53E3;&#x4E2D;&#x4E0D;&#x53EF;&#x89C1;&#x3002;</p>
<p>&#x5C31;&#x672C;&#x4E66;&#x800C;&#x8A00;&#xFF0C;&#x6A21;&#x5757;&#x662F;&#x5177;&#x6709;&#x63A5;&#x53E3;&#x548C;&#x5B9E;&#x73B0;&#x7684;&#x4EFB;&#x4F55;&#x4EE3;&#x7801;&#x5355;&#x5143;&#x3002;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x7C7B;&#x90FD;&#x662F;&#x4E00;&#x4E2A;&#x6A21;&#x5757;&#x3002;&#x7C7B;&#x4E2D;&#x7684;&#x65B9;&#x6CD5;&#x6216;&#x975E;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x8BED;&#x8A00;&#x4E2D;&#x7684;&#x51FD;&#x6570;&#x4E5F;&#x53EF;&#x4EE5;&#x89C6;&#x4E3A;&#x6A21;&#x5757;&#xFF1A;&#x6BCF;&#x4E2A;&#x6A21;&#x5757;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x63A5;&#x53E3;&#x548C;&#x4E00;&#x4E2A;&#x5B9E;&#x73B0;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x5C06;&#x6A21;&#x5757;&#x5316;&#x8BBE;&#x8BA1;&#x6280;&#x672F;&#x5E94;&#x7528;&#x4E8E;&#x5B83;&#x4EEC;&#x3002;&#x66F4;&#x9AD8;&#x7EA7;&#x522B;&#x7684;&#x5B50;&#x7CFB;&#x7EDF;&#x548C;&#x670D;&#x52A1;&#x4E5F;&#x662F;&#x6A21;&#x5757;&#x3002;&#x5B83;&#x4EEC;&#x7684;&#x63A5;&#x53E3;&#x53EF;&#x80FD;&#x91C7;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x5F62;&#x5F0F;&#xFF0C;&#x4F8B;&#x5982;&#x5185;&#x6838;&#x8C03;&#x7528;&#x6216; HTTP &#x8BF7;&#x6C42;&#x3002;&#x672C;&#x4E66;&#x4E2D;&#x6709;&#x5173;&#x6A21;&#x5757;&#x5316;&#x8BBE;&#x8BA1;&#x7684;&#x8BB8;&#x591A;&#x8BA8;&#x8BBA;&#x90FD;&#x96C6;&#x4E2D;&#x5728;&#x8BBE;&#x8BA1;&#x7C7B;&#x4E0A;&#xFF0C;&#x4F46;&#x662F;&#x6280;&#x672F;&#x548C;&#x6982;&#x5FF5;&#x4E5F;&#x9002;&#x7528;&#x4E8E;&#x5176;&#x4ED6;&#x79CD;&#x7C7B;&#x7684;&#x6A21;&#x5757;&#x3002;</p>
<p>&#x6700;&#x597D;&#x7684;&#x6A21;&#x5757;&#x662F;&#x90A3;&#x4E9B;&#x5176;&#x63A5;&#x53E3;&#x6BD4;&#x5176;&#x5B9E;&#x73B0;&#x7B80;&#x5355;&#x5F97;&#x591A;&#x7684;&#x6A21;&#x5757;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x6A21;&#x5757;&#x5177;&#x6709;&#x4E24;&#x4E2A;&#x4F18;&#x70B9;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x63A5;&#x53E3;&#x53EF;&#x4EE5;&#x5C06;&#x6A21;&#x5757;&#x5F3A;&#x52A0;&#x4E8E;&#x7CFB;&#x7EDF;&#x5176;&#x4F59;&#x90E8;&#x5206;&#x7684;&#x590D;&#x6742;&#x6027;&#x964D;&#x81F3;&#x6700;&#x4F4E;&#x3002;&#x5176;&#x6B21;&#xFF0C;&#x5982;&#x679C;&#x4EE5;&#x4E0D;&#x66F4;&#x6539;&#x5176;&#x63A5;&#x53E3;&#x7684;&#x65B9;&#x5F0F;&#x4FEE;&#x6539;&#x4E86;&#x4E00;&#x4E2A;&#x6A21;&#x5757;&#xFF0C;&#x5219;&#x8BE5;&#x4FEE;&#x6539;&#x4E0D;&#x4F1A;&#x5F71;&#x54CD;&#x5176;&#x4ED6;&#x6A21;&#x5757;&#x3002;&#x5982;&#x679C;&#x6A21;&#x5757;&#x7684;&#x63A5;&#x53E3;&#x6BD4;&#x5176;&#x5B9E;&#x73B0;&#x7B80;&#x5355;&#x5F97;&#x591A;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x5F71;&#x54CD;&#x5176;&#x4ED6;&#x6A21;&#x5757;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x66F4;&#x6539;&#x6A21;&#x5757;&#x7684;&#x8BB8;&#x591A;&#x65B9;&#x9762;&#x3002;</p>
<h4 id="42-&#x63A5;&#x53E3;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;">4.2 &#x63A5;&#x53E3;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;</h4>
<p>&#x6A21;&#x5757;&#x7684;&#x63A5;&#x53E3;&#x5305;&#x542B;&#x4E24;&#x79CD;&#x4FE1;&#x606F;&#xFF1A;&#x6B63;&#x5F0F;&#x4FE1;&#x606F;&#x548C;&#x975E;&#x6B63;&#x5F0F;&#x4FE1;&#x606F;&#x3002;&#x63A5;&#x53E3;&#x7684;&#x5F62;&#x5F0F;&#x90E8;&#x5206;&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#x660E;&#x786E;&#x6307;&#x5B9A;&#xFF0C;&#x5E76;&#x4E14;&#x5176;&#x4E2D;&#x4E00;&#x4E9B;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x68C0;&#x67E5;&#x5176;&#x6B63;&#x786E;&#x6027;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x65B9;&#x6CD5;&#x7684;&#x5F62;&#x5F0F;&#x63A5;&#x53E3;&#x662F;&#x5176;&#x7B7E;&#x540D;&#xFF0C;&#x5176;&#x4E2D;&#x5305;&#x62EC;&#x5176;&#x53C2;&#x6570;&#x7684;&#x540D;&#x79F0;&#x548C;&#x7C7B;&#x578B;&#xFF0C;&#x5176;&#x8FD4;&#x56DE;&#x503C;&#x7684;&#x7C7B;&#x578B;&#x4EE5;&#x53CA;&#x6709;&#x5173;&#x8BE5;&#x65B9;&#x6CD5;&#x5F15;&#x53D1;&#x7684;&#x5F02;&#x5E38;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x5927;&#x591A;&#x6570;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x90FD;&#x786E;&#x4FDD;&#x5BF9;&#x65B9;&#x6CD5;&#x7684;&#x6BCF;&#x6B21;&#x8C03;&#x7528;&#x90FD;&#x63D0;&#x4F9B;&#x6B63;&#x786E;&#x6570;&#x91CF;&#x548C;&#x7C7B;&#x578B;&#x7684;&#x53C2;&#x6570;&#x4EE5;&#x5339;&#x914D;&#x5176;&#x7B7E;&#x540D;&#x3002;&#x7C7B;&#x7684;&#x5F62;&#x5F0F;&#x63A5;&#x53E3;&#x5305;&#x62EC;&#x5176;&#x6240;&#x6709;&#x516C;&#x5171;&#x65B9;&#x6CD5;&#x7684;&#x7B7E;&#x540D;&#x4EE5;&#x53CA;&#x4EFB;&#x4F55;&#x516C;&#x5171;&#x53D8;&#x91CF;&#x7684;&#x540D;&#x79F0;&#x548C;&#x7C7B;&#x578B;&#x3002;</p>
<p>&#x6BCF;&#x4E2A;&#x63A5;&#x53E3;&#x8FD8;&#x5305;&#x62EC;&#x975E;&#x6B63;&#x5F0F;&#x5143;&#x7D20;&#x3002;&#x8FD9;&#x4E9B;&#x6CA1;&#x6709;&#x4EE5;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x6216;&#x6267;&#x884C;&#x7684;&#x65B9;&#x5F0F;&#x6307;&#x5B9A;&#x3002;&#x63A5;&#x53E3;&#x7684;&#x975E;&#x6B63;&#x5F0F;&#x90E8;&#x5206;&#x5305;&#x62EC;&#x5176;&#x9AD8;&#x7EA7;&#x884C;&#x4E3A;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x51FD;&#x6570;&#x5220;&#x9664;&#x7531;&#x5176;&#x53C2;&#x6570;&#x4E4B;&#x4E00;&#x547D;&#x540D;&#x7684;&#x6587;&#x4EF6;&#x7684;&#x4E8B;&#x5B9E;&#x3002;&#x5982;&#x679C;&#x5BF9;&#x7C7B;&#x7684;&#x4F7F;&#x7528;&#x5B58;&#x5728;&#x9650;&#x5236;&#xFF08;&#x4E5F;&#x8BB8;&#x5FC5;&#x987B;&#x5148;&#x8C03;&#x7528;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#xFF09;&#xFF0C;&#x5219;&#x8FD9;&#x4E9B;&#x7EA6;&#x675F;&#x4E5F;&#x662F;&#x7C7B;&#x63A5;&#x53E3;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;&#x901A;&#x5E38;&#xFF0C;&#x5982;&#x679C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x9700;&#x8981;&#x4E86;&#x89E3;&#x7279;&#x5B9A;&#x4FE1;&#x606F;&#x624D;&#x80FD;&#x4F7F;&#x7528;&#x6A21;&#x5757;&#xFF0C;&#x5219;&#x8BE5;&#x4FE1;&#x606F;&#x662F;&#x6A21;&#x5757;&#x63A5;&#x53E3;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;&#x63A5;&#x53E3;&#x7684;&#x975E;&#x6B63;&#x5F0F;&#x65B9;&#x9762;&#x53EA;&#x80FD;&#x4F7F;&#x7528;&#x6CE8;&#x91CA;&#x6765;&#x63CF;&#x8FF0;&#xFF0C;&#x800C;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E0D;&#x80FD;&#x786E;&#x4FDD;&#x63CF;&#x8FF0;&#x662F;&#x5B8C;&#x6574;&#x6216;&#x51C6;&#x786E;&#x7684;1&#x3002;&#x5BF9;&#x4E8E;&#x5927;&#x591A;&#x6570;&#x63A5;&#x53E3;&#xFF0C;&#x975E;&#x6B63;&#x5F0F;&#x65B9;&#x9762;&#x6BD4;&#x6B63;&#x5F0F;&#x65B9;&#x9762;&#x66F4;&#x5927;&#xFF0C;&#x66F4;&#x590D;&#x6742;&#x3002;</p>
<p>&#x660E;&#x786E;&#x6307;&#x5B9A;&#x63A5;&#x53E3;&#x7684;&#x597D;&#x5904;&#x4E4B;&#x4E00;&#x662F;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x51C6;&#x786E;&#x6307;&#x793A;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x4F7F;&#x7528;&#x5173;&#x8054;&#x6A21;&#x5757;&#x6240;&#x9700;&#x8981;&#x77E5;&#x9053;&#x7684;&#x5185;&#x5BB9;&#x3002;&#x8FD9;&#x6709;&#x52A9;&#x4E8E;&#x6D88;&#x9664;&#x7B2C; 2.2 &#x8282;&#x4E2D;&#x63CF;&#x8FF0;&#x7684;&#x201C;&#x672A;&#x77E5;&#x7684;&#x672A;&#x77E5;&#x201D;&#x95EE;&#x9898;&#x3002;</p>
<h4 id="43-&#x62BD;&#x8C61;">4.3 &#x62BD;&#x8C61;</h4>
<p>&#x672F;&#x8BED;&#x62BD;&#x8C61;&#x4E0E;&#x6A21;&#x5757;&#x5316;&#x8BBE;&#x8BA1;&#x7684;&#x601D;&#x60F3;&#x7D27;&#x5BC6;&#x76F8;&#x5173;&#x3002;&#x62BD;&#x8C61;&#x662F;&#x5B9E;&#x4F53;&#x7684;&#x7B80;&#x5316;&#x89C6;&#x56FE;&#xFF0C;&#x5176;&#x4E2D;&#x7701;&#x7565;&#x4E86;&#x4E0D;&#x91CD;&#x8981;&#x7684;&#x7EC6;&#x8282;&#x3002;&#x62BD;&#x8C61;&#x662F;&#x6709;&#x7528;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x4F7F;&#x6211;&#x4EEC;&#x66F4;&#x5BB9;&#x6613;&#x601D;&#x8003;&#x548C;&#x64CD;&#x7EB5;&#x590D;&#x6742;&#x7684;&#x4E8B;&#x7269;&#x3002;</p>
<p>&#x5728;&#x6A21;&#x5757;&#x5316;&#x7F16;&#x7A0B;&#x4E2D;&#xFF0C;&#x6BCF;&#x4E2A;&#x6A21;&#x5757;&#x4EE5;&#x5176;&#x63A5;&#x53E3;&#x7684;&#x5F62;&#x5F0F;&#x63D0;&#x4F9B;&#x62BD;&#x8C61;&#x3002;&#x8BE5;&#x63A5;&#x53E3;&#x63D0;&#x4F9B;&#x4E86;&#x6A21;&#x5757;&#x529F;&#x80FD;&#x7684;&#x7B80;&#x5316;&#x89C6;&#x56FE;&#xFF1B;&#x4ECE;&#x6A21;&#x5757;&#x62BD;&#x8C61;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x5B9E;&#x73B0;&#x7684;&#x7EC6;&#x8282;&#x5E76;&#x4E0D;&#x91CD;&#x8981;&#xFF0C;&#x56E0;&#x6B64;&#x5728;&#x63A5;&#x53E3;&#x4E2D;&#x5C06;&#x5176;&#x7701;&#x7565;&#x3002;</p>
<p>&#x5728;&#x62BD;&#x8C61;&#x7684;&#x5B9A;&#x4E49;&#x4E2D;&#xFF0C;&#x201C;&#x65E0;&#x5173;&#x7D27;&#x8981;&#x201D;&#x4E00;&#x8BCD;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x3002;&#x4ECE;&#x62BD;&#x8C61;&#x4E2D;&#x5FFD;&#x7565;&#x7684;&#x4E0D;&#x91CD;&#x8981;&#x7684;&#x7EC6;&#x8282;&#x8D8A;&#x591A;&#x8D8A;&#x597D;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x7EC6;&#x8282;&#x4E0D;&#x91CD;&#x8981;&#xFF0C;&#x5219;&#x53EA;&#x80FD;&#x5C06;&#x5176;&#x4ECE;&#x62BD;&#x8C61;&#x4E2D;&#x7701;&#x7565;&#x3002;&#x62BD;&#x8C61;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E24;&#x79CD;&#x65B9;&#x5F0F;&#x51FA;&#x9519;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x5305;&#x542B;&#x5E76;&#x975E;&#x771F;&#x6B63;&#x91CD;&#x8981;&#x7684;&#x7EC6;&#x8282;&#x3002;&#x5F53;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x53D1;&#x751F;&#x65F6;&#xFF0C;&#x5B83;&#x4F1A;&#x4F7F;&#x62BD;&#x8C61;&#x53D8;&#x5F97;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x590D;&#x6742;&#xFF0C;&#x4ECE;&#x800C;&#x589E;&#x52A0;&#x4E86;&#x4F7F;&#x7528;&#x62BD;&#x8C61;&#x7684;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x7684;&#x8BA4;&#x77E5;&#x8D1F;&#x62C5;&#x3002;&#x7B2C;&#x4E8C;&#x4E2A;&#x9519;&#x8BEF;&#x662F;&#x62BD;&#x8C61;&#x5FFD;&#x7565;&#x4E86;&#x771F;&#x6B63;&#x91CD;&#x8981;&#x7684;&#x7EC6;&#x8282;&#x3002;&#x8FD9;&#x5BFC;&#x81F4;&#x6A21;&#x7CCA;&#x4E0D;&#x6E05;&#xFF1A;&#x4EC5;&#x67E5;&#x770B;&#x62BD;&#x8C61;&#x7684;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5C06;&#x4E0D;&#x4F1A;&#x83B7;&#x5F97;&#x6B63;&#x786E;&#x4F7F;&#x7528;&#x62BD;&#x8C61;&#x6240;&#x9700;&#x7684;&#x5168;&#x90E8;&#x4FE1;&#x606F;&#x3002;&#x5FFD;&#x7565;&#x91CD;&#x8981;&#x7EC6;&#x8282;&#x7684;&#x62BD;&#x8C61;&#x662F;&#x9519;&#x8BEF;&#x7684;&#x62BD;&#x8C61;&#xFF1A;&#x5B83;&#x53EF;&#x80FD;&#x770B;&#x8D77;&#x6765;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x4F46;&#x5B9E;&#x9645;&#x4E0A;&#x5E76;&#x975E;&#x5982;&#x6B64;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x8003;&#x8651;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x3002;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x63D0;&#x4F9B;&#x7684;&#x62BD;&#x8C61;&#x7701;&#x7565;&#x4E86;&#x8BB8;&#x591A;&#x7EC6;&#x8282;&#xFF0C;&#x4F8B;&#x5982;&#x7528;&#x4E8E;&#x9009;&#x62E9;&#x5B58;&#x50A8;&#x8BBE;&#x5907;&#x4E0A;&#x7684;&#x54EA;&#x4E9B;&#x5757;&#x7528;&#x4E8E;&#x7ED9;&#x5B9A;&#x6587;&#x4EF6;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x7684;&#x673A;&#x5236;&#x3002;&#x8FD9;&#x4E9B;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#x5BF9;&#x4E8E;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x7528;&#x6237;&#x800C;&#x8A00;&#x5E76;&#x4E0D;&#x91CD;&#x8981;&#xFF08;&#x53EA;&#x8981;&#x7CFB;&#x7EDF;&#x63D0;&#x4F9B;&#x8DB3;&#x591F;&#x7684;&#x6027;&#x80FD;&#x5373;&#x53EF;&#xFF09;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x5B9E;&#x73B0;&#x7684;&#x4E00;&#x4E9B;&#x7EC6;&#x8282;&#x5BF9;&#x7528;&#x6237;&#x5F88;&#x91CD;&#x8981;&#x3002;&#x5927;&#x591A;&#x6570;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x5C06;&#x6570;&#x636E;&#x7F13;&#x5B58;&#x5728;&#x4E3B;&#x5185;&#x5B58;&#x4E2D;&#xFF0C;&#x5E76;&#x4E14;&#x5B83;&#x4EEC;&#x53EF;&#x80FD;&#x4F1A;&#x5EF6;&#x8FDF;&#x5C06;&#x65B0;&#x6570;&#x636E;&#x5199;&#x5165;&#x5B58;&#x50A8;&#x8BBE;&#x5907;&#x4EE5;&#x63D0;&#x9AD8;&#x6027;&#x80FD;&#x3002;&#x4E00;&#x4E9B;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF08;&#x4F8B;&#x5982;&#x6570;&#x636E;&#x5E93;&#xFF09;&#x9700;&#x8981;&#x786E;&#x5207;&#x5730;&#x77E5;&#x9053;&#x4F55;&#x65F6;&#x5C06;&#x6570;&#x636E;&#x5199;&#x5165;&#x5B58;&#x50A8;&#x8BBE;&#x5907;&#xFF0C;&#x56E0;&#x6B64;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x786E;&#x4FDD;&#x5728;&#x7CFB;&#x7EDF;&#x5D29;&#x6E83;&#x540E;&#x5C06;&#x4FDD;&#x7559;&#x6570;&#x636E;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5C06;&#x6570;&#x636E;&#x5237;&#x65B0;&#x5230;&#x8F85;&#x52A9;&#x5B58;&#x50A8;&#x7684;&#x89C4;&#x5219;&#x5FC5;&#x987B;&#x5728;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x63A5;&#x53E3;&#x4E2D;&#x53EF;&#x89C1;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x4E0D;&#x4EC5;&#x4F9D;&#x9760;&#x62BD;&#x8C61;&#x6765;&#x7BA1;&#x7406;&#x590D;&#x6742;&#x6027;&#xFF0C;&#x800C;&#x4E14;&#x4E0D;&#x4EC5;&#x5728;&#x7F16;&#x7A0B;&#x4E2D;&#xFF0C;&#x800C;&#x4E14;&#x5728;&#x65E5;&#x5E38;&#x751F;&#x6D3B;&#x4E2D;&#x65E0;&#x5904;&#x4E0D;&#x5728;&#x3002;&#x5FAE;&#x6CE2;&#x7089;&#x5305;&#x542B;&#x590D;&#x6742;&#x7684;&#x7535;&#x5B50;&#x8BBE;&#x5907;&#xFF0C;&#x53EF;&#x5C06;&#x4EA4;&#x6D41;&#x7535;&#x8F6C;&#x6362;&#x4E3A;&#x5FAE;&#x6CE2;&#x8F90;&#x5C04;&#x5E76;&#x5C06;&#x8BE5;&#x8F90;&#x5C04;&#x5206;&#x5E03;&#x5230;&#x6574;&#x4E2A;&#x70F9;&#x996A;&#x8154;&#x4E2D;&#x3002;&#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;&#x7528;&#x6237;&#x770B;&#x5230;&#x4E86;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x5F97;&#x591A;&#x7684;&#x62BD;&#x8C61;&#xFF0C;&#x5B83;&#x7531;&#x51E0;&#x4E2A;&#x6309;&#x94AE;&#x63A7;&#x5236;&#x5FAE;&#x6CE2;&#x7684;&#x5B9A;&#x65F6;&#x548C;&#x5F3A;&#x5EA6;&#x3002;&#x6C7D;&#x8F66;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x79CD;&#x7B80;&#x5355;&#x7684;&#x62BD;&#x8C61;&#x6982;&#x5FF5;&#xFF0C;&#x4F7F;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x4E86;&#x89E3;&#x7535;&#x52A8;&#x673A;&#xFF0C;&#x7535;&#x6C60;&#x7535;&#x6E90;&#x7BA1;&#x7406;&#xFF0C;&#x9632;&#x62B1;&#x6B7B;&#x5236;&#x52A8;&#xFF0C;&#x5DE1;&#x822A;&#x63A7;&#x5236;&#x7B49;&#x673A;&#x5236;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x9A7E;&#x9A76;&#x5B83;&#x4EEC;&#x3002;</p>
<h4 id="43-&#x6DF1;&#x6A21;&#x5757;">4.3 &#x6DF1;&#x6A21;&#x5757;</h4>
<p>&#x6211;&#x4EEC;&#x4E0D;&#x4EC5;&#x4F9D;&#x9760;&#x62BD;&#x8C61;&#x6765;&#x7BA1;&#x7406;&#x590D;&#x6742;&#x6027;&#xFF0C;&#x800C;&#x4E14;&#x4E0D;&#x4EC5;&#x5728;&#x7F16;&#x7A0B;&#x4E2D;&#xFF0C;&#x800C;&#x4E14;&#x5728;&#x65E5;&#x5E38;&#x751F;&#x6D3B;&#x4E2D;&#x65E0;&#x5904;&#x4E0D;&#x5728;&#x3002;&#x5FAE;&#x6CE2;&#x7089;&#x5305;&#x542B;&#x590D;&#x6742;&#x7684;&#x7535;&#x5B50;&#x8BBE;&#x5907;&#xFF0C;&#x53EF;&#x5C06;&#x4EA4;&#x6D41;&#x7535;&#x8F6C;&#x6362;&#x4E3A;&#x5FAE;&#x6CE2;&#x8F90;&#x5C04;&#x5E76;&#x5C06;&#x8BE5;&#x8F90;&#x5C04;&#x5206;&#x5E03;&#x5230;&#x6574;&#x4E2A;&#x70F9;&#x996A;&#x8154;&#x4E2D;&#x3002;&#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;&#x7528;&#x6237;&#x770B;&#x5230;&#x4E86;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x5F97;&#x591A;&#x7684;&#x62BD;&#x8C61;&#xFF0C;&#x5B83;&#x7531;&#x51E0;&#x4E2A;&#x6309;&#x94AE;&#x63A7;&#x5236;&#x5FAE;&#x6CE2;&#x7684;&#x5B9A;&#x65F6;&#x548C;&#x5F3A;&#x5EA6;&#x3002;&#x6C7D;&#x8F66;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x79CD;&#x7B80;&#x5355;&#x7684;&#x62BD;&#x8C61;&#x6982;&#x5FF5;&#xFF0C;&#x4F7F;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x4E86;&#x89E3;&#x7535;&#x52A8;&#x673A;&#xFF0C;&#x7535;&#x6C60;&#x7535;&#x6E90;&#x7BA1;&#x7406;&#xFF0C;&#x9632;&#x62B1;&#x6B7B;&#x5236;&#x52A8;&#xFF0C;&#x5DE1;&#x822A;&#x63A7;&#x5236;&#x7B49;&#x673A;&#x5236;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x9A7E;&#x9A76;&#x5B83;&#x4EEC;&#x3002;
<img src="https://s1.ax1x.com/2020/07/06/UFPsKS.png" alt="UFPsKS.png"></p>
<blockquote>
<p>&#x56FE; 4.1&#xFF1A;&#x6DF1;&#x6D45;&#x6A21;&#x5757;&#x3002;&#x6700;&#x597D;&#x7684;&#x6A21;&#x5757;&#x5F88;&#x6DF1;&#xFF1A;&#x5B83;&#x4EEC;&#x5141;&#x8BB8;&#x901A;&#x8FC7;&#x7B80;&#x5355;&#x7684;&#x63A5;&#x53E3;&#x8BBF;&#x95EE;&#x8BB8;&#x591A;&#x529F;&#x80FD;&#x3002;&#x6D45;&#x5C42;&#x6A21;&#x5757;&#x662F;&#x5177;&#x6709;&#x76F8;&#x5BF9;&#x590D;&#x6742;&#x7684;&#x63A5;&#x53E3;&#x7684;&#x6A21;&#x5757;&#xFF0C;&#x4F46;&#x529F;&#x80FD;&#x4E0D;&#x591A;&#xFF1A;&#x5B83;&#x4E0D;&#x4F1A;&#x63A9;&#x76D6;&#x592A;&#x591A;&#x7684;&#x590D;&#x6742;&#x6027;&#x3002;</p>
</blockquote>
<p>&#x6A21;&#x5757;&#x6DF1;&#x5EA6;&#x662F;&#x8003;&#x8651;&#x6210;&#x672C;&#x4E0E;&#x6536;&#x76CA;&#x7684;&#x4E00;&#x79CD;&#x65B9;&#x5F0F;&#x3002;&#x6A21;&#x5757;&#x63D0;&#x4F9B;&#x7684;&#x597D;&#x5904;&#x662F;&#x5176;&#x529F;&#x80FD;&#x3002;&#x6A21;&#x5757;&#x7684;&#x6210;&#x672C;&#xFF08;&#x5C31;&#x7CFB;&#x7EDF;&#x590D;&#x6742;&#x6027;&#x800C;&#x8A00;&#xFF09;&#x662F;&#x5176;&#x63A5;&#x53E3;&#x3002;&#x6A21;&#x5757;&#x7684;&#x63A5;&#x53E3;&#x4EE3;&#x8868;&#x4E86;&#x6A21;&#x5757;&#x5F3A;&#x52A0;&#x7ED9;&#x7CFB;&#x7EDF;&#x5176;&#x4F59;&#x90E8;&#x5206;&#x7684;&#x590D;&#x6742;&#x6027;&#xFF1A;&#x63A5;&#x53E3;&#x8D8A;&#x5C0F;&#x8D8A;&#x7B80;&#x5355;&#xFF0C;&#x5F15;&#x5165;&#x7684;&#x590D;&#x6742;&#x6027;&#x5C31;&#x8D8A;&#x5C0F;&#x3002;&#x6700;&#x597D;&#x7684;&#x6A21;&#x5757;&#x662F;&#x90A3;&#x4E9B;&#x6536;&#x76CA;&#x6700;&#x5927;&#xFF0C;&#x6210;&#x672C;&#x6700;&#x4F4E;&#x7684;&#x6A21;&#x5757;&#x3002;&#x63A5;&#x53E3;&#x4E0D;&#x9519;&#xFF0C;&#x4F46;&#x66F4;&#x591A;&#x6216;&#x66F4;&#x5927;&#x7684;&#x63A5;&#x53E3;&#x4E0D;&#x4E00;&#x5B9A;&#x66F4;&#x597D;&#xFF01;</p>
<p>Unix &#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x53CA;&#x5176;&#x540E;&#x4EE3;&#xFF08;&#x4F8B;&#x5982; Linux&#xFF09;&#x63D0;&#x4F9B;&#x7684;&#x6587;&#x4EF6; I/O &#x673A;&#x5236;&#x662F;&#x6DF1;&#x5C42;&#x63A5;&#x53E3;&#x7684;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x4F8B;&#x5B50;&#x3002;I/O &#x53EA;&#x6709;&#x4E94;&#x4E2A;&#x57FA;&#x672C;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#xFF0C;&#x5E26;&#x6709;&#x7B80;&#x5355;&#x7B7E;&#x540D;&#xFF1A;</p>
<pre><code>int open(const char* path, int flags, mode_t permissions);
ssize_t read(int fd, void* buffer, size_t count);
ssize_t write(int fd, const void* buffer, size_t count);
off_t lseek(int fd, off_t offset, int referencePosition);
int close(int fd);
</code></pre><p>&#x5F00;&#x653E;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x91C7;&#x7528;&#x5206;&#x5C42;&#x6587;&#x4EF6;&#x540D;&#xFF0C;&#x4F8B;&#x5982;/ a / b / c&#xFF0C;&#x5E76;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x6574;&#x6570;&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26;&#xFF0C;&#x8BE5;&#x63CF;&#x8FF0;&#x7B26;&#x7528;&#x4E8E;&#x5F15;&#x7528;&#x6253;&#x5F00;&#x6587;&#x4EF6;&#x3002;open &#x7684;&#x5176;&#x4ED6;&#x81EA;&#x53D8;&#x91CF;&#x63D0;&#x4F9B;&#x53EF;&#x9009;&#x4FE1;&#x606F;&#xFF0C;&#x4F8B;&#x5982;&#x662F;&#x5426;&#x6B63;&#x5728;&#x6253;&#x5F00;&#x6587;&#x4EF6;&#x4EE5;&#x8FDB;&#x884C;&#x8BFB;&#x53D6;&#x6216;&#x5199;&#x5165;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x5B58;&#x5728;&#x73B0;&#x6709;&#x6587;&#x4EF6;&#x5219;&#x662F;&#x5426;&#x5E94;&#x521B;&#x5EFA;&#x65B0;&#x6587;&#x4EF6;&#xFF0C;&#x4EE5;&#x53CA;&#x5982;&#x679C;&#x521B;&#x5EFA;&#x65B0;&#x6587;&#x4EF6;&#x5219;&#x5177;&#x6709;&#x6587;&#x4EF6;&#x7684;&#x8BBF;&#x95EE;&#x6743;&#x9650;&#x3002;&#x8BFB;&#x5199;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5185;&#x5B58;&#x548C;&#x6587;&#x4EF6;&#x7684;&#x7F13;&#x51B2;&#x533A;&#x4E4B;&#x95F4;&#x4F20;&#x8F93;&#x4FE1;&#x606F;&#x3002;close &#x7ED3;&#x675F;&#x5BF9;&#x6587;&#x4EF6;&#x7684;&#x8BBF;&#x95EE;&#x3002;&#x5927;&#x591A;&#x6570;&#x6587;&#x4EF6;&#x662F;&#x6309;&#x987A;&#x5E8F;&#x8BBF;&#x95EE;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x8FD9;&#x662F;&#x9ED8;&#x8BA4;&#x8BBE;&#x7F6E;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8C03;&#x7528; lseek &#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x6765;&#x66F4;&#x6539;&#x5F53;&#x524D;&#x8BBF;&#x95EE;&#x4F4D;&#x7F6E;&#x6765;&#x5B9E;&#x73B0;&#x968F;&#x673A;&#x8BBF;&#x95EE;&#x3002;</p>
<p>Unix I/O &#x63A5;&#x53E3;&#x7684;&#x73B0;&#x4EE3;&#x5B9E;&#x73B0;&#x9700;&#x8981;&#x6210;&#x5343;&#x4E0A;&#x4E07;&#x884C;&#x4EE3;&#x7801;&#xFF0C;&#x8FD9;&#x4E9B;&#x4EE3;&#x7801;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x8BF8;&#x5982;&#x4EE5;&#x4E0B;&#x7684;&#x590D;&#x6742;&#x95EE;&#x9898;&#xFF1A;</p>
<ul>
<li>&#x5982;&#x4F55;&#x5728;&#x78C1;&#x76D8;&#x4E0A;&#x8868;&#x793A;&#x6587;&#x4EF6;&#x4EE5;&#x4FBF;&#x6709;&#x6548;&#x8BBF;&#x95EE;&#xFF1F;</li>
<li>&#x5982;&#x4F55;&#x5B58;&#x50A8;&#x76EE;&#x5F55;&#xFF0C;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x5904;&#x7406;&#x5206;&#x5C42;&#x8DEF;&#x5F84;&#x540D;&#x4EE5;&#x67E5;&#x627E;&#x5B83;&#x4EEC;&#x6240;&#x5F15;&#x7528;&#x7684;&#x6587;&#x4EF6;&#xFF1F;</li>
<li>&#x5982;&#x4F55;&#x5F3A;&#x5236;&#x6267;&#x884C;&#x6743;&#x9650;&#xFF0C;&#x4EE5;&#x4F7F;&#x4E00;&#x4E2A;&#x7528;&#x6237;&#x65E0;&#x6CD5;&#x4FEE;&#x6539;&#x6216;&#x5220;&#x9664;&#x53E6;&#x4E00;&#x7528;&#x6237;&#x7684;&#x6587;&#x4EF6;&#xFF1F;</li>
<li>&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x6587;&#x4EF6;&#x8BBF;&#x95EE;&#xFF1F;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x4F55;&#x5728;&#x4E2D;&#x65AD;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x548C;&#x540E;&#x53F0;&#x4EE3;&#x7801;&#x4E4B;&#x95F4;&#x5212;&#x5206;&#x529F;&#x80FD;&#xFF0C;&#x4EE5;&#x53CA;&#x8FD9;&#x4E24;&#x4E2A;&#x5143;&#x7D20;&#x5982;&#x4F55;&#x5B89;&#x5168;&#x901A;&#x4FE1;&#xFF1F;</li>
<li>&#x5728;&#x540C;&#x65F6;&#x8BBF;&#x95EE;&#x591A;&#x4E2A;&#x6587;&#x4EF6;&#x65F6;&#x4F7F;&#x7528;&#x4EC0;&#x4E48;&#x8C03;&#x5EA6;&#x7B56;&#x7565;&#xFF1F;</li>
<li>&#x5982;&#x4F55;&#x5C06;&#x6700;&#x8FD1;&#x8BBF;&#x95EE;&#x7684;&#x6587;&#x4EF6;&#x6570;&#x636E;&#x7F13;&#x5B58;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x4EE5;&#x51CF;&#x5C11;&#x78C1;&#x76D8;&#x8BBF;&#x95EE;&#x6B21;&#x6570;&#xFF1F;</li>
<li>&#x5982;&#x4F55;&#x5C06;&#x5404;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x8F85;&#x52A9;&#x5B58;&#x50A8;&#x8BBE;&#x5907;&#xFF08;&#x4F8B;&#x5982;&#x78C1;&#x76D8;&#x548C;&#x95EA;&#x5B58;&#x9A71;&#x52A8;&#x5668;&#xFF09;&#x5408;&#x5E76;&#x5230;&#x5355;&#x4E2A;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF1F;</li>
</ul>
<p>&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x4EE5;&#x53CA;&#x66F4;&#x591A;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x90FD;&#x7531; Unix &#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x5B9E;&#x73B0;&#x6765;&#x89E3;&#x51B3;&#x3002;&#x5BF9;&#x4E8E;&#x8C03;&#x7528;&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x6765;&#x8BF4;&#xFF0C;&#x5B83;&#x4EEC;&#x662F;&#x4E0D;&#x53EF;&#x89C1;&#x7684;&#x3002;&#x591A;&#x5E74;&#x6765;&#xFF0C;Unix I/O &#x63A5;&#x53E3;&#x7684;&#x5B9E;&#x73B0;&#x5DF2;&#x7ECF;&#x53D1;&#x751F;&#x4E86;&#x6839;&#x672C;&#x7684;&#x53D1;&#x5C55;&#xFF0C;&#x4F46;&#x662F;&#x4E94;&#x4E2A;&#x57FA;&#x672C;&#x5185;&#x6838;&#x8C03;&#x7528;&#x5E76;&#x6CA1;&#x6709;&#x6539;&#x53D8;&#x3002;</p>
<p>&#x6DF1;&#x5EA6;&#x6A21;&#x5757;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x793A;&#x4F8B;&#x662F;&#x8BF8;&#x5982; Go &#x6216; Java &#x4E4B;&#x7C7B;&#x7684;&#x8BED;&#x8A00;&#x4E2D;&#x7684;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x3002;&#x8FD9;&#x4E2A;&#x6A21;&#x5757;&#x6839;&#x672C;&#x6CA1;&#x6709;&#x63A5;&#x53E3;&#x3002;&#x5B83;&#x5728;&#x540E;&#x53F0;&#x8FDB;&#x884C;&#x9690;&#x5F62;&#x64CD;&#x4F5C;&#x4EE5;&#x56DE;&#x6536;&#x672A;&#x4F7F;&#x7528;&#x7684;&#x5185;&#x5B58;&#x3002;&#x7531;&#x4E8E;&#x5C06;&#x5783;&#x573E;&#x6536;&#x96C6;&#x6D88;&#x9664;&#x4E86;&#x7528;&#x4E8E;&#x91CA;&#x653E;&#x5BF9;&#x8C61;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x56E0;&#x6B64;&#x5411;&#x7CFB;&#x7EDF;&#x4E2D;&#x6DFB;&#x52A0;&#x5783;&#x573E;&#x56DE;&#x6536;&#x5B9E;&#x9645;&#x4E0A;&#x4F1A;&#x7F29;&#x5C0F;&#x5176;&#x603B;&#x4F53;&#x63A5;&#x53E3;&#x3002;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x7684;&#x5B9E;&#x73B0;&#x975E;&#x5E38;&#x590D;&#x6742;&#xFF0C;&#x4F46;&#x662F;&#x4F7F;&#x7528;&#x8BE5;&#x8BED;&#x8A00;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x65E0;&#x6CD5;&#x53D1;&#x73B0;&#x8FD9;&#x79CD;&#x590D;&#x6742;&#x6027;&#x3002;</p>
<p>&#x8BF8;&#x5982; Unix I/O &#x548C;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x4E4B;&#x7C7B;&#x7684;&#x6DF1;&#x5C42;&#x6A21;&#x5757;&#x63D0;&#x4F9B;&#x4E86;&#x5F3A;&#x5927;&#x7684;&#x62BD;&#x8C61;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x6613;&#x4E8E;&#x4F7F;&#x7528;&#xFF0C;&#x4F46;&#x9690;&#x85CF;&#x4E86;&#x5DE8;&#x5927;&#x7684;&#x5B9E;&#x73B0;&#x590D;&#x6742;&#x6027;&#x3002;</p>
<h4 id="45-&#x6D45;&#x6A21;&#x5757;">4.5 &#x6D45;&#x6A21;&#x5757;</h4>
<p>&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x6D45;&#x5C42;&#x6A21;&#x5757;&#x662F;&#x5176;&#x63A5;&#x53E3;&#x4E0E;&#x5176;&#x63D0;&#x4F9B;&#x7684;&#x529F;&#x80FD;&#x76F8;&#x6BD4;&#x76F8;&#x5BF9;&#x590D;&#x6742;&#x7684;&#x6A21;&#x5757;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5B9E;&#x73B0;&#x94FE;&#x8868;&#x7684;&#x7C7B;&#x5F88;&#x6D45;&#x3002;&#x64CD;&#x4F5C;&#x94FE;&#x8868;&#x4E0D;&#x9700;&#x8981;&#x592A;&#x591A;&#x4EE3;&#x7801;&#xFF08;&#x63D2;&#x5165;&#x6216;&#x5220;&#x9664;&#x5143;&#x7D20;&#x4EC5;&#x9700;&#x51E0;&#x884C;&#xFF09;&#xFF0C;&#x56E0;&#x6B64;&#x94FE;&#x8868;&#x62BD;&#x8C61;&#x4E0D;&#x4F1A;&#x9690;&#x85CF;&#x5F88;&#x591A;&#x7EC6;&#x8282;&#x3002;&#x94FE;&#x8868;&#x63A5;&#x53E3;&#x7684;&#x590D;&#x6742;&#x5EA6;&#x51E0;&#x4E4E;&#x4E0E;&#x5176;&#x5B9E;&#x73B0;&#x7684;&#x590D;&#x6742;&#x5EA6;&#x4E00;&#x6837;&#x9AD8;&#x3002;&#x6D45;&#x7C7B;&#x6709;&#x65F6;&#x662F;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x4EEC;&#x5728;&#x7BA1;&#x7406;&#x590D;&#x6742;&#x6027;&#x65B9;&#x9762;&#x6CA1;&#x6709;&#x63D0;&#x4F9B;&#x592A;&#x591A;&#x5E2E;&#x52A9;&#x3002;</p>
<p>&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x6D45;&#x5C42;&#x65B9;&#x6CD5;&#x7684;&#x6781;&#x7AEF;&#x793A;&#x4F8B;&#xFF0C;&#x8BE5;&#x6D45;&#x5C42;&#x65B9;&#x6CD5;&#x6765;&#x81EA;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x7C7B;&#x7684;&#x9879;&#x76EE;&#xFF1A;</p>
<pre><code>private void addNullValueForAttribute(String attribute) {
    data.put(attribute, null);
}
</code></pre><p>&#x4ECE;&#x7BA1;&#x7406;&#x590D;&#x6742;&#x6027;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x6B64;&#x65B9;&#x6CD5;&#x4F1A;&#x4F7F;&#x60C5;&#x51B5;&#x53D8;&#x5F97;&#x66F4;&#x7CDF;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x66F4;&#x597D;&#x3002;&#x8BE5;&#x65B9;&#x6CD5;&#x4E0D;&#x63D0;&#x4F9B;&#x4EFB;&#x4F55;&#x62BD;&#x8C61;&#xFF0C;&#x56E0;&#x4E3A;&#x5176;&#x6240;&#x6709;&#x529F;&#x80FD;&#x90FD;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5176;&#x63A5;&#x53E3;&#x770B;&#x5230;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x8C03;&#x7528;&#x8005;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x77E5;&#x9053;&#x8BE5;&#x5C5E;&#x6027;&#x5C06;&#x5B58;&#x50A8;&#x5728; data &#x53D8;&#x91CF;&#x4E2D;&#x3002;&#x8003;&#x8651;&#x63A5;&#x53E3;&#x5E76;&#x4E0D;&#x6BD4;&#x8003;&#x8651;&#x5B8C;&#x6574;&#x5B9E;&#x73B0;&#x7B80;&#x5355;&#x3002;&#x5982;&#x679C;&#x6B63;&#x786E;&#x8BB0;&#x5F55;&#x4E86;&#x8BE5;&#x65B9;&#x6CD5;&#xFF0C;&#x5219;&#x6587;&#x6863;&#x5C06;&#x6BD4;&#x8BE5;&#x65B9;&#x6CD5;&#x7684;&#x4EE3;&#x7801;&#x957F;&#x3002;&#x4E0E;&#x8C03;&#x7528;&#x65B9;&#x76F4;&#x63A5;&#x64CD;&#x4F5C;&#x6570;&#x636E;&#x53D8;&#x91CF;&#x76F8;&#x6BD4;&#xFF0C;&#x8C03;&#x7528;&#x8BE5;&#x65B9;&#x6CD5;&#x6240;&#x82B1;&#x8D39;&#x7684;&#x51FB;&#x952E;&#x751A;&#x81F3;&#x66F4;&#x591A;&#x3002;&#x8BE5;&#x65B9;&#x6CD5;&#x589E;&#x52A0;&#x4E86;&#x590D;&#x6742;&#x6027;&#xFF08;&#x4EE5;&#x4F9B;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5B66;&#x4E60;&#x7684;&#x65B0;&#x63A5;&#x53E3;&#x7684;&#x5F62;&#x5F0F;&#xFF09;&#xFF0C;&#x4F46;&#x6CA1;&#x6709;&#x63D0;&#x4F9B;&#x4EFB;&#x4F55;&#x8865;&#x507F;&#x3002;</p>
<p>&#x6D45;&#x5C42;&#x6A21;&#x5757;&#x662F;&#x4E00;&#x4E2A;&#x63A5;&#x53E3;&#x76F8;&#x5BF9;&#x4E8E;&#x5176;&#x63D0;&#x4F9B;&#x7684;&#x529F;&#x80FD;&#x800C;&#x8A00;&#x590D;&#x6742;&#x7684;&#x6A21;&#x5757;&#x3002;&#x6D45;&#x5C42;&#x6A21;&#x5757;&#x5728;&#x5BF9;&#x6297;&#x590D;&#x6742;&#x6027;&#x65B9;&#x9762;&#x65E0;&#x6D4E;&#x4E8E;&#x4E8B;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x63D0;&#x4F9B;&#x7684;&#x597D;&#x5904;&#xFF08;&#x4E0D;&#x5FC5;&#x4E86;&#x89E3;&#x5B83;&#x4EEC;&#x5728;&#x5185;&#x90E8;&#x5982;&#x4F55;&#x5DE5;&#x4F5C;&#xFF09;&#x88AB;&#x5B66;&#x4E60;&#x548C;&#x4F7F;&#x7528;&#x5176;&#x63A5;&#x53E3;&#x7684;&#x6210;&#x672C;&#x6240;&#x62B5;&#x6D88;&#x3002;&#x5C0F;&#x6A21;&#x5757;&#x5F80;&#x5F80;&#x5F88;&#x6D45;&#x3002;</p>
<h4 id="46-&#x7ECF;&#x5178;&#x4E3B;&#x4E49;">4.6 &#x7ECF;&#x5178;&#x4E3B;&#x4E49;</h4>
<p>&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x6DF1;&#x5EA6;&#x7C7B;&#x7684;&#x4EF7;&#x503C;&#x5728;&#x4ECA;&#x5929;&#x5E76;&#x672A;&#x5F97;&#x5230;&#x5E7F;&#x6CDB;&#x8BA4;&#x53EF;&#x3002;&#x7F16;&#x7A0B;&#x4E2D;&#x7684;&#x4F20;&#x7EDF;&#x89C2;&#x70B9;&#x662F;&#xFF0C;&#x7C7B;&#x5E94;&#x8BE5;&#x5C0F;&#x800C;&#x4E0D;&#x662F;&#x6DF1;&#x3002;&#x7ECF;&#x5E38;&#x544A;&#x8BC9;&#x5B66;&#x751F;&#xFF0C;&#x7C7B;&#x8BBE;&#x8BA1;&#x4E2D;&#x6700;&#x91CD;&#x8981;&#x7684;&#x4E8B;&#x60C5;&#x662F;&#x5C06;&#x8F83;&#x5927;&#x7684;&#x7C7B;&#x5206;&#x6210;&#x8F83;&#x5C0F;&#x7684;&#x7C7B;&#x3002;&#x5BF9;&#x4E8E;&#x65B9;&#x6CD5;&#xFF0C;&#x901A;&#x5E38;&#x4F1A;&#x7ED9;&#x51FA;&#x76F8;&#x540C;&#x7684;&#x5EFA;&#x8BAE;&#xFF1A;&#x201C;&#x4EFB;&#x4F55;&#x957F;&#x4E8E; N &#x884C;&#x7684;&#x65B9;&#x6CD5;&#x90FD;&#x5E94;&#x5206;&#x4E3A;&#x591A;&#x79CD;&#x65B9;&#x6CD5;&#x201D;&#xFF08;N &#x53EF;&#x4EE5;&#x4F4E;&#x81F3; 10&#xFF09;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x5BFC;&#x81F4;&#x4E86;&#x5927;&#x91CF;&#x7684;&#x6D45;&#x7C7B;&#x548C;&#x65B9;&#x6CD5;&#xFF0C;&#x8FD9;&#x589E;&#x52A0;&#x4E86;&#x6574;&#x4F53;&#x7CFB;&#x7EDF;&#x7684;&#x590D;&#x6742;&#x6027;&#x3002;</p>
<p>&#x201C;&#x7C7B;&#x5E94;&#x8BE5;&#x5C0F;&#x201D;&#x7684;&#x6781;&#x7AEF;&#x505A;&#x6CD5;&#x662F;&#x6211;&#x79F0;&#x4E4B;&#x4E3A;&#x201C;&#x7C7B;&#x708E;&#x201D;&#x7684;&#x7EFC;&#x5408;&#x75C7;&#xFF0C;&#x8FD9;&#x662F;&#x7531;&#x4E8E;&#x9519;&#x8BEF;&#x5730;&#x8BA4;&#x4E3A;&#x201C;&#x7C7B;&#x662F;&#x597D;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x7C7B;&#x8D8A;&#x591A;&#x8D8A;&#x597D;&#x201D;&#x3002;&#x5728;&#x906D;&#x53D7;&#x7C7B;&#x708E;&#x7684;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x9F13;&#x52B1;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x6700;&#x5C0F;&#x5316;&#x6BCF;&#x4E2A;&#x65B0;&#x7C7B;&#x7684;&#x529F;&#x80FD;&#xFF1A;&#x5982;&#x679C;&#x60A8;&#x60F3;&#x8981;&#x66F4;&#x591A;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x8BF7;&#x5F15;&#x5165;&#x66F4;&#x591A;&#x7684;&#x7C7B;&#x3002;&#x5206;&#x7C7B;&#x708E;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x4E2A;&#x522B;&#x5730;&#x7B80;&#x5355;&#x7684;&#x5206;&#x7C7B;&#xFF0C;&#x4F46;&#x662F;&#x5374;&#x589E;&#x52A0;&#x4E86;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x7684;&#x590D;&#x6742;&#x6027;&#x3002;&#x5C0F;&#x7C7B;&#x4E0D;&#x4F1A;&#x8D21;&#x732E;&#x592A;&#x591A;&#x529F;&#x80FD;&#xFF0C;&#x56E0;&#x6B64;&#x5FC5;&#x987B;&#x6709;&#x5F88;&#x591A;&#x5C0F;&#x7C7B;&#xFF0C;&#x6BCF;&#x4E2A;&#x5C0F;&#x7C7B;&#x90FD;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x63A5;&#x53E3;&#x3002;&#x8FD9;&#x4E9B;&#x63A5;&#x53E3;&#x7684;&#x7D2F;&#x79EF;&#x4F1A;&#x5728;&#x7CFB;&#x7EDF;&#x7EA7;&#x522B;&#x4EA7;&#x751F;&#x5DE8;&#x5927;&#x7684;&#x590D;&#x6742;&#x6027;&#x3002;&#x5C0F;&#x7C7B;&#x4E5F;&#x5BFC;&#x81F4;&#x5197;&#x957F;&#x7684;&#x7F16;&#x7A0B;&#x98CE;&#x683C;&#xFF0C;&#x8FD9;&#x662F;&#x7531;&#x4E8E;&#x6BCF;&#x4E2A;&#x7C7B;&#x90FD;&#x9700;&#x8981;&#x6837;&#x677F;&#x3002;</p>
<h4 id="47-java-and-unix-io-&#x793A;&#x4F8B;&#xFF1A;java-&#x548C;-unix-io">4.7 Java and Unix I/O &#x793A;&#x4F8B;&#xFF1A;Java &#x548C; Unix I/O</h4>
<p>&#x5982;&#x4ECA;&#xFF0C;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x5206;&#x7C7B;&#x75C5;&#x5B9E;&#x4F8B;&#x4E4B;&#x4E00;&#x662F; Java &#x7C7B;&#x5E93;&#x3002;Java &#x8BED;&#x8A00;&#x4E0D;&#x9700;&#x8981;&#x5F88;&#x591A;&#x5C0F;&#x7C7B;&#xFF0C;&#x4F46;&#x662F;&#x5206;&#x7C7B;&#x6587;&#x5316;&#x4F3C;&#x4E4E;&#x5DF2;&#x5728; Java &#x7F16;&#x7A0B;&#x793E;&#x533A;&#x4E2D;&#x624E;&#x6839;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x8981;&#x6253;&#x5F00;&#x6587;&#x4EF6;&#x4EE5;&#x4FBF;&#x4ECE;&#x6587;&#x4EF6;&#x4E2D;&#x8BFB;&#x53D6;&#x5E8F;&#x5217;&#x5316;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x5FC5;&#x987B;&#x521B;&#x5EFA;&#x4E09;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x5BF9;&#x8C61;&#xFF1A;</p>
<pre><code>FileInputStream fileStream = new FileInputStream(fileName);

BufferedInputStream bufferedStream = new BufferedInputStream(fileStream);

ObjectInputStream objectStream = new ObjectInputStream(bufferedStream);
</code></pre><p>FileInputStream &#x5BF9;&#x8C61;&#x4EC5;&#x63D0;&#x4F9B;&#x57FA;&#x672C;&#x7684; I/O&#xFF1A;&#x5B83;&#x4E0D;&#x80FD;&#x6267;&#x884C;&#x7F13;&#x51B2;&#x7684; I/O&#xFF0C;&#x4E5F;&#x4E0D;&#x80FD;&#x8BFB;&#x53D6;&#x6216;&#x5199;&#x5165;&#x5E8F;&#x5217;&#x5316;&#x7684;&#x5BF9;&#x8C61;&#x3002;BufferedInputStream &#x5BF9;&#x8C61;&#x5C06;&#x7F13;&#x51B2;&#x6DFB;&#x52A0;&#x5230; FileInputStream&#xFF0C;&#x800C; ObjectInputStream &#x6DFB;&#x52A0;&#x4E86;&#x8BFB;&#x53D6;&#x548C;&#x5199;&#x5165;&#x5E8F;&#x5217;&#x5316;&#x5BF9;&#x8C61;&#x7684;&#x529F;&#x80FD;&#x3002;&#x4E00;&#x65E6;&#x6587;&#x4EF6;&#x88AB;&#x6253;&#x5F00;&#xFF0C;&#x4E0A;&#x9762;&#x4EE3;&#x7801;&#x4E2D;&#x7684;&#x524D;&#x4E24;&#x4E2A;&#x5BF9;&#x8C61; fileStream &#x548C; bufferedStream &#x5C06;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x88AB;&#x4F7F;&#x7528;&#x3002;&#x4EE5;&#x540E;&#x7684;&#x6240;&#x6709;&#x64CD;&#x4F5C;&#x90FD;&#x4F7F;&#x7528; objectStream&#x3002;</p>
<p>&#x7279;&#x522B;&#x4EE4;&#x4EBA;&#x70E6;&#x607C;&#xFF08;&#x5E76;&#x4E14;&#x5BB9;&#x6613;&#x51FA;&#x9519;&#xFF09;&#x7684;&#x662F;&#xFF0C;&#x5FC5;&#x987B;&#x901A;&#x8FC7;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x7684; BufferedInputStream &#x5BF9;&#x8C61;&#x6765;&#x663E;&#x5F0F;&#x8BF7;&#x6C42;&#x7F13;&#x51B2;&#x3002;&#x5982;&#x679C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5FD8;&#x8BB0;&#x521B;&#x5EFA;&#x8BE5;&#x5BF9;&#x8C61;&#xFF0C;&#x5C06;&#x6CA1;&#x6709;&#x7F13;&#x51B2;&#xFF0C;&#x5E76;&#x4E14; I/O &#x5C06;&#x53D8;&#x6162;&#x3002;&#x4E5F;&#x8BB8; Java &#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x4F1A;&#x4E89;&#x8FA9;&#x8BF4;&#xFF0C;&#x5E76;&#x4E0D;&#x662F;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x5E0C;&#x671B;&#x5BF9;&#x6587;&#x4EF6; I/O &#x4F7F;&#x7528;&#x7F13;&#x51B2;&#xFF0C;&#x56E0;&#x6B64;&#x4E0D;&#x5E94;&#x5C06;&#x5176;&#x5185;&#x7F6E;&#x5230;&#x57FA;&#x672C;&#x673A;&#x5236;&#x4E2D;&#x3002;&#x4ED6;&#x4EEC;&#x53EF;&#x80FD;&#x4F1A;&#x4E89;&#x8FA9;&#x8BF4;&#xFF0C;&#x6700;&#x597D;&#x5206;&#x5F00;&#x4FDD;&#x6301;&#x7F13;&#x51B2;&#xFF0C;&#x4EE5;&#x4FBF;&#x4EBA;&#x4EEC;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x662F;&#x5426;&#x4F7F;&#x7528;&#x5B83;&#x3002;&#x63D0;&#x4F9B;&#x9009;&#x62E9;&#x662F;&#x597D;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x5E94;&#x8BE5;&#x8BBE;&#x8BA1;&#x63A5;&#x53E3;&#x4EE5;&#x4F7F;&#x5E38;&#x89C1;&#x60C5;&#x51B5;&#x5C3D;&#x53EF;&#x80FD;&#x7B80;&#x5355;&#xFF08;&#x8BF7;&#x53C2;&#x9605;&#x7B2C; 6 &#x9875;&#x7684;&#x516C;&#x5F0F;&#xFF09;&#x3002;&#x51E0;&#x4E4E;&#x6BCF;&#x4E2A;&#x6587;&#x4EF6; I/O &#x7528;&#x6237;&#x90FD;&#x5E0C;&#x671B;&#x7F13;&#x51B2;&#xFF0C;&#x56E0;&#x6B64;&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#x5E94;&#x63D0;&#x4F9B;&#x7F13;&#x51B2;&#x3002;&#x5BF9;&#x4E8E;&#x4E0D;&#x9700;&#x8981;&#x7F13;&#x51B2;&#x7684;&#x5C11;&#x6570;&#x60C5;&#x51B5;&#xFF0C;&#x8BE5;&#x5E93;&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;&#x4E00;&#x79CD;&#x7981;&#x7528;&#x5B83;&#x7684;&#x673A;&#x5236;&#x3002;</p>
<p>&#x76F8;&#x53CD;&#xFF0C;Unix &#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x7684;&#x8BBE;&#x8BA1;&#x8005;&#x4F7F;&#x5E38;&#x89C1;&#x60C5;&#x51B5;&#x53D8;&#x5F97;&#x7B80;&#x5355;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4ED6;&#x4EEC;&#x8BA4;&#x8BC6;&#x5230;&#x987A;&#x5E8F; I/O &#x662F;&#x6700;&#x5E38;&#x89C1;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x4ED6;&#x4EEC;&#x5C06;&#x5176;&#x4F5C;&#x4E3A;&#x9ED8;&#x8BA4;&#x884C;&#x4E3A;&#x3002;&#x4F7F;&#x7528; lseek &#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#xFF0C;&#x968F;&#x673A;&#x8BBF;&#x95EE;&#x4ECD;&#x7136;&#x76F8;&#x5BF9;&#x5BB9;&#x6613;&#x5B9E;&#x73B0;&#xFF0C;&#x4F46;&#x662F;&#x4EC5;&#x6267;&#x884C;&#x987A;&#x5E8F;&#x8BBF;&#x95EE;&#x7684;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x65E0;&#x9700;&#x4E86;&#x89E3;&#x8BE5;&#x673A;&#x5236;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x63A5;&#x53E3;&#x5177;&#x6709;&#x8BB8;&#x591A;&#x529F;&#x80FD;&#xFF0C;&#x4F46;&#x662F;&#x5927;&#x591A;&#x6570;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x53EA;&#x9700;&#x8981;&#x4E86;&#x89E3;&#x5176;&#x4E2D;&#x7684;&#x4E00;&#x4E9B;&#x529F;&#x80FD;&#xFF0C;&#x90A3;&#x4E48;&#x8BE5;&#x63A5;&#x53E3;&#x7684;&#x6709;&#x6548;&#x590D;&#x6742;&#x6027;&#x5C31;&#x662F;&#x5E38;&#x7528;&#x529F;&#x80FD;&#x7684;&#x590D;&#x6742;&#x6027;&#x3002;</p>
<h4 id="48-&#x7ED3;&#x8BBA;">4.8 &#x7ED3;&#x8BBA;</h4>
<p>&#x901A;&#x8FC7;&#x5C06;&#x6A21;&#x5757;&#x7684;&#x63A5;&#x53E3;&#x4E0E;&#x5176;&#x5B9E;&#x73B0;&#x5206;&#x5F00;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5C06;&#x5B9E;&#x73B0;&#x7684;&#x590D;&#x6742;&#x6027;&#x4ECE;&#x7CFB;&#x7EDF;&#x7684;&#x5176;&#x4F59;&#x90E8;&#x5206;&#x4E2D;&#x9690;&#x85CF;&#x51FA;&#x6765;&#x3002;&#x6A21;&#x5757;&#x7684;&#x7528;&#x6237;&#x53EA;&#x9700;&#x8981;&#x4E86;&#x89E3;&#x5176;&#x63A5;&#x53E3;&#x63D0;&#x4F9B;&#x7684;&#x62BD;&#x8C61;&#x3002;&#x8BBE;&#x8BA1;&#x7C7B;&#x548C;&#x5176;&#x4ED6;&#x6A21;&#x5757;&#x65F6;&#xFF0C;&#x6700;&#x91CD;&#x8981;&#x7684;&#x95EE;&#x9898;&#x662F;&#x4F7F;&#x5B83;&#x4EEC;&#x66F4;&#x6DF1;&#xFF0C;&#x4EE5;&#x4F7F;&#x5B83;&#x4EEC;&#x5177;&#x6709;&#x9002;&#x7528;&#x4E8E;&#x5E38;&#x89C1;&#x7528;&#x4F8B;&#x7684;&#x7B80;&#x5355;&#x63A5;&#x53E3;&#xFF0C;&#x4F46;&#x4ECD;&#x63D0;&#x4F9B;&#x91CD;&#x8981;&#x7684;&#x529F;&#x80FD;&#x3002;&#x8FD9;&#x4F7F;&#x9690;&#x85CF;&#x7684;&#x590D;&#x6742;&#x6027;&#x6700;&#x5927;&#x5316;&#x3002;</p>
<p>&#x5B58;&#x5728;&#x8BED;&#x8A00;&#xFF0C;&#x4E3B;&#x8981;&#x662F;&#x5728;&#x7814;&#x7A76;&#x793E;&#x533A;&#x4E2D;&#xFF0C;&#x5728;&#x5176;&#x4E2D;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x89C4;&#x8303;&#x8BED;&#x8A00;&#x6765;&#x6B63;&#x5F0F;&#x63CF;&#x8FF0;&#x65B9;&#x6CD5;&#x6216;&#x529F;&#x80FD;&#x7684;&#x6574;&#x4F53;&#x884C;&#x4E3A;&#x3002;&#x53EF;&#x4EE5;&#x81EA;&#x52A8;&#x68C0;&#x67E5;&#x8BE5;&#x89C4;&#x8303;&#x4EE5;&#x786E;&#x4FDD;&#x5B83;&#x4E0E;&#x5B9E;&#x73B0;&#x76F8;&#x5339;&#x914D;&#x3002;&#x4E00;&#x4E2A;&#x6709;&#x8DA3;&#x7684;&#x95EE;&#x9898;&#x662F;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x6B63;&#x5F0F;&#x89C4;&#x8303;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x4EE3;&#x66FF;&#x63A5;&#x53E3;&#x7684;&#x975E;&#x6B63;&#x5F0F;&#x90E8;&#x5206;&#x3002;&#x6211;&#x76EE;&#x524D;&#x7684;&#x89C2;&#x70B9;&#x662F;&#xFF0C;&#x7528;&#x82F1;&#x8BED;&#x63CF;&#x8FF0;&#x7684;&#x63A5;&#x53E3;&#x6BD4;&#x4F7F;&#x7528;&#x6B63;&#x5F0F;&#x89C4;&#x8303;&#x8BED;&#x8A00;&#x7F16;&#x5199;&#x7684;&#x63A5;&#x53E3;&#x5BF9;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x6765;&#x8BF4;&#x66F4;&#x76F4;&#x89C2;&#x548C;&#x6613;&#x4E8E;&#x7406;&#x89E3;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="ch3.html" class="navigation navigation-prev " aria-label="Previous page: 第三章：工作代码是不够的（战略与战术编程）">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="ch5.html" class="navigation navigation-next " aria-label="Next page: 第五章：信息隐藏(和泄露)">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第四章：模块应该是深的","level":"1.7","depth":1,"next":{"title":"第五章：信息隐藏(和泄露)","level":"1.8","depth":1,"path":"docs/ch5.md","ref":"./docs/ch5.md","articles":[]},"previous":{"title":"第三章：工作代码是不够的（战略与战术编程）","level":"1.6","depth":1,"path":"docs/ch3.md","ref":"./docs/ch3.md","articles":[]},"dir":"ltr"},"config":{"plugins":["back-to-top-button","expandable-chapters-small","page-toc-button","livereload"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"livereload":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"page-toc-button":{},"back-to-top-button":{},"expandable-chapters-small":{},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"John Ousterhout","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"软件设计哲学","language":"zh-hans","gitbook":"*","description":"书中讨论了软件设计的主题：如何将复杂的软件系统分解成可以相对独立实现的模块(如类和方法)"},"file":{"path":"docs/ch4.md","mtime":"2020-08-06T16:26:19.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-02-06T04:55:41.669Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-page-toc-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

