
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第五章：信息隐藏(和泄露) · 软件设计哲学</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="John Ousterhout">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-page-toc-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="ch6.html" />
    
    
    <link rel="prev" href="ch4.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    首页
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="preface">
            
                <span>
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="ch1.html">
            
                <a href="ch1.html">
            
                    
                    第一章：介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="ch2.html">
            
                <a href="ch2.html">
            
                    
                    第二章：复杂性的本质
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="ch3.html">
            
                <a href="ch3.html">
            
                    
                    第三章：工作代码是不够的（战略与战术编程）
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="ch4.html">
            
                <a href="ch4.html">
            
                    
                    第四章：模块应该是深的
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.8" data-path="ch5.html">
            
                <a href="ch5.html">
            
                    
                    第五章：信息隐藏(和泄露)
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="ch6.html">
            
                <a href="ch6.html">
            
                    
                    第六章：通用模块更深入
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="ch7.html">
            
                <a href="ch7.html">
            
                    
                    第七章: 不同的层，不同的抽象
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="ch8.html">
            
                <a href="ch8.html">
            
                    
                    第八章: 降低复杂性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="ch9.html">
            
                <a href="ch9.html">
            
                    
                    第九章: 在一起更好还是分开更好？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="ch10.html">
            
                <a href="ch10.html">
            
                    
                    第十章: 定义不存在的错误
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="ch11.html">
            
                <a href="ch11.html">
            
                    
                    第十一章: 设计它两次
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="ch12.html">
            
                <a href="ch12.html">
            
                    
                    第十二章: 为什么写注释？四个理由
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="ch13.html">
            
                <a href="ch13.html">
            
                    
                    第十三章: 注释应该描述代码中不明显的内容
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="ch14.html">
            
                <a href="ch14.html">
            
                    
                    第十四章: 选择的名字
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="ch15.html">
            
                <a href="ch15.html">
            
                    
                    第十五章: 先写注释
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="ch16.html">
            
                <a href="ch16.html">
            
                    
                    第十六章: 修改现有的代码
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.20" data-path="ch17.html">
            
                <a href="ch17.html">
            
                    
                    第十七章: 一致性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.21" data-path="ch18.html">
            
                <a href="ch18.html">
            
                    
                    第十八章: 代码应该是显而易见的
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.22" data-path="ch19.html">
            
                <a href="ch19.html">
            
                    
                    第十九章: 软件发展趋势
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.23" data-path="ch20.html">
            
                <a href="ch20.html">
            
                    
                    第二十章: 设计性能
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.24" data-path="ch21.html">
            
                <a href="ch21.html">
            
                    
                    第二十一章: 结论
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.25" data-path="summary.html">
            
                <a href="summary.html">
            
                    
                    总结
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >第五章：信息隐藏(和泄露)</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7B2C;-&#x4E94;-&#x7AE0;-&#x4FE1;&#x606F;&#x9690;&#x85CF;&#x548C;&#x6CC4;&#x6F0F;">&#x7B2C; &#x4E94; &#x7AE0; &#x4FE1;&#x606F;&#x9690;&#x85CF;(&#x548C;&#x6CC4;&#x6F0F;)</h1>
<p>&#x7B2C;&#x56DB;&#x7AE0;&#x8BA4;&#x4E3A;&#x6A21;&#x5757;&#x5E94;&#x8BE5;&#x5F88;&#x6DF1;&#x3002;&#x672C;&#x7AE0;&#x53CA;&#x968F;&#x540E;&#x7684;&#x5176;&#x4ED6;&#x7AE0;&#x8282;&#x8BA8;&#x8BBA;&#x4E86;&#x521B;&#x5EFA;&#x6DF1;&#x5C42;&#x6A21;&#x5757;&#x7684;&#x6280;&#x672F;&#x3002;</p>
<h4 id="51-&#x4FE1;&#x606F;&#x9690;&#x85CF;">5.1 &#x4FE1;&#x606F;&#x9690;&#x85CF;</h4>
<p>&#x5B9E;&#x73B0;&#x6DF1;&#x5C42;&#x6A21;&#x5757;&#x6700;&#x91CD;&#x8981;&#x7684;&#x6280;&#x672F;&#x662F;&#x4FE1;&#x606F;&#x9690;&#x85CF;&#x3002;&#x8BE5;&#x6280;&#x672F;&#x6700;&#x65E9;&#x7531; David Parnas1 &#x63CF;&#x8FF0;&#x3002;&#x57FA;&#x672C;&#x601D;&#x60F3;&#x662F;&#x6BCF;&#x4E2A;&#x6A21;&#x5757;&#x5E94;&#x5C01;&#x88C5;&#x4E00;&#x4E9B;&#x77E5;&#x8BC6;&#xFF0C;&#x8FD9;&#x4E9B;&#x77E5;&#x8BC6;&#x4EE3;&#x8868;&#x8BBE;&#x8BA1;&#x51B3;&#x7B56;&#x3002;&#x8BE5;&#x77E5;&#x8BC6;&#x5D4C;&#x5165;&#x5728;&#x6A21;&#x5757;&#x7684;&#x5B9E;&#x73B0;&#x4E2D;&#xFF0C;&#x4F46;&#x4E0D;&#x4F1A;&#x51FA;&#x73B0;&#x5728;&#x5176;&#x754C;&#x9762;&#x4E2D;&#xFF0C;&#x56E0;&#x6B64;&#x5176;&#x4ED6;&#x6A21;&#x5757;&#x4E0D;&#x53EF;&#x89C1;&#x3002;</p>
<p>&#x9690;&#x85CF;&#x5728;&#x6A21;&#x5757;&#x4E2D;&#x7684;&#x4FE1;&#x606F;&#x901A;&#x5E38;&#x5305;&#x542B;&#x6709;&#x5173;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x67D0;&#x79CD;&#x673A;&#x5236;&#x7684;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#x3002;&#x4EE5;&#x4E0B;&#x662F;&#x4E00;&#x4E9B;&#x53EF;&#x80FD;&#x9690;&#x85CF;&#x5728;&#x6A21;&#x5757;&#x4E2D;&#x7684;&#x4FE1;&#x606F;&#x793A;&#x4F8B;&#xFF1A;</p>
<ul>
<li>&#x5982;&#x4F55;&#x5728; B &#x6811;&#x4E2D;&#x5B58;&#x50A8;&#x4FE1;&#x606F;&#xFF0C;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x6709;&#x6548;&#x5730;&#x8BBF;&#x95EE;&#x5B83;&#x3002;</li>
<li>&#x5982;&#x4F55;&#x8BC6;&#x522B;&#x4E0E;&#x6587;&#x4EF6;&#x4E2D;&#x6BCF;&#x4E2A;&#x903B;&#x8F91;&#x5757;&#x76F8;&#x5BF9;&#x5E94;&#x7684;&#x7269;&#x7406;&#x78C1;&#x76D8;&#x5757;&#x3002;</li>
<li>&#x5982;&#x4F55;&#x5B9E;&#x73B0; TCP &#x7F51;&#x7EDC;&#x534F;&#x8BAE;&#x3002;</li>
<li>&#x5982;&#x4F55;&#x5728;&#x591A;&#x6838;&#x5904;&#x7406;&#x5668;&#x4E0A;&#x8C03;&#x5EA6;&#x7EBF;&#x7A0B;&#x3002;</li>
<li>&#x5982;&#x4F55;&#x89E3;&#x6790; JSON &#x6587;&#x6863;&#x3002;</li>
</ul>
<p>&#x9690;&#x85CF;&#x7684;&#x4FE1;&#x606F;&#x5305;&#x62EC;&#x4E0E;&#x8BE5;&#x673A;&#x5236;&#x6709;&#x5173;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x548C;&#x7B97;&#x6CD5;&#x3002;&#x5B83;&#x8FD8;&#x53EF;&#x4EE5;&#x5305;&#x542B;&#x8F83;&#x4F4E;&#x7EA7;&#x522B;&#x7684;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#xFF08;&#x4F8B;&#x5982;&#x9875;&#x9762;&#x5927;&#x5C0F;&#xFF09;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x5305;&#x542B;&#x66F4;&#x62BD;&#x8C61;&#x7684;&#x8F83;&#x9AD8;&#x7EA7;&#x522B;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x4F8B;&#x5982;&#x5927;&#x591A;&#x6570;&#x6587;&#x4EF6;&#x8F83;&#x5C0F;&#x7684;&#x5047;&#x8BBE;&#x3002;</p>
<p>&#x4FE1;&#x606F;&#x9690;&#x85CF;&#x5728;&#x4E24;&#x4E2A;&#x65B9;&#x9762;&#x964D;&#x4F4E;&#x4E86;&#x590D;&#x6742;&#x6027;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x5B83;&#x5C06;&#x63A5;&#x53E3;&#x7B80;&#x5316;&#x4E3A;&#x6A21;&#x5757;&#x3002;&#x63A5;&#x53E3;&#x53CD;&#x6620;&#x4E86;&#x6A21;&#x5757;&#x529F;&#x80FD;&#x7684;&#x66F4;&#x7B80;&#x5355;&#x3001;&#x66F4;&#x62BD;&#x8C61;&#x7684;&#x89C6;&#x56FE;&#xFF0C;&#x5E76;&#x9690;&#x85CF;&#x4E86;&#x7EC6;&#x8282;;&#x8FD9;&#x51CF;&#x5C11;&#x4E86;&#x4F7F;&#x7528;&#x8BE5;&#x6A21;&#x5757;&#x7684;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x7684;&#x8BA4;&#x77E5;&#x8D1F;&#x62C5;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4F7F;&#x7528; B-tree &#x7C7B;&#x7684;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x4E0D;&#x9700;&#x8981;&#x8003;&#x8651;&#x6811;&#x4E2D;&#x8282;&#x70B9;&#x7684;&#x7406;&#x60F3;&#x6247;&#x51FA;&#xFF0C;&#x4E5F;&#x4E0D;&#x9700;&#x8981;&#x8003;&#x8651;&#x5982;&#x4F55;&#x4FDD;&#x6301;&#x6811;&#x7684;&#x5E73;&#x8861;&#x3002;&#x5176;&#x6B21;&#xFF0C;&#x4FE1;&#x606F;&#x9690;&#x85CF;&#x4F7F;&#x7CFB;&#x7EDF;&#x66F4;&#x5BB9;&#x6613;&#x6F14;&#x5316;&#x3002;&#x5982;&#x679C;&#x9690;&#x85CF;&#x4E86;&#x4E00;&#x6BB5;&#x4FE1;&#x606F;&#xFF0C;&#x90A3;&#x4E48;&#x5728;&#x5305;&#x542B;&#x8BE5;&#x4FE1;&#x606F;&#x7684;&#x6A21;&#x5757;&#x4E4B;&#x5916;&#x5C31;&#x4E0D;&#x5B58;&#x5728;&#x5BF9;&#x8BE5;&#x4FE1;&#x606F;&#x7684;&#x4F9D;&#x8D56;&#xFF0C;&#x56E0;&#x6B64;&#x4E0E;&#x8BE5;&#x4FE1;&#x606F;&#x76F8;&#x5173;&#x7684;&#x8BBE;&#x8BA1;&#x66F4;&#x6539;&#x5C06;&#x53EA;&#x5F71;&#x54CD;&#x4E00;&#x4E2A;&#x6A21;&#x5757;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C; TCP &#x534F;&#x8BAE;&#x53D1;&#x751F;&#x4E86;&#x53D8;&#x5316;(&#x4F8B;&#x5982;&#xFF0C;&#x4E3A;&#x4E86;&#x5F15;&#x5165;&#x4E00;&#x79CD;&#x65B0;&#x7684;&#x62E5;&#x585E;&#x63A7;&#x5236;&#x673A;&#x5236;)&#xFF0C;&#x534F;&#x8BAE;&#x7684;&#x5B9E;&#x73B0;&#x5C31;&#x5FC5;&#x987B;&#x8FDB;&#x884C;&#x4FEE;&#x6539;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x4F7F;&#x7528; TCP &#x53D1;&#x9001;&#x548C;&#x63A5;&#x6536;&#x6570;&#x636E;&#x7684;&#x9AD8;&#x7EA7;&#x4EE3;&#x7801;&#x4E2D;&#x4E0D;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x4EFB;&#x4F55;&#x4FEE;&#x6539;&#x3002;</p>
<p>&#x8BBE;&#x8BA1;&#x65B0;&#x6A21;&#x5757;&#x65F6;&#xFF0C;&#x5E94;&#x4ED4;&#x7EC6;&#x8003;&#x8651;&#x53EF;&#x4EE5;&#x5728;&#x8BE5;&#x6A21;&#x5757;&#x4E2D;&#x9690;&#x85CF;&#x54EA;&#x4E9B;&#x4FE1;&#x606F;&#x3002;&#x5982;&#x679C;&#x60A8;&#x53EF;&#x4EE5;&#x9690;&#x85CF;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#xFF0C;&#x5219;&#x8FD8;&#x5E94;&#x8BE5;&#x80FD;&#x591F;&#x7B80;&#x5316;&#x6A21;&#x5757;&#x7684;&#x754C;&#x9762;&#xFF0C;&#x8FD9;&#x4F1A;&#x4F7F;&#x6A21;&#x5757;&#x66F4;&#x6DF1;&#x3002;</p>
<p>&#x6CE8;&#x610F;&#xFF1A;&#x901A;&#x8FC7;&#x58F0;&#x660E;&#x53D8;&#x91CF;&#x548C;&#x65B9;&#x6CD5;&#x4E3A;&#x79C1;&#x6709;&#x6765;&#x9690;&#x85CF;&#x7C7B;&#x4E2D;&#x7684;&#x53D8;&#x91CF;&#x548C;&#x65B9;&#x6CD5;&#x4E0E;&#x4FE1;&#x606F;&#x9690;&#x85CF;&#x4E0D;&#x662F;&#x540C;&#x4E00;&#x56DE;&#x4E8B;&#x3002;&#x79C1;&#x6709;&#x5143;&#x7D20;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x9690;&#x85CF;&#x4FE1;&#x606F;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x4F7F;&#x65E0;&#x6CD5;&#x4ECE;&#x7C7B;&#x5916;&#x90E8;&#x76F4;&#x63A5;&#x8BBF;&#x95EE;&#x9879;&#x76EE;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x6709;&#x5173;&#x79C1;&#x4EBA;&#x7269;&#x54C1;&#x7684;&#x4FE1;&#x606F;&#x4ECD;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x516C;&#x5171;&#x65B9;&#x6CD5;&#xFF08;&#x5982; getter &#x548C; setter &#x65B9;&#x6CD5;&#xFF09;&#x516C;&#x5F00;&#x3002;&#x53D1;&#x751F;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x65F6;&#xFF0C;&#x53D8;&#x91CF;&#x7684;&#x6027;&#x8D28;&#x548C;&#x7528;&#x6CD5;&#x5C31;&#x5982;&#x540C;&#x53D8;&#x91CF;&#x662F;&#x516C;&#x5F00;&#x7684;&#x4E00;&#x6837;&#x66B4;&#x9732;&#x3002;</p>
<p>&#x4FE1;&#x606F;&#x9690;&#x85CF;&#x7684;&#x6700;&#x4F73;&#x5F62;&#x5F0F;&#x662F;&#x5C06;&#x4FE1;&#x606F;&#x5B8C;&#x5168;&#x9690;&#x85CF;&#x5728;&#x6A21;&#x5757;&#x4E2D;&#xFF0C;&#x4ECE;&#x800C;&#x4F7F;&#x8BE5;&#x4FE1;&#x606F;&#x5BF9;&#x6A21;&#x5757;&#x7684;&#x7528;&#x6237;&#x65E0;&#x5173;&#x4E14;&#x4E0D;&#x53EF;&#x89C1;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x90E8;&#x5206;&#x4FE1;&#x606F;&#x9690;&#x85CF;&#x4E5F;&#x5177;&#x6709;&#x4EF7;&#x503C;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x67D0;&#x4E2A;&#x7C7B;&#x7684;&#x67D0;&#x4E9B;&#x7528;&#x6237;&#x4EC5;&#x9700;&#x8981;&#x7279;&#x5B9A;&#x7684;&#x529F;&#x80FD;&#x6216;&#x4FE1;&#x606F;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5355;&#x72EC;&#x7684;&#x65B9;&#x6CD5;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x8BBF;&#x95EE;&#xFF0C;&#x4EE5;&#x4F7F;&#x5176;&#x5728;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x7528;&#x4F8B;&#x4E2D;&#x4E0D;&#x53EF;&#x89C1;&#xFF0C;&#x5219;&#x8BE5;&#x4FE1;&#x606F;&#x901A;&#x5E38;&#x4F1A;&#x88AB;&#x9690;&#x85CF;&#x3002;&#x4E0E;&#x7C7B;&#x7684;&#x6BCF;&#x4E2A;&#x7528;&#x6237;&#x53EF;&#x89C1;&#x7684;&#x4FE1;&#x606F;&#x76F8;&#x6BD4;&#xFF0C;&#x6B64;&#x7C7B;&#x4FE1;&#x606F;&#x5C06;&#x521B;&#x5EFA;&#x66F4;&#x5C11;&#x7684;&#x4F9D;&#x8D56;&#x9879;&#x3002;</p>
<h4 id="52-&#x4FE1;&#x606F;&#x6CC4;&#x6F0F;">5.2 &#x4FE1;&#x606F;&#x6CC4;&#x6F0F;</h4>
<p>&#x4FE1;&#x606F;&#x9690;&#x85CF;&#x7684;&#x53CD;&#x9762;&#x662F;&#x4FE1;&#x606F;&#x6CC4;&#x6F0F;&#x3002;&#x5F53;&#x4E00;&#x4E2A;&#x8BBE;&#x8BA1;&#x51B3;&#x7B56;&#x53CD;&#x6620;&#x5728;&#x591A;&#x4E2A;&#x6A21;&#x5757;&#x4E2D;&#x65F6;&#xFF0C;&#x5C31;&#x4F1A;&#x53D1;&#x751F;&#x4FE1;&#x606F;&#x6CC4;&#x6F0F;&#x3002;&#x8FD9;&#x5728;&#x6A21;&#x5757;&#x4E4B;&#x95F4;&#x521B;&#x5EFA;&#x4E86;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#xFF1A;&#x5BF9;&#x8BE5;&#x8BBE;&#x8BA1;&#x51B3;&#x7B56;&#x7684;&#x4EFB;&#x4F55;&#x66F4;&#x6539;&#x90FD;&#x5C06;&#x8981;&#x6C42;&#x5BF9;&#x6240;&#x6709;&#x6D89;&#x53CA;&#x7684;&#x6A21;&#x5757;&#x8FDB;&#x884C;&#x66F4;&#x6539;&#x3002;&#x5982;&#x679C;&#x4E00;&#x6761;&#x4FE1;&#x606F;&#x53CD;&#x6620;&#x5728;&#x6A21;&#x5757;&#x7684;&#x754C;&#x9762;&#x4E2D;&#xFF0C;&#x5219;&#x6839;&#x636E;&#x5B9A;&#x4E49;&#xFF0C;&#x8BE5;&#x4FE1;&#x606F;&#x5DF2;&#x7ECF;&#x6CC4;&#x6F0F;&#xFF1B;&#x56E0;&#x6B64;&#xFF0C;&#x66F4;&#x7B80;&#x5355;&#x7684;&#x754C;&#x9762;&#x5F80;&#x5F80;&#x4E0E;&#x66F4;&#x597D;&#x7684;&#x4FE1;&#x606F;&#x9690;&#x85CF;&#x76F8;&#x5173;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5373;&#x4F7F;&#x4FE1;&#x606F;&#x672A;&#x51FA;&#x73B0;&#x5728;&#x6A21;&#x5757;&#x7684;&#x754C;&#x9762;&#x4E2D;&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x4F1A;&#x6CC4;&#x6F0F;&#x4FE1;&#x606F;&#x3002;&#x5047;&#x8BBE;&#x4E24;&#x4E2A;&#x7C7B;&#x90FD;&#x5177;&#x6709;&#x7279;&#x5B9A;&#x6587;&#x4EF6;&#x683C;&#x5F0F;&#x7684;&#x77E5;&#x8BC6;&#xFF08;&#x4E5F;&#x8BB8;&#x4E00;&#x4E2A;&#x7C7B;&#x8BFB;&#x53D6;&#x8BE5;&#x683C;&#x5F0F;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x800C;&#x53E6;&#x4E00;&#x4E2A;&#x7C7B;&#x5199;&#x5165;&#x5B83;&#x4EEC;&#xFF09;&#x3002;&#x5373;&#x4F7F;&#x4E24;&#x4E2A;&#x7C7B;&#x90FD;&#x4E0D;&#x5728;&#x5176;&#x63A5;&#x53E3;&#x4E2D;&#x516C;&#x5F00;&#x8BE5;&#x4FE1;&#x606F;&#xFF0C;&#x5B83;&#x4EEC;&#x90FD;&#x53D6;&#x51B3;&#x4E8E;&#x6587;&#x4EF6;&#x683C;&#x5F0F;&#xFF1A;&#x5982;&#x679C;&#x683C;&#x5F0F;&#x66F4;&#x6539;&#xFF0C;&#x5219;&#x4E24;&#x4E2A;&#x7C7B;&#x90FD;&#x5C06;&#x9700;&#x8981;&#x4FEE;&#x6539;&#x3002;</p>
<p>&#x4FE1;&#x606F;&#x6CC4;&#x6F0F;&#x662F;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x4E2D;&#x6700;&#x91CD;&#x8981;&#x7684;&#x5371;&#x9669;&#x4FE1;&#x53F7;&#x4E4B;&#x4E00;&#x3002;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x5E08;&#xFF0C;&#x4F60;&#x80FD;&#x5B66;&#x5230;&#x7684;&#x6700;&#x597D;&#x7684;&#x6280;&#x80FD;&#x4E4B;&#x4E00;&#x5C31;&#x662F;&#x5BF9;&#x4FE1;&#x606F;&#x6CC4;&#x9732;&#x7684;&#x9AD8;&#x5EA6;&#x654F;&#x611F;&#x6027;&#x3002;&#x5982;&#x679C;&#x60A8;&#x5728;&#x7C7B;&#x4E4B;&#x95F4;&#x9047;&#x5230;&#x4FE1;&#x606F;&#x6CC4;&#x6F0F;&#xFF0C;&#x8BF7;&#x81EA;&#x95EE;&#x201C;&#x6211;&#x5982;&#x4F55;&#x624D;&#x80FD;&#x91CD;&#x65B0;&#x7EC4;&#x7EC7;&#x8FD9;&#x4E9B;&#x7C7B;&#xFF0C;&#x4F7F;&#x8FD9;&#x4E9B;&#x7279;&#x5B9A;&#x7684;&#x77E5;&#x8BC6;&#x53EA;&#x5F71;&#x54CD;&#x4E00;&#x4E2A;&#x7C7B;?&#x201D;&#x5982;&#x679C;&#x53D7;&#x5F71;&#x54CD;&#x7684;&#x7C7B;&#x76F8;&#x5BF9;&#x8F83;&#x5C0F;&#xFF0C;&#x5E76;&#x4E14;&#x4E0E;&#x6CC4;&#x6F0F;&#x7684;&#x4FE1;&#x606F;&#x7D27;&#x5BC6;&#x76F8;&#x5173;&#xFF0C;&#x90A3;&#x4E48;&#x5C06;&#x5B83;&#x4EEC;&#x5408;&#x5E76;&#x5230;&#x4E00;&#x4E2A;&#x7C7B;&#x4E2D;&#x662F;&#x6709;&#x610F;&#x4E49;&#x7684;&#x3002;&#x53E6;&#x4E00;&#x79CD;&#x53EF;&#x80FD;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x4ECE;&#x6240;&#x6709;&#x53D7;&#x5F71;&#x54CD;&#x7684;&#x7C7B;&#x4E2D;&#x63D0;&#x53D6;&#x4FE1;&#x606F;&#xFF0C;&#x5E76;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x53EA;&#x5C01;&#x88C5;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x7684;&#x65B0;&#x7C7B;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x53EA;&#x6709;&#x5728;&#x60A8;&#x80FD;&#x591F;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x4ECE;&#x7EC6;&#x8282;&#x4E2D;&#x62BD;&#x8C61;&#x51FA;&#x6765;&#x7684;&#x7B80;&#x5355;&#x63A5;&#x53E3;&#x65F6;&#x624D;&#x6709;&#x6548;;&#x5982;&#x679C;&#x65B0;&#x7C7B;&#x901A;&#x8FC7;&#x5176;&#x63A5;&#x53E3;&#x516C;&#x5F00;&#x4E86;&#x5927;&#x90E8;&#x5206;&#x77E5;&#x8BC6;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x5C31;&#x4E0D;&#x4F1A;&#x63D0;&#x4F9B;&#x592A;&#x591A;&#x7684;&#x4EF7;&#x503C;(&#x60A8;&#x53EA;&#x662F;&#x7528;&#x901A;&#x8FC7;&#x63A5;&#x53E3;&#x7684;&#x6CC4;&#x6F0F;&#x66FF;&#x6362;&#x4E86;&#x540E;&#x95E8;&#x6CC4;&#x6F0F;)&#x3002;</p>
<p>&#x5F53;&#x5728;&#x591A;&#x4E2A;&#x5730;&#x65B9;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x7684;&#x77E5;&#x8BC6;&#x65F6;&#xFF0C;&#x4F8B;&#x5982;&#x4E24;&#x4E2A;&#x90FD;&#x7406;&#x89E3;&#x7279;&#x5B9A;&#x7C7B;&#x578B;&#x6587;&#x4EF6;&#x683C;&#x5F0F;&#x7684;&#x4E0D;&#x540C;&#x7C7B;&#xFF0C;&#x5C31;&#x4F1A;&#x53D1;&#x751F;&#x4FE1;&#x606F;&#x6CC4;&#x6F0F;&#x3002;</p>
<h4 id="53-&#x65F6;&#x95F4;&#x5206;&#x89E3;">5.3 &#x65F6;&#x95F4;&#x5206;&#x89E3;</h4>
<p>&#x4FE1;&#x606F;&#x6CC4;&#x6F0F;&#x7684;&#x4E00;&#x4E2A;&#x5E38;&#x89C1;&#x539F;&#x56E0;&#x662F;&#x6211;&#x79F0;&#x4E3A;&#x65F6;&#x95F4;&#x5206;&#x89E3;&#x7684;&#x8BBE;&#x8BA1;&#x98CE;&#x683C;&#x3002;&#x5728;&#x65F6;&#x95F4;&#x5206;&#x89E3;&#x4E2D;&#xFF0C;&#x7CFB;&#x7EDF;&#x7684;&#x7ED3;&#x6784;&#x5BF9;&#x5E94;&#x4E8E;&#x64CD;&#x4F5C;&#x5C06;&#x53D1;&#x751F;&#x7684;&#x65F6;&#x95F4;&#x987A;&#x5E8F;&#x3002;&#x8003;&#x8651;&#x4E00;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x8BE5;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4EE5;&#x7279;&#x5B9A;&#x683C;&#x5F0F;&#x8BFB;&#x53D6;&#x6587;&#x4EF6;&#xFF0C;&#x4FEE;&#x6539;&#x6587;&#x4EF6;&#x5185;&#x5BB9;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x6B21;&#x5C06;&#x6587;&#x4EF6;&#x5199;&#x51FA;&#x3002;&#x901A;&#x8FC7;&#x65F6;&#x95F4;&#x5206;&#x89E3;&#xFF0C;&#x8BE5;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x5206;&#x4E3A;&#x4E09;&#x7C7B;&#xFF1A;&#x4E00;&#x7C7B;&#x7528;&#x4E8E;&#x8BFB;&#x53D6;&#x6587;&#x4EF6;&#xFF0C;&#x53E6;&#x4E00;&#x7C7B;&#x7528;&#x4E8E;&#x6267;&#x884C;&#x4FEE;&#x6539;&#xFF0C;&#x7B2C;&#x4E09;&#x7C7B;&#x7528;&#x4E8E;&#x5199;&#x51FA;&#x65B0;&#x7248;&#x672C;&#x3002;&#x6587;&#x4EF6;&#x8BFB;&#x53D6;&#x548C;&#x6587;&#x4EF6;&#x5199;&#x5165;&#x6B65;&#x9AA4;&#x90FD;&#x5177;&#x6709;&#x6709;&#x5173;&#x6587;&#x4EF6;&#x683C;&#x5F0F;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x8FD9;&#x4F1A;&#x5BFC;&#x81F4;&#x4FE1;&#x606F;&#x6CC4;&#x6F0F;&#x3002;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x662F;&#x5C06;&#x7528;&#x4E8E;&#x8BFB;&#x5199;&#x6587;&#x4EF6;&#x7684;&#x6838;&#x5FC3;&#x673A;&#x5236;&#x7ED3;&#x5408;&#x5230;&#x4E00;&#x4E2A;&#x7C7B;&#x4E2D;&#x3002;&#x8BE5;&#x7C7B;&#x5C06;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x8BFB;&#x53D6;&#x548C;&#x5199;&#x5165;&#x9636;&#x6BB5;&#x4F7F;&#x7528;&#x3002;&#x5F88;&#x5BB9;&#x6613;&#x9677;&#x5165;&#x65F6;&#x95F4;&#x5206;&#x89E3;&#x7684;&#x9677;&#x9631;&#xFF0C;&#x56E0;&#x4E3A;&#x5728;&#x7F16;&#x5199;&#x4EE3;&#x7801;&#x65F6;&#x901A;&#x5E38;&#x4F1A;&#x60F3;&#x5230;&#x5FC5;&#x987B;&#x6267;&#x884C;&#x64CD;&#x4F5C;&#x7684;&#x987A;&#x5E8F;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x8BBE;&#x8BA1;&#x51B3;&#x7B56;&#x4F1A;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x6574;&#x4E2A;&#x751F;&#x547D;&#x5468;&#x671F;&#x4E2D;&#x7684;&#x591A;&#x4E2A;&#x4E0D;&#x540C;&#x65F6;&#x523B;&#x8868;&#x73B0;&#x51FA;&#x6765;&#x3002;&#x7ED3;&#x679C;&#xFF0C;&#x65F6;&#x95F4;&#x5206;&#x89E3;&#x5E38;&#x5E38;&#x5BFC;&#x81F4;&#x4FE1;&#x606F;&#x6CC4;&#x6F0F;&#x3002;</p>
<p>&#x987A;&#x5E8F;&#x901A;&#x5E38;&#x5F88;&#x91CD;&#x8981;&#xFF0C;&#x56E0;&#x6B64;&#x5B83;&#x5C06;&#x53CD;&#x6620;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;&#x67D0;&#x4E2A;&#x4F4D;&#x7F6E;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x9664;&#x975E;&#x8BE5;&#x7ED3;&#x6784;&#x4E0E;&#x4FE1;&#x606F;&#x9690;&#x85CF;&#x4FDD;&#x6301;&#x4E00;&#x81F4;&#xFF08;&#x4E5F;&#x8BB8;&#x4E0D;&#x540C;&#x9636;&#x6BB5;&#x4F7F;&#x7528;&#x5B8C;&#x5168;&#x4E0D;&#x540C;&#x7684;&#x4FE1;&#x606F;&#xFF09;&#xFF0C;&#x5426;&#x5219;&#x4E0D;&#x5E94;&#x5C06;&#x5176;&#x53CD;&#x6620;&#x5728;&#x6A21;&#x5757;&#x7ED3;&#x6784;&#x4E2D;&#x3002;&#x5728;&#x8BBE;&#x8BA1;&#x6A21;&#x5757;&#x65F6;&#xFF0C;&#x5E94;&#x4E13;&#x6CE8;&#x4E8E;&#x6267;&#x884C;&#x6BCF;&#x4E2A;&#x4EFB;&#x52A1;&#x6240;&#x9700;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4EFB;&#x52A1;&#x53D1;&#x751F;&#x7684;&#x987A;&#x5E8F;&#x3002;</p>
<p>&#x5728;&#x65F6;&#x95F4;&#x5206;&#x89E3;&#x4E2D;&#xFF0C;&#x6267;&#x884C;&#x987A;&#x5E8F;&#x53CD;&#x6620;&#x5728;&#x4EE3;&#x7801;&#x7ED3;&#x6784;&#x4E2D;&#xFF1A;&#x5728;&#x4E0D;&#x540C;&#x65F6;&#x95F4;&#x53D1;&#x751F;&#x7684;&#x64CD;&#x4F5C;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x65B9;&#x6CD5;&#x6216;&#x7C7B;&#x4E2D;&#x3002;&#x5982;&#x679C;&#x5728;&#x6267;&#x884C;&#x7684;&#x4E0D;&#x540C;&#x70B9;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x5219;&#x4F1A;&#x5728;&#x591A;&#x4E2A;&#x4F4D;&#x7F6E;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x7F16;&#x7801;&#xFF0C;&#x4ECE;&#x800C;&#x5BFC;&#x81F4;&#x4FE1;&#x606F;&#x6CC4;&#x6F0F;&#x3002;</p>
<h4 id="54-http-server-&#x793A;&#x4F8B;&#xFF1A;http-&#x670D;&#x52A1;&#x5668;">5.4 HTTP server &#x793A;&#x4F8B;&#xFF1A;HTTP &#x670D;&#x52A1;&#x5668;</h4>
<p>&#x4E3A;&#x4E86;&#x8BF4;&#x660E;&#x4FE1;&#x606F;&#x9690;&#x85CF;&#x4E2D;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x8003;&#x8651;&#x7531;&#x5B66;&#x751F;&#x5728;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x8BFE;&#x7A0B;&#x4E2D;&#x5B9E;&#x73B0; HTTP &#x534F;&#x8BAE;&#x7684;&#x8BBE;&#x8BA1;&#x51B3;&#x7B56;&#x3002;&#x770B;&#x5230;&#x4ED6;&#x4EEC;&#x505A;&#x5F97;&#x597D;&#x7684;&#x4E8B;&#x60C5;&#x4EE5;&#x53CA;&#x9047;&#x5230;&#x95EE;&#x9898;&#x7684;&#x5730;&#x65B9;&#x90FD;&#x662F;&#x5F88;&#x6709;&#x7528;&#x7684;&#x3002;</p>
<p>HTTP &#x662F; Web &#x6D4F;&#x89C8;&#x5668;&#x7528;&#x6765;&#x4E0E; Web &#x670D;&#x52A1;&#x5668;&#x901A;&#x4FE1;&#x7684;&#x673A;&#x5236;&#x3002;&#x5F53;&#x7528;&#x6237;&#x5355;&#x51FB; Web &#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x7684;&#x94FE;&#x63A5;&#x6216;&#x63D0;&#x4EA4;&#x8868;&#x5355;&#x65F6;&#xFF0C;&#x6D4F;&#x89C8;&#x5668;&#x4F7F;&#x7528; HTTP &#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x5C06;&#x8BF7;&#x6C42;&#x53D1;&#x9001;&#x5230; Web &#x670D;&#x52A1;&#x5668;&#x3002;&#x670D;&#x52A1;&#x5668;&#x5904;&#x7406;&#x5B8C;&#x8BF7;&#x6C42;&#x540E;&#xFF0C;&#x4F1A;&#x5C06;&#x54CD;&#x5E94;&#x53D1;&#x9001;&#x56DE;&#x6D4F;&#x89C8;&#x5668;&#x3002;&#x8BE5;&#x54CD;&#x5E94;&#x901A;&#x5E38;&#x5305;&#x542B;&#x8981;&#x663E;&#x793A;&#x7684;&#x65B0;&#x7F51;&#x9875;&#x3002;HTTP &#x534F;&#x8BAE;&#x6307;&#x5B9A;&#x4E86;&#x8BF7;&#x6C42;&#x548C;&#x54CD;&#x5E94;&#x7684;&#x683C;&#x5F0F;&#xFF0C;&#x4E24;&#x8005;&#x5747;&#x4EE5;&#x6587;&#x672C;&#x5F62;&#x5F0F;&#x8868;&#x793A;&#x3002;&#x56FE; 5.1 &#x663E;&#x793A;&#x4E86;&#x63CF;&#x8FF0;&#x8868;&#x5355;&#x63D0;&#x4EA4;&#x7684; HTTP &#x8BF7;&#x6C42;&#x793A;&#x4F8B;&#x3002;&#x8981;&#x6C42;&#x8BFE;&#x7A0B;&#x4E2D;&#x7684;&#x5B66;&#x751F;&#x5B9E;&#x65BD;&#x4E00;&#x95E8;&#x6216;&#x591A;&#x95E8;&#x8BFE;&#x7A0B;&#xFF0C;&#x4EE5;&#x4F7F; Web &#x670D;&#x52A1;&#x5668;&#x53EF;&#x4EE5;&#x8F7B;&#x677E;&#x5730;&#x63A5;&#x6536;&#x4F20;&#x5165;&#x7684; HTTP &#x8BF7;&#x6C42;&#x5E76;&#x53D1;&#x9001;&#x54CD;&#x5E94;&#x3002;
<img src="https://s1.ax1x.com/2020/07/08/UEktkF.png" alt="UEktkF.png">
&#x56FE; 5.1&#xFF1A;HTTP &#x534F;&#x8BAE;&#x4E2D;&#x7684; POST &#x8BF7;&#x6C42;&#x5305;&#x542B;&#x901A;&#x8FC7; TCP &#x5957;&#x63A5;&#x5B57;&#x53D1;&#x9001;&#x7684;&#x6587;&#x672C;&#x3002;&#x6BCF;&#x4E2A;&#x8BF7;&#x6C42;&#x90FD;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x521D;&#x59CB;&#x884C;&#xFF0C;&#x4E00;&#x4E2A;&#x7531;&#x7A7A;&#x884C;&#x7EC8;&#x6B62;&#x7684;&#x6807;&#x5934;&#x96C6;&#x5408;&#x4EE5;&#x53CA;&#x4E00;&#x4E2A;&#x53EF;&#x9009;&#x4E3B;&#x4F53;&#x3002;&#x521D;&#x59CB;&#x884C;&#x5305;&#x542B;&#x8BF7;&#x6C42;&#x7C7B;&#x578B;&#xFF08;POST &#x7528;&#x4E8E;&#x63D0;&#x4EA4;&#x8868;&#x5355;&#x6570;&#x636E;&#xFF09;&#xFF0C;&#x6307;&#x793A;&#x64CD;&#x4F5C;&#xFF08;/&#x6CE8;&#x91CA;/&#x521B;&#x5EFA;&#xFF09;&#x548C;&#x53EF;&#x9009;&#x53C2;&#x6570;&#x7684; URL&#xFF08;photo_id &#x7684;&#x503C;&#x4E3A; 246&#xFF09;&#x4EE5;&#x53CA;&#x53D1;&#x9001;&#x8005;&#x4F7F;&#x7528;&#x7684; HTTP &#x534F;&#x8BAE;&#x7248;&#x672C;&#x3002;&#x6BCF;&#x4E2A;&#x6807;&#x9898;&#x884C;&#x7531;&#x4E00;&#x4E2A;&#x540D;&#x79F0;&#xFF08;&#x4F8B;&#x5982; Content-Length&#xFF09;&#x53CA;&#x5176;&#x540E;&#x7684;&#x503C;&#x7EC4;&#x6210;&#x3002;&#x5BF9;&#x4E8E;&#x6B64;&#x8BF7;&#x6C42;&#xFF0C;&#x6B63;&#x6587;&#x5305;&#x542B;&#x5176;&#x4ED6;&#x53C2;&#x6570;&#xFF08;&#x6CE8;&#x91CA;&#x548C;&#x4F18;&#x5148;&#x7EA7;&#xFF09;&#x3002;</p>
<h4 id="55-&#x793A;&#x4F8B;&#xFF1A;&#x592A;&#x591A;&#x7684;&#x7C7B;">5.5 &#x793A;&#x4F8B;&#xFF1A;&#x592A;&#x591A;&#x7684;&#x7C7B;</h4>
<p>&#x5B66;&#x751F;&#x6700;&#x5E38;&#x72AF;&#x7684;&#x9519;&#x8BEF;&#x662F;&#x5C06;&#x4ED6;&#x4EEC;&#x7684;&#x4EE3;&#x7801;&#x5206;&#x6210;&#x5927;&#x91CF;&#x7684;&#x6D45;&#x5C42;&#x7C7B;&#xFF0C;&#x8FD9;&#x5BFC;&#x81F4;&#x4E86;&#x7C7B;&#x4E4B;&#x95F4;&#x7684;&#x4FE1;&#x606F;&#x6CC4;&#x6F0F;&#x3002;&#x4E00;&#x4E2A;&#x56E2;&#x961F;&#x4F7F;&#x7528;&#x4E24;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x7C7B;&#x6765;&#x63A5;&#x6536; HTTP &#x8BF7;&#x6C42;&#x3002;&#x7B2C;&#x4E00;&#x7C7B;&#x5C06;&#x6765;&#x81EA;&#x7F51;&#x7EDC;&#x8FDE;&#x63A5;&#x7684;&#x8BF7;&#x6C42;&#x8BFB;&#x53D6;&#x4E3A;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x7B2C;&#x4E8C;&#x7C7B;&#x5C06;&#x5B57;&#x7B26;&#x4E32;&#x89E3;&#x6790;&#x3002;&#x8FD9;&#x662F;&#x65F6;&#x95F4;&#x5206;&#x89E3;&#x7684;&#x4E00;&#x4E2A;&#x793A;&#x4F8B;&#xFF08;&#x201C;&#x9996;&#x5148;&#x8BFB;&#x53D6;&#x8BF7;&#x6C42;&#xFF0C;&#x7136;&#x540E;&#x89E3;&#x6790;&#x5B83;&#x201D;&#xFF09;&#x3002;&#x53D1;&#x751F;&#x4FE1;&#x606F;&#x6CC4;&#x6F0F;&#x662F;&#x56E0;&#x4E3A;&#x65E0;&#x6CD5;&#x89E3;&#x6790;&#x5927;&#x91CF;&#x6D88;&#x606F;&#x5C31;&#x65E0;&#x6CD5;&#x8BFB;&#x53D6; HTTP &#x8BF7;&#x6C42;&#x3002;&#x4F8B;&#x5982;&#xFF0C;Content-Length &#x6807;&#x5934;&#x6307;&#x5B9A;&#x4E86;&#x8BF7;&#x6C42;&#x4E3B;&#x4F53;&#x7684;&#x957F;&#x5EA6;&#xFF0C;&#x56E0;&#x6B64;&#x5FC5;&#x987B;&#x5BF9;&#x6807;&#x5934;&#x8FDB;&#x884C;&#x89E3;&#x6790;&#x624D;&#x80FD;&#x8BA1;&#x7B97;&#x603B;&#x8BF7;&#x6C42;&#x957F;&#x5EA6;&#x3002;&#x7ED3;&#x679C;&#xFF0C;&#x8FD9;&#x4E24;&#x4E2A;&#x7C7B;&#x90FD;&#x9700;&#x8981;&#x4E86;&#x89E3; HTTP &#x8BF7;&#x6C42;&#x7684;&#x5927;&#x591A;&#x6570;&#x7ED3;&#x6784;&#xFF0C;&#x5E76;&#x4E14;&#x89E3;&#x6790;&#x4EE3;&#x7801;&#x5728;&#x4E24;&#x4E2A;&#x7C7B;&#x4E2D;&#x90FD;&#x662F;&#x91CD;&#x590D;&#x7684;&#x3002;</p>
<p>&#x7531;&#x4E8E;&#x8FD9;&#x4E9B;&#x7C7B;&#x5171;&#x4EAB;&#x5927;&#x91CF;&#x4FE1;&#x606F;&#xFF0C;&#x56E0;&#x6B64;&#x6700;&#x597D;&#x5C06;&#x5B83;&#x4EEC;&#x5408;&#x5E76;&#x4E3A;&#x4E00;&#x4E2A;&#x540C;&#x65F6;&#x5904;&#x7406;&#x8BF7;&#x6C42;&#x8BFB;&#x53D6;&#x548C;&#x89E3;&#x6790;&#x7684;&#x7C7B;&#x3002;&#x7531;&#x4E8E;&#x5B83;&#x5C06;&#x8BF7;&#x6C42;&#x683C;&#x5F0F;&#x7684;&#x6240;&#x6709;&#x77E5;&#x8BC6;&#x9694;&#x79BB;&#x5728;&#x4E00;&#x4E2A;&#x7C7B;&#x4E2D;&#xFF0C;&#x56E0;&#x6B64;&#x5B83;&#x63D0;&#x4F9B;&#x4E86;&#x66F4;&#x597D;&#x7684;&#x4FE1;&#x606F;&#x9690;&#x85CF;&#xFF0C;&#x5E76;&#x4E14;&#x8FD8;&#x4E3A;&#x8C03;&#x7528;&#x8005;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x66F4;&#x7B80;&#x5355;&#x7684;&#x63A5;&#x53E3;&#xFF08;&#x53EA;&#x662F;&#x4E00;&#x79CD;&#x8C03;&#x7528;&#x65B9;&#x6CD5;&#xFF09;&#x3002;</p>
<p>&#x6B64;&#x793A;&#x4F8B;&#x8BF4;&#x660E;&#x4E86;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x4E2D;&#x7684;&#x4E00;&#x822C;&#x4E3B;&#x9898;&#xFF1A;&#x901A;&#x5E38;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4F7F;&#x7C7B;&#x7A0D;&#x5927;&#x4E00;&#x4E9B;&#x6765;&#x6539;&#x5584;&#x4FE1;&#x606F;&#x9690;&#x85CF;&#x3002;&#x8FD9;&#x6837;&#x505A;&#x7684;&#x4E00;&#x4E2A;&#x539F;&#x56E0;&#x662F;&#x5C06;&#x4E0E;&#x7279;&#x5B9A;&#x529F;&#x80FD;&#x76F8;&#x5173;&#x7684;&#x6240;&#x6709;&#x4EE3;&#x7801;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x89E3;&#x6790; HTTP &#x8BF7;&#x6C42;&#xFF09;&#x7EC4;&#x5408;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x4EE5;&#x4FBF;&#x751F;&#x6210;&#x7684;&#x7C7B;&#x5305;&#x542B;&#x4E0E;&#x8BE5;&#x529F;&#x80FD;&#x76F8;&#x5173;&#x7684;&#x6240;&#x6709;&#x5185;&#x5BB9;&#x3002;&#x589E;&#x52A0;&#x7C7B;&#x5927;&#x5C0F;&#x7684;&#x7B2C;&#x4E8C;&#x4E2A;&#x539F;&#x56E0;&#x662F;&#x63D0;&#x9AD8;&#x63A5;&#x53E3;&#x7684;&#x7EA7;&#x522B;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4E0E;&#x5176;&#x4E3A;&#x8BA1;&#x7B97;&#x7684;&#x4E09;&#x4E2A;&#x6B65;&#x9AA4;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x6B65;&#x9AA4;&#x4F7F;&#x7528;&#x5355;&#x72EC;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x4E0D;&#x5982;&#x4F7F;&#x7528;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x6765;&#x6267;&#x884C;&#x6574;&#x4E2A;&#x8BA1;&#x7B97;&#x3002;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x7B80;&#x5316;&#x754C;&#x9762;&#x3002;&#x8FD9;&#x4E24;&#x4E2A;&#x4F18;&#x70B9;&#x90FD;&#x9002;&#x7528;&#x4E8E;&#x4E0A;&#x4E00;&#x6BB5;&#x7684;&#x793A;&#x4F8B;&#xFF1A;&#x7EC4;&#x5408;&#x7C7B;&#x5C06;&#x4E0E;&#x89E3;&#x6790; HTTP &#x8BF7;&#x6C42;&#x76F8;&#x5173;&#x7684;&#x6240;&#x6709;&#x4EE3;&#x7801;&#x7EC4;&#x5408;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x5E76;&#x4E14;&#x7528;&#x4E00;&#x4E2A;&#x66FF;&#x6362;&#x4E86;&#x4E24;&#x4E2A;&#x5916;&#x90E8;&#x53EF;&#x89C1;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x8F83;&#x5927;&#x7684;&#x7C7B;&#x7684;&#x6982;&#x5FF5;&#x8003;&#x8651;&#x5F97;&#x592A;&#x8FDC;&#xFF08;&#x4F8B;&#x5982;&#x6574;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x5355;&#x4E2A;&#x7C7B;&#xFF09;&#x3002;&#x7B2C; 9 &#x7AE0;&#x5C06;&#x8BA8;&#x8BBA;&#x5C06;&#x4EE3;&#x7801;&#x5206;&#x6210;&#x591A;&#x4E2A;&#x8F83;&#x5C0F;&#x7684;&#x7C7B;&#x7684;&#x5408;&#x7406;&#x6761;&#x4EF6;&#x3002;</p>
<h4 id="56--&#x793A;&#x4F8B;&#xFF1A;http-&#x53C2;&#x6570;&#x5904;&#x7406;">5.6  &#x793A;&#x4F8B;&#xFF1A;HTTP &#x53C2;&#x6570;&#x5904;&#x7406;</h4>
<p>&#x670D;&#x52A1;&#x5668;&#x6536;&#x5230; HTTP &#x8BF7;&#x6C42;&#x540E;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x9700;&#x8981;&#x8BBF;&#x95EE;&#x8BE5;&#x8BF7;&#x6C42;&#x4E2D;&#x7684;&#x67D0;&#x4E9B;&#x4FE1;&#x606F;&#x3002;&#x56FE; 5.1 &#x4E2D;&#x5904;&#x7406;&#x8BF7;&#x6C42;&#x7684;&#x4EE3;&#x7801;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x77E5;&#x9053; photo_id &#x53C2;&#x6570;&#x7684;&#x503C;&#x3002;&#x53C2;&#x6570;&#x53EF;&#x4EE5;&#x5728;&#x8BF7;&#x6C42;&#x7684;&#x7B2C;&#x4E00;&#x884C;&#x4E2D;&#x6307;&#x5B9A;&#xFF08;&#x56FE; 5.1 &#x4E2D;&#x7684; photo_id&#xFF09;&#xFF0C;&#x6709;&#x65F6;&#x4E5F;&#x53EF;&#x4EE5;&#x5728;&#x6B63;&#x6587;&#x4E2D;&#x6307;&#x5B9A;&#xFF08;&#x56FE; 5.1 &#x4E2D;&#x7684;&#x6CE8;&#x91CA;&#x548C;&#x4F18;&#x5148;&#x7EA7;&#xFF09;&#x3002;&#x6BCF;&#x4E2A;&#x53C2;&#x6570;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x540D;&#x79F0;&#x548C;&#x4E00;&#x4E2A;&#x503C;&#x3002;&#x53C2;&#x6570;&#x7684;&#x503C;&#x4F7F;&#x7528;&#x4E00;&#x79CD;&#x79F0;&#x4E3A; URL &#x7F16;&#x7801;&#x7684;&#x7279;&#x6B8A;&#x7F16;&#x7801;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5728;&#x56FE; 5.1 &#x4E2D;&#x7684;&#x6CE8;&#x91CA;&#x503C;&#x4E2D;&#xFF0C;&#x201C; +&#x201D;&#x4EE3;&#x8868;&#x7A7A;&#x683C;&#x5B57;&#x7B26;&#xFF0C;&#x201C;&#xFF05;21&#x201D;&#x4EE3;&#x66FF;&#x201C;&#xFF01;&#x201D;&#x3002;&#x4E3A;&#x4E86;&#x5904;&#x7406;&#x8BF7;&#x6C42;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x5C06;&#x9700;&#x8981;&#x67D0;&#x4E9B;&#x53C2;&#x6570;&#x7684;&#x503C;&#xFF0C;&#x5E76;&#x4E14;&#x5E0C;&#x671B;&#x5B83;&#x4EEC;&#x91C7;&#x7528;&#x672A;&#x7F16;&#x7801;&#x7684;&#x5F62;&#x5F0F;&#x3002;</p>
<p>&#x5173;&#x4E8E;&#x53C2;&#x6570;&#x5904;&#x7406;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x5B66;&#x751F;&#x9879;&#x76EE;&#x90FD;&#x505A;&#x51FA;&#x4E86;&#x4E24;&#x4E2A;&#x4E0D;&#x9519;&#x7684;&#x9009;&#x62E9;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x4ED6;&#x4EEC;&#x8BA4;&#x8BC6;&#x5230;&#x670D;&#x52A1;&#x5668;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E0D;&#x5728;&#x4E4E;&#x662F;&#x5426;&#x5728;&#x6807;&#x9898;&#x884C;&#x6216;&#x8BF7;&#x6C42;&#x7684;&#x6B63;&#x6587;&#x4E2D;&#x6307;&#x5B9A;&#x4E86;&#x53C2;&#x6570;&#xFF0C;&#x56E0;&#x6B64;&#x4ED6;&#x4EEC;&#x5BF9;&#x8C03;&#x7528;&#x8005;&#x9690;&#x85CF;&#x4E86;&#x8FD9;&#x79CD;&#x533A;&#x522B;&#xFF0C;&#x5E76;&#x5C06;&#x4E24;&#x4E2A;&#x4F4D;&#x7F6E;&#x7684;&#x53C2;&#x6570;&#x5408;&#x5E76;&#x5728;&#x4E00;&#x8D77;&#x3002;&#x5176;&#x6B21;&#xFF0C;&#x4ED6;&#x4EEC;&#x9690;&#x85CF;&#x4E86; URL &#x7F16;&#x7801;&#x7684;&#x77E5;&#x8BC6;&#xFF1A;HTTP &#x89E3;&#x6790;&#x5668;&#x5728;&#x5C06;&#x53C2;&#x6570;&#x503C;&#x8FD4;&#x56DE;&#x5230; Web &#x670D;&#x52A1;&#x5668;&#x4E4B;&#x524D;&#x5148;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x89E3;&#x7801;&#xFF0C;&#x4EE5;&#x4FBF;&#x56FE; 5.1 &#x4E2D;&#x7684; comment &#x53C2;&#x6570;&#x7684;&#x503C;&#x5C06;&#x8FD4;&#x56DE; &#x201C;What a cute baby!&#x201D;&#xFF0C;&#x800C;&#x4E0D;&#x662F; &#x201C;What+a+cute+baby%21&#x201D;&#xFF09;&#x3002;&#x5728;&#x8FD9;&#x4E24;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4FE1;&#x606F;&#x9690;&#x85CF;&#x90FD;&#x4F7F;&#x4F7F;&#x7528; HTTP &#x6A21;&#x5757;&#x7684;&#x4EE3;&#x7801;&#x7684; API &#x66F4;&#x52A0;&#x7B80;&#x5355;&#x3002;</p>
<p>&#x4F46;&#x662F;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x5B66;&#x751F;&#x4F7F;&#x7528;&#x7684;&#x754C;&#x9762;&#x8FD4;&#x56DE;&#x7684;&#x53C2;&#x6570;&#x592A;&#x6D45;&#xFF0C;&#x8FD9;&#x5BFC;&#x81F4;&#x4E22;&#x5931;&#x4FE1;&#x606F;&#x9690;&#x85CF;&#x7684;&#x673A;&#x4F1A;&#x3002;&#x5927;&#x591A;&#x6570;&#x9879;&#x76EE;&#x4F7F;&#x7528; HTTPRequest &#x7C7B;&#x578B;&#x7684;&#x5BF9;&#x8C61;&#x6765;&#x4FDD;&#x5B58;&#x5DF2;&#x89E3;&#x6790;&#x7684; HTTP &#x8BF7;&#x6C42;&#xFF0C;&#x5E76;&#x4E14; HTTPRequest &#x7C7B;&#x5177;&#x6709;&#x4E00;&#x79CD;&#x7C7B;&#x4F3C;&#x4E8E;&#x4EE5;&#x4E0B;&#x65B9;&#x6CD5;&#x7684;&#x5355;&#x4E2A;&#x65B9;&#x6CD5;&#x6765;&#x8FD4;&#x56DE;&#x53C2;&#x6570;&#xFF1A;</p>
<pre><code>public Map&lt;String, String&gt; getParams() {
    return this.params;
}
</code></pre><p>&#x8BE5;&#x65B9;&#x6CD5;&#x4E0D;&#x662F;&#x8FD4;&#x56DE;&#x5355;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x800C;&#x662F;&#x8FD4;&#x56DE;&#x5185;&#x90E8;&#x7528;&#x4E8E;&#x5B58;&#x50A8;&#x6240;&#x6709;&#x53C2;&#x6570;&#x7684;&#x6620;&#x5C04;&#x7684;&#x5F15;&#x7528;&#x3002;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x662F;&#x6D45;&#x5C42;&#x7684;&#xFF0C;&#x5B83;&#x516C;&#x5F00;&#x4E86; HTTPRequest &#x7C7B;&#x7528;&#x6765;&#x5B58;&#x50A8;&#x53C2;&#x6570;&#x7684;&#x5185;&#x90E8;&#x8868;&#x793A;&#x3002;&#x5BF9;&#x8BE5;&#x8868;&#x793A;&#x7684;&#x4EFB;&#x4F55;&#x66F4;&#x6539;&#x90FD;&#x5C06;&#x5BFC;&#x81F4;&#x63A5;&#x53E3;&#x7684;&#x66F4;&#x6539;&#xFF0C;&#x8FD9;&#x5C06;&#x9700;&#x8981;&#x5BF9;&#x6240;&#x6709;&#x8C03;&#x7528;&#x8005;&#x8FDB;&#x884C;&#x4FEE;&#x6539;&#x3002;&#x5728;&#x4FEE;&#x6539;&#x5B9E;&#x73B0;&#x65F6;&#xFF0C;&#x66F4;&#x6539;&#x901A;&#x5E38;&#x6D89;&#x53CA;&#x5173;&#x952E;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x8868;&#x793A;&#x7684;&#x66F4;&#x6539;(&#x4F8B;&#x5982;&#xFF0C;&#x4E3A;&#x4E86;&#x63D0;&#x9AD8;&#x6027;&#x80FD;)&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5C3D;&#x91CF;&#x907F;&#x514D;&#x66B4;&#x9732;&#x5185;&#x90E8;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x662F;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x8FD8;&#x4E3A;&#x8C03;&#x7528;&#x8005;&#x63D0;&#x4F9B;&#x4E86;&#x66F4;&#x591A;&#x7684;&#x5DE5;&#x4F5C;:&#x8C03;&#x7528;&#x8005;&#x5FC5;&#x987B;&#x9996;&#x5148;&#x8C03;&#x7528; getParams&#xFF0C;&#x7136;&#x540E;&#x5FC5;&#x987B;&#x8C03;&#x7528;&#x53E6;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x6765;&#x4ECE;&#x6620;&#x5C04;&#x4E2D;&#x68C0;&#x7D22;&#x7279;&#x5B9A;&#x7684;&#x53C2;&#x6570;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x8C03;&#x7528;&#x8005;&#x5FC5;&#x987B;&#x610F;&#x8BC6;&#x5230;&#x4ED6;&#x4EEC;&#x4E0D;&#x5E94;&#x8BE5;&#x4FEE;&#x6539; getParams &#x8FD4;&#x56DE;&#x7684;&#x6620;&#x5C04;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4F1A;&#x5F71;&#x54CD; HTTPRequest &#x7684;&#x5185;&#x90E8;&#x72B6;&#x6001;&#x3002;</p>
<p>&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x7528;&#x4E8E;&#x68C0;&#x7D22;&#x53C2;&#x6570;&#x503C;&#x7684;&#x66F4;&#x597D;&#x7684;&#x63A5;&#x53E3;&#xFF1A;</p>
<pre><code>public String getParameter(String name) { ... }

public int getIntParameter(String name) { ... }
</code></pre><p>getParameter &#x4EE5;&#x5B57;&#x7B26;&#x4E32;&#x5F62;&#x5F0F;&#x8FD4;&#x56DE;&#x53C2;&#x6570;&#x503C;&#x3002;&#x5B83;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x6BD4;&#x4E0A;&#x9762;&#x7684; getParams &#x66F4;&#x6DF1;&#x7684;&#x63A5;&#x53E3;&#xFF1B;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x5B83;&#x9690;&#x85CF;&#x4E86;&#x53C2;&#x6570;&#x7684;&#x5185;&#x90E8;&#x8868;&#x793A;&#x3002;getIntParameter &#x5C06;&#x53C2;&#x6570;&#x7684;&#x503C;&#x4ECE; HTTP &#x8BF7;&#x6C42;&#x4E2D;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x5F62;&#x5F0F;&#x8F6C;&#x6362;&#x4E3A;&#x6574;&#x6570;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x56FE; 5.1 &#x4E2D;&#x7684; photo_id &#x53C2;&#x6570;&#xFF09;&#x3002;&#x8FD9;&#x4F7F;&#x8C03;&#x7528;&#x8005;&#x4E0D;&#x5FC5;&#x5355;&#x72EC;&#x8BF7;&#x6C42;&#x5B57;&#x7B26;&#x4E32;&#x5230;&#x6574;&#x6570;&#x7684;&#x8F6C;&#x6362;&#xFF0C;&#x5E76;&#x4E14;&#x5BF9;&#x8C03;&#x7528;&#x8005;&#x9690;&#x85CF;&#x4E86;&#x8BE5;&#x673A;&#x5236;&#x3002;&#x5982;&#x679C;&#x9700;&#x8981;&#xFF0C;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x5176;&#x4ED6;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x7684;&#x5176;&#x4ED6;&#x65B9;&#x6CD5;&#xFF0C;&#x4F8B;&#x5982; getDoubleParameter&#x3002;&#xFF08;&#x5982;&#x679C;&#x6240;&#x9700;&#x7684;&#x53C2;&#x6570;&#x4E0D;&#x5B58;&#x5728;&#xFF0C;&#x6216;&#x8005;&#x65E0;&#x6CD5;&#x5C06;&#x5176;&#x8F6C;&#x6362;&#x4E3A;&#x6240;&#x8BF7;&#x6C42;&#x7684;&#x7C7B;&#x578B;&#xFF0C;&#x5219;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x65B9;&#x6CD5;&#x90FD;&#x5C06;&#x5F15;&#x53D1;&#x5F02;&#x5E38;&#xFF1B;&#x4E0A;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x4E2D;&#x7701;&#x7565;&#x4E86;&#x5F02;&#x5E38;&#x58F0;&#x660E;&#xFF09;&#x3002;</p>
<h4 id="57-&#x793A;&#x4F8B;&#xFF1A;http-&#x54CD;&#x5E94;&#x4E2D;&#x7684;&#x9ED8;&#x8BA4;&#x503C;">5.7 &#x793A;&#x4F8B;&#xFF1A;HTTP &#x54CD;&#x5E94;&#x4E2D;&#x7684;&#x9ED8;&#x8BA4;&#x503C;</h4>
<p>HTTP &#x9879;&#x76EE;&#x8FD8;&#x5FC5;&#x987B;&#x63D0;&#x4F9B;&#x5BF9;&#x751F;&#x6210; HTTP &#x54CD;&#x5E94;&#x7684;&#x652F;&#x6301;&#x3002;&#x5B66;&#x751F;&#x5728;&#x8BE5;&#x9886;&#x57DF;&#x4E2D;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x9519;&#x8BEF;&#x662F;&#x9ED8;&#x8BA4;&#x503C;&#x4E0D;&#x8DB3;&#x3002;&#x6BCF;&#x4E2A; HTTP &#x54CD;&#x5E94;&#x5FC5;&#x987B;&#x6307;&#x5B9A;&#x4E00;&#x4E2A; HTTP &#x534F;&#x8BAE;&#x7248;&#x672C;&#x3002;&#x4E00;&#x4E2A;&#x56E2;&#x961F;&#x8981;&#x6C42;&#x547C;&#x53EB;&#x8005;&#x5728;&#x521B;&#x5EFA;&#x54CD;&#x5E94;&#x5BF9;&#x8C61;&#x65F6;&#x660E;&#x786E;&#x6307;&#x5B9A;&#x6B64;&#x7248;&#x672C;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x54CD;&#x5E94;&#x7248;&#x672C;&#x5FC5;&#x987B;&#x4E0E;&#x8BF7;&#x6C42;&#x5BF9;&#x8C61;&#x4E2D;&#x7684;&#x7248;&#x672C;&#x76F8;&#x5BF9;&#x5E94;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x53D1;&#x9001;&#x54CD;&#x5E94;&#x65F6;&#x5FC5;&#x987B;&#x5DF2;&#x5C06;&#x8BF7;&#x6C42;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#x4F20;&#x9012;&#xFF08;&#x5B83;&#x6307;&#x793A;&#x5C06;&#x54CD;&#x5E94;&#x53D1;&#x9001;&#x5230;&#x4F55;&#x5904;&#xFF09;&#x3002;&#x56E0;&#x6B64;&#xFF0C;HTTP &#x7C7B;&#x81EA;&#x52A8;&#x63D0;&#x4F9B;&#x54CD;&#x5E94;&#x7248;&#x672C;&#x66F4;&#x4E3A;&#x6709;&#x610F;&#x4E49;&#x3002;&#x8C03;&#x7528;&#x8005;&#x4E0D;&#x592A;&#x53EF;&#x80FD;&#x77E5;&#x9053;&#x8981;&#x6307;&#x5B9A;&#x54EA;&#x4E2A;&#x7248;&#x672C;&#xFF0C;&#x5E76;&#x4E14;&#x5982;&#x679C;&#x8C03;&#x7528;&#x8005;&#x786E;&#x5B9E;&#x6307;&#x5B9A;&#x4E86;&#x4E00;&#x4E2A;&#x503C;&#xFF0C;&#x5219;&#x53EF;&#x80FD;&#x5BFC;&#x81F4; HTTP &#x5E93;&#x548C;&#x8C03;&#x7528;&#x8005;&#x4E4B;&#x95F4;&#x7684;&#x4FE1;&#x606F;&#x6CC4;&#x6F0F;&#x3002;HTTP &#x54CD;&#x5E94;&#x8FD8;&#x5305;&#x62EC;&#x4E00;&#x4E2A; Date &#x6807;&#x5934;&#xFF0C;&#x7528;&#x4E8E;&#x6307;&#x5B9A;&#x53D1;&#x9001;&#x54CD;&#x5E94;&#x7684;&#x65F6;&#x95F4;&#xFF1B;HTTP &#x5E93;&#x4E5F;&#x5E94;&#x8BE5;&#x4E3A;&#x6B64;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x5408;&#x7406;&#x7684;&#x9ED8;&#x8BA4;&#x503C;&#x3002;</p>
<p>HTTP &#x9879;&#x76EE;&#x8FD8;&#x5FC5;&#x987B;&#x63D0;&#x4F9B;&#x5BF9;&#x751F;&#x6210; HTTP &#x54CD;&#x5E94;&#x7684;&#x652F;&#x6301;&#x3002;&#x5B66;&#x751F;&#x5728;&#x8BE5;&#x9886;&#x57DF;&#x4E2D;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x9519;&#x8BEF;&#x662F;&#x9ED8;&#x8BA4;&#x503C;&#x4E0D;&#x8DB3;&#x3002;&#x6BCF;&#x4E2A; HTTP &#x54CD;&#x5E94;&#x5FC5;&#x987B;&#x6307;&#x5B9A;&#x4E00;&#x4E2A; HTTP &#x534F;&#x8BAE;&#x7248;&#x672C;&#x3002;&#x4E00;&#x4E2A;&#x56E2;&#x961F;&#x8981;&#x6C42;&#x547C;&#x53EB;&#x8005;&#x5728;&#x521B;&#x5EFA;&#x54CD;&#x5E94;&#x5BF9;&#x8C61;&#x65F6;&#x660E;&#x786E;&#x6307;&#x5B9A;&#x6B64;&#x7248;&#x672C;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x54CD;&#x5E94;&#x7248;&#x672C;&#x5FC5;&#x987B;&#x4E0E;&#x8BF7;&#x6C42;&#x5BF9;&#x8C61;&#x4E2D;&#x7684;&#x7248;&#x672C;&#x76F8;&#x5BF9;&#x5E94;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x53D1;&#x9001;&#x54CD;&#x5E94;&#x65F6;&#x5FC5;&#x987B;&#x5DF2;&#x5C06;&#x8BF7;&#x6C42;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#x4F20;&#x9012;&#xFF08;&#x5B83;&#x6307;&#x793A;&#x5C06;&#x54CD;&#x5E94;&#x53D1;&#x9001;&#x5230;&#x4F55;&#x5904;&#xFF09;&#x3002;&#x56E0;&#x6B64;&#xFF0C;HTTP &#x7C7B;&#x81EA;&#x52A8;&#x63D0;&#x4F9B;&#x54CD;&#x5E94;&#x7248;&#x672C;&#x66F4;&#x4E3A;&#x6709;&#x610F;&#x4E49;&#x3002;&#x8C03;&#x7528;&#x8005;&#x4E0D;&#x592A;&#x53EF;&#x80FD;&#x77E5;&#x9053;&#x8981;&#x6307;&#x5B9A;&#x54EA;&#x4E2A;&#x7248;&#x672C;&#xFF0C;&#x5E76;&#x4E14;&#x5982;&#x679C;&#x8C03;&#x7528;&#x8005;&#x786E;&#x5B9E;&#x6307;&#x5B9A;&#x4E86;&#x4E00;&#x4E2A;&#x503C;&#xFF0C;&#x5219;&#x53EF;&#x80FD;&#x5BFC;&#x81F4; HTTP &#x5E93;&#x548C;&#x8C03;&#x7528;&#x8005;&#x4E4B;&#x95F4;&#x7684;&#x4FE1;&#x606F;&#x6CC4;&#x6F0F;&#x3002;HTTP &#x54CD;&#x5E94;&#x8FD8;&#x5305;&#x62EC;&#x4E00;&#x4E2A; Date &#x6807;&#x5934;&#xFF0C;&#x7528;&#x4E8E;&#x6307;&#x5B9A;&#x53D1;&#x9001;&#x54CD;&#x5E94;&#x7684;&#x65F6;&#x95F4;&#xFF1B;HTTP &#x5E93;&#x4E5F;&#x5E94;&#x8BE5;&#x4E3A;&#x6B64;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x5408;&#x7406;&#x7684;&#x9ED8;&#x8BA4;&#x503C;&#x3002;</p>
<p>&#x53EA;&#x8981;&#x6709;&#x53EF;&#x80FD;&#xFF0C;&#x7C7B;&#x5C31;&#x5E94;&#x8BE5;&#x201C;&#x505A;&#x6B63;&#x786E;&#x7684;&#x4E8B;&#x201D;&#xFF0C;&#x800C;&#x65E0;&#x9700;&#x660E;&#x786E;&#x8981;&#x6C42;&#x3002;&#x9ED8;&#x8BA4;&#x503C;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x3002;&#x7B2C; 26 &#x9875;&#x4E0A;&#x7684; Java I/O &#x793A;&#x4F8B;&#x4EE5;&#x8D1F;&#x9762;&#x65B9;&#x5F0F;&#x8BF4;&#x660E;&#x4E86;&#x8FD9;&#x4E00;&#x70B9;&#x3002;&#x666E;&#x904D;&#x5E0C;&#x671B;&#x5728;&#x6587;&#x4EF6; I/O &#x4E2D;&#x7F13;&#x51B2;&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;&#x6CA1;&#x6709;&#x4EBA;&#x9700;&#x8981;&#x660E;&#x786E;&#x8981;&#x6C42;&#x5B83;&#xFF0C;&#x751A;&#x81F3;&#x4E0D;&#x77E5;&#x9053;&#x5B83;&#x7684;&#x5B58;&#x5728;&#x3002;I/O &#x7C7B;&#x5E94;&#x8BE5;&#x505A;&#x6B63;&#x786E;&#x7684;&#x4E8B;&#x60C5;&#x5E76;&#x81EA;&#x52A8;&#x63D0;&#x4F9B;&#x5B83;&#x3002;&#x6700;&#x597D;&#x7684;&#x529F;&#x80FD;&#x662F;&#x60A8;&#x751A;&#x81F3;&#x4E0D;&#x77E5;&#x9053;&#x5B83;&#x4EEC;&#x5B58;&#x5728;&#x7684;&#x529F;&#x80FD;&#x3002;</p>
<p>&#x5982;&#x679C;&#x5E38;&#x7528;&#x529F;&#x80FD;&#x7684; API &#x8FEB;&#x4F7F;&#x7528;&#x6237;&#x4E86;&#x89E3;&#x5F88;&#x5C11;&#x4F7F;&#x7528;&#x7684;&#x5176;&#x4ED6;&#x529F;&#x80FD;&#xFF0C;&#x5219;&#x8FD9;&#x4F1A;&#x589E;&#x52A0;&#x4E0D;&#x9700;&#x8981;&#x5F88;&#x5C11;&#x4F7F;&#x7528;&#x529F;&#x80FD;&#x7684;&#x7528;&#x6237;&#x7684;&#x8BA4;&#x77E5;&#x8D1F;&#x62C5;</p>
<h4 id="58-&#x4FE1;&#x606F;&#x9690;&#x85CF;&#x5728;&#x7C7B;&#x4E2D;">5.8 &#x4FE1;&#x606F;&#x9690;&#x85CF;&#x5728;&#x7C7B;&#x4E2D;</h4>
<p>&#x672C;&#x7AE0;&#x4E2D;&#x7684;&#x793A;&#x4F8B;&#x7740;&#x91CD;&#x4E8E;&#x4FE1;&#x606F;&#x9690;&#x85CF;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4E0E;&#x7C7B;&#x7684;&#x5916;&#x90E8;&#x53EF;&#x89C1; API &#x6709;&#x5173;&#xFF0C;&#x4F46;&#x662F;&#x4FE1;&#x606F;&#x9690;&#x85CF;&#x4E5F;&#x53EF;&#x4EE5;&#x5E94;&#x7528;&#x4E8E;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x5176;&#x4ED6;&#x7EA7;&#x522B;&#xFF0C;&#x4F8B;&#x5982;&#x7C7B;&#x5185;&#x3002;&#x5C1D;&#x8BD5;&#x5728;&#x4E00;&#x4E2A;&#x7C7B;&#x4E2D;&#x8BBE;&#x8BA1;&#x79C1;&#x6709;&#x65B9;&#x6CD5;&#xFF0C;&#x4EE5;&#x4FBF;&#x6BCF;&#x4E2A;&#x65B9;&#x6CD5;&#x90FD;&#x5C01;&#x88C5;&#x4E00;&#x4E9B;&#x4FE1;&#x606F;&#x6216;&#x529F;&#x80FD;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x9690;&#x85CF;&#x5728;&#x7C7B;&#x7684;&#x5176;&#x4F59;&#x90E8;&#x5206;&#x4E2D;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x8BF7;&#x5C3D;&#x91CF;&#x51CF;&#x5C11;&#x4F7F;&#x7528;&#x6BCF;&#x4E2A;&#x5B9E;&#x4F8B;&#x53D8;&#x91CF;&#x7684;&#x4F4D;&#x7F6E;&#x6570;&#x91CF;&#x3002;&#x6709;&#x4E9B;&#x53D8;&#x91CF;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x5728;&#x6574;&#x4E2A;&#x7C7B;&#x4E2D;&#x5E7F;&#x6CDB;&#x4F7F;&#x7528;&#xFF0C;&#x4F46;&#x662F;&#x5176;&#x4ED6;&#x53D8;&#x91CF;&#x53EF;&#x80FD;&#x53EA;&#x9700;&#x8981;&#x5728;&#x5C11;&#x6570;&#x5730;&#x65B9;&#x4F7F;&#x7528;&#xFF1B;&#x5982;&#x679C;&#x53EF;&#x4EE5;&#x51CF;&#x5C11;&#x4F7F;&#x7528;&#x53D8;&#x91CF;&#x7684;&#x4F4D;&#x7F6E;&#x7684;&#x6570;&#x91CF;&#xFF0C;&#x5219;&#x5C06;&#x6D88;&#x9664;&#x7C7B;&#x5185;&#x7684;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x5E76;&#x964D;&#x4F4E;&#x5176;&#x590D;&#x6742;&#x6027;</p>
<h4 id="59--&#x8D70;&#x5F97;&#x592A;&#x8FDC;">5.9  &#x8D70;&#x5F97;&#x592A;&#x8FDC;</h4>
<p>&#x4EC5;&#x5F53;&#x5728;&#x5176;&#x6A21;&#x5757;&#x5916;&#x90E8;&#x4E0D;&#x9700;&#x8981;&#x9690;&#x85CF;&#x4FE1;&#x606F;&#x65F6;&#xFF0C;&#x9690;&#x85CF;&#x4FE1;&#x606F;&#x624D;&#x6709;&#x610F;&#x4E49;&#x3002;&#x5982;&#x679C;&#x6A21;&#x5757;&#x5916;&#x90E8;&#x9700;&#x8981;&#x8BE5;&#x4FE1;&#x606F;&#xFF0C;&#x5219;&#x4E0D;&#x5F97;&#x9690;&#x85CF;&#x5B83;&#x3002;&#x5047;&#x8BBE;&#x6A21;&#x5757;&#x7684;&#x6027;&#x80FD;&#x53D7;&#x67D0;&#x4E9B;&#x914D;&#x7F6E;&#x53C2;&#x6570;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x5E76;&#x4E14;&#x6A21;&#x5757;&#x7684;&#x4E0D;&#x540C;&#x7528;&#x9014;&#x5C06;&#x9700;&#x8981;&#x5BF9;&#x53C2;&#x6570;&#x8FDB;&#x884C;&#x4E0D;&#x540C;&#x7684;&#x8BBE;&#x7F6E;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5C06;&#x53C2;&#x6570;&#x66B4;&#x9732;&#x5728;&#x6A21;&#x5757;&#x7684;&#x754C;&#x9762;&#x4E2D;&#x5F88;&#x91CD;&#x8981;&#xFF0C;&#x4EE5;&#x4FBF;&#x53EF;&#x4EE5;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x9002;&#x5F53;&#x7684;&#x65CB;&#x8F6C;&#x3002;&#x4F5C;&#x4E3A;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x5E08;&#xFF0C;&#x60A8;&#x7684;&#x76EE;&#x6807;&#x5E94;&#x8BE5;&#x662F;&#x6700;&#x5927;&#x7A0B;&#x5EA6;&#x5730;&#x51CF;&#x5C11;&#x6A21;&#x5757;&#x5916;&#x90E8;&#x6240;&#x9700;&#x7684;&#x4FE1;&#x606F;&#x91CF;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x6A21;&#x5757;&#x53EF;&#x4EE5;&#x81EA;&#x52A8;&#x8C03;&#x6574;&#x5176;&#x914D;&#x7F6E;&#xFF0C;&#x90A3;&#x5C06;&#x6BD4;&#x516C;&#x5F00;&#x914D;&#x7F6E;&#x53C2;&#x6570;&#x66F4;&#x597D;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x91CD;&#x8981;&#x7684;&#x662F;&#x8981;&#x8BC6;&#x522B;&#x6A21;&#x5757;&#x5916;&#x90E8;&#x9700;&#x8981;&#x54EA;&#x4E9B;&#x4FE1;&#x606F;&#xFF0C;&#x5E76;&#x786E;&#x4FDD;&#x5C06;&#x5176;&#x516C;&#x5F00;</p>
<h4 id="510-&#x7ED3;&#x8BBA;">5.10 &#x7ED3;&#x8BBA;</h4>
<p>&#x4FE1;&#x606F;&#x9690;&#x85CF;&#x548C;&#x6DF1;&#x5C42;&#x6A21;&#x5757;&#x5BC6;&#x5207;&#x76F8;&#x5173;&#x3002;&#x5982;&#x679C;&#x6A21;&#x5757;&#x9690;&#x85CF;&#x4E86;&#x5F88;&#x591A;&#x4FE1;&#x606F;&#xFF0C;&#x5219;&#x5F80;&#x5F80;&#x4F1A;&#x589E;&#x52A0;&#x6A21;&#x5757;&#x63D0;&#x4F9B;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x540C;&#x65F6;&#x8FD8;&#x4F1A;&#x51CF;&#x5C11;&#x5176;&#x63A5;&#x53E3;&#x3002;&#x8FD9;&#x4F7F;&#x6A21;&#x5757;&#x66F4;&#x6DF1;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x6A21;&#x5757;&#x6CA1;&#x6709;&#x9690;&#x85CF;&#x592A;&#x591A;&#x4FE1;&#x606F;&#xFF0C;&#x5219;&#x5B83;&#x8981;&#x4E48;&#x529F;&#x80FD;&#x4E0D;&#x591A;&#xFF0C;&#x8981;&#x4E48;&#x63A5;&#x53E3;&#x590D;&#x6742;&#x3002;&#x65E0;&#x8BBA;&#x54EA;&#x79CD;&#x65B9;&#x5F0F;&#xFF0C;&#x6A21;&#x5757;&#x90FD;&#x662F;&#x6D45;&#x7684;&#x3002;</p>
<p>&#x5C06;&#x7CFB;&#x7EDF;&#x5206;&#x89E3;&#x4E3A;&#x6A21;&#x5757;&#x65F6;&#xFF0C;&#x8BF7;&#x5C3D;&#x91CF;&#x4E0D;&#x8981;&#x53D7;&#x8FD0;&#x884C;&#x65F6;&#x64CD;&#x4F5C;&#x987A;&#x5E8F;&#x7684;&#x5F71;&#x54CD;&#x3002;&#x8FD9;&#x5C06;&#x4F7F;&#x60A8;&#x6CBF;&#x7740;&#x65F6;&#x95F4;&#x5206;&#x89E3;&#x7684;&#x8DEF;&#x5F84;&#x524D;&#x8FDB;&#xFF0C;&#x8FD9;&#x5C06;&#x5BFC;&#x81F4;&#x4FE1;&#x606F;&#x6CC4;&#x6F0F;&#x548C;&#x6A21;&#x5757;&#x6D45;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x8BF7;&#x8003;&#x8651;&#x6267;&#x884C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4EFB;&#x52A1;&#x6240;&#x9700;&#x7684;&#x4E0D;&#x540C;&#x77E5;&#x8BC6;&#xFF0C;&#x5E76;&#x8BBE;&#x8BA1;&#x6BCF;&#x4E2A;&#x6A21;&#x5757;&#x4EE5;&#x5C01;&#x88C5;&#x8FD9;&#x4E9B;&#x77E5;&#x8BC6;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x6216;&#x51E0;&#x4E2A;&#x3002;&#x8FD9;&#x5C06;&#x4EA7;&#x751F;&#x5E26;&#x6709;&#x6DF1;&#x8272;&#x6A21;&#x5757;&#x7684;&#x5E72;&#x51C0;&#x7B80;&#x5355;&#x7684;&#x8BBE;&#x8BA1;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="ch4.html" class="navigation navigation-prev " aria-label="Previous page: 第四章：模块应该是深的">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="ch6.html" class="navigation navigation-next " aria-label="Next page: 第六章：通用模块更深入">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第五章：信息隐藏(和泄露)","level":"1.8","depth":1,"next":{"title":"第六章：通用模块更深入","level":"1.9","depth":1,"path":"docs/ch6.md","ref":"./docs/ch6.md","articles":[]},"previous":{"title":"第四章：模块应该是深的","level":"1.7","depth":1,"path":"docs/ch4.md","ref":"./docs/ch4.md","articles":[]},"dir":"ltr"},"config":{"plugins":["back-to-top-button","expandable-chapters-small","page-toc-button","livereload"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"livereload":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"page-toc-button":{},"back-to-top-button":{},"expandable-chapters-small":{},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"John Ousterhout","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"软件设计哲学","language":"zh-hans","gitbook":"*","description":"书中讨论了软件设计的主题：如何将复杂的软件系统分解成可以相对独立实现的模块(如类和方法)"},"file":{"path":"docs/ch5.md","mtime":"2020-08-06T16:26:19.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-02-06T04:55:41.669Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-page-toc-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

