
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第六章：通用模块更深入 · 软件设计哲学</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="John Ousterhout">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-page-toc-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="ch7.html" />
    
    
    <link rel="prev" href="ch5.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    首页
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="preface">
            
                <span>
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="ch1.html">
            
                <a href="ch1.html">
            
                    
                    第一章：介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="ch2.html">
            
                <a href="ch2.html">
            
                    
                    第二章：复杂性的本质
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="ch3.html">
            
                <a href="ch3.html">
            
                    
                    第三章：工作代码是不够的（战略与战术编程）
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="ch4.html">
            
                <a href="ch4.html">
            
                    
                    第四章：模块应该是深的
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="ch5.html">
            
                <a href="ch5.html">
            
                    
                    第五章：信息隐藏(和泄露)
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.9" data-path="ch6.html">
            
                <a href="ch6.html">
            
                    
                    第六章：通用模块更深入
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="ch7.html">
            
                <a href="ch7.html">
            
                    
                    第七章: 不同的层，不同的抽象
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="ch8.html">
            
                <a href="ch8.html">
            
                    
                    第八章: 降低复杂性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="ch9.html">
            
                <a href="ch9.html">
            
                    
                    第九章: 在一起更好还是分开更好？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="ch10.html">
            
                <a href="ch10.html">
            
                    
                    第十章: 定义不存在的错误
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="ch11.html">
            
                <a href="ch11.html">
            
                    
                    第十一章: 设计它两次
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="ch12.html">
            
                <a href="ch12.html">
            
                    
                    第十二章: 为什么写注释？四个理由
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="ch13.html">
            
                <a href="ch13.html">
            
                    
                    第十三章: 注释应该描述代码中不明显的内容
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="ch14.html">
            
                <a href="ch14.html">
            
                    
                    第十四章: 选择的名字
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="ch15.html">
            
                <a href="ch15.html">
            
                    
                    第十五章: 先写注释
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="ch16.html">
            
                <a href="ch16.html">
            
                    
                    第十六章: 修改现有的代码
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.20" data-path="ch17.html">
            
                <a href="ch17.html">
            
                    
                    第十七章: 一致性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.21" data-path="ch18.html">
            
                <a href="ch18.html">
            
                    
                    第十八章: 代码应该是显而易见的
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.22" data-path="ch19.html">
            
                <a href="ch19.html">
            
                    
                    第十九章: 软件发展趋势
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.23" data-path="ch20.html">
            
                <a href="ch20.html">
            
                    
                    第二十章: 设计性能
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.24" data-path="ch21.html">
            
                <a href="ch21.html">
            
                    
                    第二十一章: 结论
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.25" data-path="summary.html">
            
                <a href="summary.html">
            
                    
                    总结
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >第六章：通用模块更深入</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7B2C;-6-&#x7AE0;-&#x901A;&#x7528;&#x6A21;&#x5757;&#x66F4;&#x6DF1;&#x5165;">&#x7B2C; 6 &#x7AE0; &#x901A;&#x7528;&#x6A21;&#x5757;&#x66F4;&#x6DF1;&#x5165;</h1>
<p>&#x8BBE;&#x8BA1;&#x65B0;&#x6A21;&#x5757;&#x65F6;&#xFF0C;&#x60A8;&#x5C06;&#x9762;&#x4E34;&#x7684;&#x6700;&#x666E;&#x904D;&#x7684;&#x51B3;&#x5B9A;&#x4E4B;&#x4E00;&#x5C31;&#x662F;&#x662F;&#x4EE5;&#x901A;&#x7528;&#x8FD8;&#x662F;&#x4E13;&#x7528;&#x65B9;&#x5F0F;&#x5B9E;&#x73B0;&#x5B83;&#x3002;&#x6709;&#x4EBA;&#x53EF;&#x80FD;&#x4F1A;&#x4E89;&#x8FA9;&#x8BF4;&#xFF0C;&#x60A8;&#x5E94;&#x8BE5;&#x91C7;&#x7528;&#x901A;&#x7528;&#x65B9;&#x6CD5;&#xFF0C;&#x5728;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x4E2D;&#xFF0C;&#x60A8;&#x5C06;&#x5B9E;&#x73B0;&#x4E00;&#x79CD;&#x53EF;&#x7528;&#x4E8E;&#x89E3;&#x51B3;&#x5E7F;&#x6CDB;&#x95EE;&#x9898;&#x7684;&#x673A;&#x5236;&#xFF0C;&#x800C;&#x4E0D;&#x4EC5;&#x662F;&#x5F53;&#x4ECA;&#x91CD;&#x8981;&#x7684;&#x95EE;&#x9898;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x65B0;&#x673A;&#x5236;&#x53EF;&#x80FD;&#x4F1A;&#x5728;&#x5C06;&#x6765;&#x53D1;&#x73B0;&#x610F;&#x5916;&#x7528;&#x9014;&#xFF0C;&#x4ECE;&#x800C;&#x8282;&#x7701;&#x65F6;&#x95F4;&#x3002;&#x901A;&#x7528;&#x65B9;&#x6CD5;&#x4F3C;&#x4E4E;&#x4E0E;&#x7B2C; 3 &#x7AE0;&#x4E2D;&#x8BA8;&#x8BBA;&#x7684;&#x6295;&#x8D44;&#x601D;&#x8DEF;&#x4E00;&#x81F4;&#xFF0C;&#x5728;&#x8FD9;&#x91CC;&#x60A8;&#x82B1;&#x4E86;&#x66F4;&#x591A;&#x65F6;&#x95F4;&#x5728;&#x524D;&#x9762;&#xFF0C;&#x4EE5;&#x8282;&#x7701;&#x4EE5;&#x540E;&#x7684;&#x65F6;&#x95F4;&#x3002;</p>
<p>&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x5F88;&#x96BE;&#x9884;&#x6D4B;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x672A;&#x6765;&#x9700;&#x6C42;&#xFF0C;&#x56E0;&#x6B64;&#x901A;&#x7528;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x53EF;&#x80FD;&#x5305;&#x542B;&#x4ECE;&#x672A;&#x771F;&#x6B63;&#x9700;&#x8981;&#x7684;&#x529F;&#x80FD;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x5982;&#x679C;&#x60A8;&#x5B9E;&#x73B0;&#x7684;&#x4E1C;&#x897F;&#x8FC7;&#x4E8E;&#x901A;&#x7528;&#xFF0C;&#x90A3;&#x4E48;&#x53EF;&#x80FD;&#x65E0;&#x6CD5;&#x5F88;&#x597D;&#x5730;&#x89E3;&#x51B3;&#x60A8;&#x4ECA;&#x5929;&#x9047;&#x5230;&#x7684;&#x7279;&#x5B9A;&#x95EE;&#x9898;&#x3002;&#x7ED3;&#x679C;&#xFF0C;&#x6709;&#x4E9B;&#x4EBA;&#x53EF;&#x80FD;&#x4F1A;&#x4E89;&#x8FA9;&#x8BF4;&#xFF0C;&#x6700;&#x597D;&#x53EA;&#x5173;&#x6CE8;&#x5F53;&#x4ECA;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x6784;&#x5EFA;&#x60A8;&#x6240;&#x77E5;&#x9053;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x5E76;&#x9488;&#x5BF9;&#x60A8;&#x4ECA;&#x5929;&#x6253;&#x7B97;&#x4F7F;&#x7528;&#x7684;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x4E13;&#x95E8;&#x5316;&#x5904;&#x7406;&#x3002;&#x5982;&#x679C;&#x60A8;&#x91C7;&#x7528;&#x7279;&#x6B8A;&#x7528;&#x9014;&#x7684;&#x65B9;&#x6CD5;&#x5E76;&#x5728;&#x4EE5;&#x540E;&#x53D1;&#x73B0;&#x66F4;&#x591A;&#x7528;&#x9014;&#xFF0C;&#x5219;&#x59CB;&#x7EC8;&#x53EF;&#x4EE5;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x91CD;&#x6784;&#x4EE5;&#x4F7F;&#x5176;&#x901A;&#x7528;&#x3002;&#x4E13;&#x7528;&#x65B9;&#x6CD5;&#x4F3C;&#x4E4E;&#x4E0E;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x7684;&#x589E;&#x91CF;&#x65B9;&#x6CD5;&#x4E00;&#x81F4;&#x3002;</p>
<h4 id="61-&#x4F7F;&#x7C7B;&#x53D8;&#x5F97;&#x901A;&#x7528;">6.1 &#x4F7F;&#x7C7B;&#x53D8;&#x5F97;&#x901A;&#x7528;</h4>
<p>&#x4EE5;&#x6211;&#x7684;&#x7ECF;&#x9A8C;&#xFF0C;&#x6700;&#x6709;&#x6548;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x4EE5;&#x67D0;&#x79CD;&#x901A;&#x7528;&#x7684;&#x65B9;&#x5F0F;&#x5B9E;&#x73B0;&#x65B0;&#x6A21;&#x5757;&#x3002;&#x77ED;&#x8BED;&#x201C;&#x6709;&#x70B9;&#x901A;&#x7528;&#x201D;&#x8868;&#x793A;&#x8BE5;&#x6A21;&#x5757;&#x7684;&#x529F;&#x80FD;&#x5E94;&#x53CD;&#x6620;&#x60A8;&#x5F53;&#x524D;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x4F46;&#x5176;&#x63A5;&#x53E3;&#x5219;&#x4E0D;&#x5E94;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x8BE5;&#x63A5;&#x53E3;&#x5E94;&#x8BE5;&#x8DB3;&#x591F;&#x901A;&#x7528;&#x4EE5;&#x652F;&#x6301;&#x591A;&#x79CD;&#x7528;&#x9014;&#x3002;&#x8BE5;&#x754C;&#x9762;&#x5E94;&#x6613;&#x4E8E;&#x4F7F;&#x7528;&#xFF0C;&#x4EE5;&#x6EE1;&#x8DB3;&#x5F53;&#x4ECA;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x800C;&#x4E0D;&#x5FC5;&#x4E13;&#x95E8;&#x4E0E;&#x5B83;&#x4EEC;&#x8054;&#x7CFB;&#x5728;&#x4E00;&#x8D77;&#x3002;&#x201C;&#x6709;&#x70B9;&#x201D;&#x8FD9;&#x4E2A;&#x8BCD;&#x5F88;&#x91CD;&#x8981;&#xFF1A;&#x4E0D;&#x8981;&#x88AB;&#x5E26;&#x8D70;&#x5E76;&#x5EFA;&#x9020;&#x901A;&#x7528;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x4EE5;&#x81F4;&#x4E8E;&#x5F88;&#x96BE;&#x6EE1;&#x8DB3;&#x5F53;&#x524D;&#x7684;&#x9700;&#x6C42;&#x3002;</p>
<p>&#x901A;&#x7528;&#x65B9;&#x6CD5;&#x6700;&#x91CD;&#x8981;&#x7684;&#xFF08;&#x4E5F;&#x8BB8;&#x662F;&#x4EE4;&#x4EBA;&#x60CA;&#x8BB6;&#x7684;&#xFF09;&#x597D;&#x5904;&#x662F;&#xFF0C;&#x4E0E;&#x4E13;&#x7528;&#x65B9;&#x6CD5;&#x76F8;&#x6BD4;&#xFF0C;&#x5B83;&#x5BFC;&#x81F4;&#x66F4;&#x7B80;&#x5355;&#xFF0C;&#x66F4;&#x6DF1;&#x5165;&#x7684;&#x754C;&#x9762;&#x3002;&#x5982;&#x679C;&#x60A8;&#x5C06;&#x8BE5;&#x7C7B;&#x7528;&#x4E8E;&#x5176;&#x4ED6;&#x76EE;&#x7684;&#xFF0C;&#x5219;&#x901A;&#x7528;&#x65B9;&#x6CD5;&#x8FD8;&#x53EF;&#x4EE5;&#x8282;&#x7701;&#x5C06;&#x6765;&#x7684;&#x65F6;&#x95F4;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5373;&#x4F7F;&#x8BE5;&#x6A21;&#x5757;&#x4EC5;&#x7528;&#x4E8E;&#x5176;&#x539F;&#x59CB;&#x7528;&#x9014;&#xFF0C;&#x7531;&#x4E8E;&#x5176;&#x7B80;&#x5355;&#x6027;&#xFF0C;&#x901A;&#x7528;&#x65B9;&#x6CD5;&#x4ECD;&#x7136;&#x66F4;&#x597D;</p>
<h4 id="62-&#x793A;&#x4F8B;&#xFF1A;&#x4E3A;&#x7F16;&#x8F91;&#x5668;&#x5B58;&#x50A8;&#x6587;&#x672C;">6.2 &#x793A;&#x4F8B;&#xFF1A;&#x4E3A;&#x7F16;&#x8F91;&#x5668;&#x5B58;&#x50A8;&#x6587;&#x672C;</h4>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x8003;&#x8651;&#x4E00;&#x4E2A;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x8BFE;&#x7A0B;&#x7684;&#x793A;&#x4F8B;&#xFF0C;&#x5176;&#x4E2D;&#x8981;&#x6C42;&#x5B66;&#x751F;&#x6784;&#x5EFA;&#x7B80;&#x5355;&#x7684; GUI &#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;&#x3002;&#x7F16;&#x8F91;&#x5668;&#x5FC5;&#x987B;&#x663E;&#x793A;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#xFF0C;&#x5E76;&#x5141;&#x8BB8;&#x7528;&#x6237;&#x6307;&#x5411;&#xFF0C;&#x5355;&#x51FB;&#x5E76;&#x952E;&#x5165;&#x4EE5;&#x7F16;&#x8F91;&#x8BE5;&#x6587;&#x4EF6;&#x3002;&#x7F16;&#x8F91;&#x8005;&#x5FC5;&#x987B;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x7A97;&#x53E3;&#x4E2D;&#x652F;&#x6301;&#x540C;&#x4E00;&#x6587;&#x4EF6;&#x7684;&#x591A;&#x4E2A;&#x540C;&#x65F6;&#x89C6;&#x56FE;&#x3002;&#x4ED6;&#x4EEC;&#x8FD8;&#x5FC5;&#x987B;&#x652F;&#x6301;&#x591A;&#x7EA7;&#x64A4;&#x6D88;&#x548C;&#x91CD;&#x505A;&#x4EE5;&#x4FEE;&#x6539;&#x6587;&#x4EF6;&#x3002;</p>
<p>&#x6BCF;&#x4E2A;&#x5B66;&#x751F;&#x9879;&#x76EE;&#x90FD;&#x5305;&#x62EC;&#x4E00;&#x4E2A;&#x7BA1;&#x7406;&#x6587;&#x4EF6;&#x7684;&#x57FA;&#x7840;&#x6587;&#x672C;&#x7684;&#x7C7B;&#x3002;&#x6587;&#x672C;&#x7C7B;&#x901A;&#x5E38;&#x63D0;&#x4F9B;&#x4EE5;&#x4E0B;&#x65B9;&#x6CD5;&#xFF1A;&#x5C06;&#x6587;&#x4EF6;&#x52A0;&#x8F7D;&#x5230;&#x5185;&#x5B58;&#xFF0C;&#x8BFB;&#x53D6;&#x548C;&#x4FEE;&#x6539;&#x6587;&#x4EF6;&#x7684;&#x6587;&#x672C;&#x4EE5;&#x53CA;&#x5C06;&#x4FEE;&#x6539;&#x540E;&#x7684;&#x6587;&#x672C;&#x5199;&#x56DE;&#x5230;&#x6587;&#x4EF6;&#x3002;</p>
<p>&#x8BB8;&#x591A;&#x5B66;&#x751F;&#x56E2;&#x961F;&#x4E3A;&#x6587;&#x672C;&#x8BFE;&#x5B9E;&#x73B0;&#x4E86;&#x4E13;&#x7528;&#x7684; API&#x3002;&#x4ED6;&#x4EEC;&#x77E5;&#x9053;&#x8BE5;&#x7C7B;&#x5C06;&#x5728;&#x4EA4;&#x4E92;&#x5F0F;&#x7F16;&#x8F91;&#x5668;&#x4E2D;&#x4F7F;&#x7528;&#xFF0C;&#x56E0;&#x6B64;&#x4ED6;&#x4EEC;&#x8003;&#x8651;&#x4E86;&#x7F16;&#x8F91;&#x5668;&#x5FC5;&#x987B;&#x63D0;&#x4F9B;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x5E76;&#x9488;&#x5BF9;&#x8FD9;&#x4E9B;&#x7279;&#x5B9A;&#x529F;&#x80FD;&#x5B9A;&#x5236;&#x4E86;&#x6587;&#x672C;&#x7C7B;&#x7684; API&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x7F16;&#x8F91;&#x8005;&#x7684;&#x7528;&#x6237;&#x952E;&#x5165;&#x4E86;&#x9000;&#x683C;&#x952E;&#xFF0C;&#x5219;&#x7F16;&#x8F91;&#x8005;&#x4F1A;&#x7ACB;&#x5373;&#x5220;&#x9664;&#x5149;&#x6807;&#x5DE6;&#x4FA7;&#x7684;&#x5B57;&#x7B26;&#xFF1B;&#x5982;&#x679C;&#x7528;&#x6237;&#x952E;&#x5165;&#x5220;&#x9664;&#x952E;&#xFF0C;&#x5219;&#x7F16;&#x8F91;&#x5668;&#x7ACB;&#x5373;&#x5220;&#x9664;&#x5149;&#x6807;&#x53F3;&#x4FA7;&#x7684;&#x5B57;&#x7B26;&#x3002;&#x77E5;&#x9053;&#x8FD9;&#x4E00;&#x70B9;&#x540E;&#xFF0C;&#x4E00;&#x4E9B;&#x56E2;&#x961F;&#x5728;&#x6587;&#x672C;&#x7C7B;&#x4E2D;&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x6765;&#x652F;&#x6301;&#x4EE5;&#x4E0B;&#x6BCF;&#x4E2A;&#x7279;&#x5B9A;&#x529F;&#x80FD;&#xFF1A;</p>
<pre><code>void backspace(Cursor cursor);

void delete(Cursor cursor);
</code></pre><p>&#x8FD9;&#x4E9B;&#x65B9;&#x6CD5;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x90FD;&#x4EE5;&#x5149;&#x6807;&#x4F4D;&#x7F6E;&#x4F5C;&#x4E3A;&#x53C2;&#x6570;&#x3002;&#x7279;&#x6B8A;&#x7C7B;&#x578B;&#x7684;&#x5149;&#x6807;&#x8868;&#x793A;&#x6B64;&#x4F4D;&#x7F6E;&#x3002;&#x7F16;&#x8F91;&#x5668;&#x8FD8;&#x5FC5;&#x987B;&#x652F;&#x6301;&#x53EF;&#x4EE5;&#x590D;&#x5236;&#x6216;&#x5220;&#x9664;&#x7684;&#x9009;&#x62E9;&#x3002;&#x5B66;&#x751F;&#x901A;&#x8FC7;&#x5B9A;&#x4E49;&#x9009;&#x62E9;&#x7C7B;&#x5E76;&#x5728;&#x5220;&#x9664;&#x8FC7;&#x7A0B;&#x4E2D;&#x5C06;&#x8BE5;&#x7C7B;&#x7684;&#x5BF9;&#x8C61;&#x4F20;&#x9012;&#x7ED9;&#x6587;&#x672C;&#x7C7B;&#x6765;&#x89E3;&#x51B3;&#x6B64;&#x95EE;&#x9898;&#xFF1A;</p>
<pre><code>void deleteSelection(Selection selection);
</code></pre><p>&#x5B66;&#x751F;&#x4EEC;&#x53EF;&#x80FD;&#x8BA4;&#x4E3A;&#xFF0C;&#x5982;&#x679C;&#x6587;&#x672C;&#x7C7B;&#x7684;&#x65B9;&#x6CD5;&#x4E0E;&#x7528;&#x6237;&#x53EF;&#x89C1;&#x7684;&#x529F;&#x80FD;&#x76F8;&#x5BF9;&#x5E94;&#xFF0C;&#x5219;&#x5C06;&#x66F4;&#x6613;&#x4E8E;&#x5B9E;&#x73B0;&#x7528;&#x6237;&#x754C;&#x9762;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x8FD9;&#x79CD;&#x4E13;&#x4E1A;&#x5316;&#x5BF9;&#x7528;&#x6237;&#x754C;&#x9762;&#x4EE3;&#x7801;&#x51E0;&#x4E4E;&#x6CA1;&#x6709;&#x597D;&#x5904;&#xFF0C;&#x5E76;&#x4E14;&#x4E3A;&#x4F7F;&#x7528;&#x7528;&#x6237;&#x754C;&#x9762;&#x6216;&#x6587;&#x672C;&#x7C7B;&#x7684;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5E26;&#x6765;&#x4E86;&#x5F88;&#x9AD8;&#x7684;&#x8BA4;&#x77E5;&#x8D1F;&#x62C5;&#x3002;&#x6587;&#x672C;&#x7C7B;&#x4EE5;&#x5927;&#x91CF;&#x6D45;&#x5C42;&#x65B9;&#x6CD5;&#x7ED3;&#x675F;&#xFF0C;&#x6BCF;&#x79CD;&#x6D45;&#x5C42;&#x65B9;&#x6CD5;&#x4EC5;&#x9002;&#x7528;&#x4E8E;&#x4E00;&#x4E2A;&#x7528;&#x6237;&#x754C;&#x9762;&#x64CD;&#x4F5C;&#x3002;&#x8BB8;&#x591A;&#x65B9;&#x6CD5;&#xFF08;&#x4F8B;&#x5982; delete&#xFF09;&#x4EC5;&#x5728;&#x5355;&#x4E2A;&#x4F4D;&#x7F6E;&#x8C03;&#x7528;&#x3002;&#x7ED3;&#x679C;&#xFF0C;&#x5728;&#x7528;&#x6237;&#x754C;&#x9762;&#x4E0A;&#x5DE5;&#x4F5C;&#x7684;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5FC5;&#x987B;&#x5B66;&#x4E60;&#x5927;&#x91CF;&#x6709;&#x5173;&#x6587;&#x672C;&#x7C7B;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x5728;&#x7528;&#x6237;&#x754C;&#x9762;&#x548C;&#x6587;&#x672C;&#x7C7B;&#x4E4B;&#x95F4;&#x9020;&#x6210;&#x4E86;&#x4FE1;&#x606F;&#x6CC4;&#x6F0F;&#x3002;&#x4E0E;&#x7528;&#x6237;&#x754C;&#x9762;&#x6709;&#x5173;&#x7684;&#x62BD;&#x8C61;&#xFF08;&#x4F8B;&#x5982;&#x9009;&#x62E9;&#x6216;&#x9000;&#x683C;&#x952E;&#xFF09;&#x53CD;&#x6620;&#x5728;&#x6587;&#x672C;&#x7C7B;&#x4E2D;&#xFF1B;&#x8FD9;&#x589E;&#x52A0;&#x4E86;&#x4ECE;&#x4E8B;&#x6587;&#x672C;&#x8BFE;&#x7684;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x7684;&#x8BA4;&#x77E5;&#x8D1F;&#x62C5;&#x3002;&#x6BCF;&#x4E2A;&#x65B0;&#x7684;&#x7528;&#x6237;&#x754C;&#x9762;&#x64CD;&#x4F5C;&#x90FD;&#x9700;&#x8981;&#x5728;&#x6587;&#x672C;&#x7C7B;&#x4E2D;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x65B0;&#x65B9;&#x6CD5;&#xFF0C;&#x56E0;&#x6B64;&#x4F7F;&#x7528;&#x8BE5;&#x7528;&#x6237;&#x754C;&#x9762;&#x7684;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x4E5F;&#x53EF;&#x80FD;&#x6700;&#x7EC8;&#x4E5F;&#x8981;&#x4F7F;&#x7528;&#x8BE5;&#x6587;&#x672C;&#x7C7B;&#x3002;&#x7C7B;&#x8BBE;&#x8BA1;&#x7684;&#x76EE;&#x6807;&#x4E4B;&#x4E00;&#x662F;&#x5141;&#x8BB8;&#x6BCF;&#x4E2A;&#x7C7B;&#x72EC;&#x7ACB;&#x5F00;&#x53D1;&#xFF0C;&#x4F46;&#x662F;&#x4E13;&#x7528;&#x65B9;&#x6CD5;&#x5C06;&#x7528;&#x6237;&#x754C;&#x9762;&#x548C;&#x6587;&#x672C;&#x7C7B;&#x8054;&#x7CFB;&#x5728;&#x4E00;&#x8D77;&#x3002;</p>
<h4 id="63-&#x66F4;&#x901A;&#x7528;&#x7684;-api">6.3 &#x66F4;&#x901A;&#x7528;&#x7684; API</h4>
<p>&#x66F4;&#x597D;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x4F7F;&#x6587;&#x672C;&#x7C7B;&#x66F4;&#x901A;&#x7528;&#x3002;&#x4EC5;&#x5E94;&#x6839;&#x636E;&#x57FA;&#x672C;&#x6587;&#x672C;&#x529F;&#x80FD;&#x5B9A;&#x4E49;&#x5176; API&#xFF0C;&#x800C;&#x4E0D;&#x5E94;&#x53CD;&#x6620;&#x5C06;&#x7528;&#x5176;&#x5B9E;&#x73B0;&#x7684;&#x66F4;&#x9AD8;&#x7EA7;&#x522B;&#x7684;&#x64CD;&#x4F5C;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x53EA;&#x9700;&#x4E24;&#x79CD;&#x65B9;&#x6CD5;&#x5373;&#x53EF;&#x4FEE;&#x6539;&#x6587;&#x672C;&#xFF1A;</p>
<pre><code>void insert(Position position, String newText);

void delete(Position start, Position end);
</code></pre><p>&#x7B2C;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x5728;&#x6587;&#x672C;&#x5185;&#x7684;&#x4EFB;&#x610F;&#x4F4D;&#x7F6E;&#x63D2;&#x5165;&#x4EFB;&#x610F;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x7B2C;&#x4E8C;&#x79CD;&#x65B9;&#x6CD5;&#x5220;&#x9664;&#x5927;&#x4E8E;&#x6216;&#x7B49;&#x4E8E;&#x5F00;&#x59CB;&#x4F46;&#x5C0F;&#x4E8E;&#x7ED3;&#x675F;&#x7684;&#x4F4D;&#x7F6E;&#x5904;&#x7684;&#x6240;&#x6709;&#x5B57;&#x7B26;&#x3002;&#x6B64; API &#x8FD8;&#x4F7F;&#x7528;&#x4E86;&#x66F4;&#x901A;&#x7528;&#x7684; Position &#x7C7B;&#x578B;&#x6765;&#x4EE3;&#x66FF; Cursor&#xFF0C;&#x5B83;&#x53CD;&#x6620;&#x4E86;&#x7279;&#x5B9A;&#x7684;&#x7528;&#x6237;&#x754C;&#x9762;&#x3002;&#x6587;&#x672C;&#x7C7B;&#x8FD8;&#x5E94;&#x8BE5;&#x63D0;&#x4F9B;&#x7528;&#x4E8E;&#x64CD;&#x7EB5;&#x6587;&#x672C;&#x4E2D;&#x4F4D;&#x7F6E;&#x7684;&#x901A;&#x7528;&#x5DE5;&#x5177;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;</p>
<pre><code>Position changePosition(Position position, int numChars);
</code></pre><p>&#x6B64;&#x65B9;&#x6CD5;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x65B0;&#x4F4D;&#x7F6E;&#xFF0C;&#x8BE5;&#x4F4D;&#x7F6E;&#x4E0E;&#x7ED9;&#x5B9A;&#x4F4D;&#x7F6E;&#x76F8;&#x8DDD;&#x7ED9;&#x5B9A;&#x5B57;&#x7B26;&#x6570;&#x3002;&#x5982;&#x679C; numChars &#x53C2;&#x6570;&#x4E3A;&#x6B63;&#xFF0C;&#x5219;&#x65B0;&#x4F4D;&#x7F6E;&#x5728;&#x6587;&#x4EF6;&#x4E2D;&#x6BD4;&#x4F4D;&#x7F6E;&#x665A;&#xFF1B;&#x5982;&#x679C; numChars &#x4E3A;&#x8D1F;&#xFF0C;&#x5219;&#x65B0;&#x4F4D;&#x7F6E;&#x5728;&#x4F4D;&#x7F6E;&#x4E4B;&#x524D;&#x3002;&#x5FC5;&#x8981;&#x65F6;&#xFF0C;&#x8BE5;&#x65B9;&#x6CD5;&#x4F1A;&#x81EA;&#x52A8;&#x8DF3;&#x5230;&#x4E0B;&#x4E00;&#x884C;&#x6216;&#x4E0A;&#x4E00;&#x884C;&#x3002;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x65B9;&#x6CD5;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4EE5;&#x4E0B;&#x4EE3;&#x7801;&#x6765;&#x5B9E;&#x73B0;&#x5220;&#x9664;&#x952E;&#xFF08;&#x5047;&#x5B9A; cursor &#x53D8;&#x91CF;&#x4FDD;&#x7559;&#x5F53;&#x524D;&#x5149;&#x6807;&#x7684;&#x4F4D;&#x7F6E;&#xFF09;&#xFF1A;</p>
<pre><code>text.delete(cursor, text.changePosition(cursor, 1));
</code></pre><p>&#x540C;&#x6837;&#xFF0C;&#x53EF;&#x4EE5;&#x6309;&#x4EE5;&#x4E0B;&#x65B9;&#x5F0F;&#x5B9E;&#x73B0;&#x9000;&#x683C;&#x952E;&#xFF1A;</p>
<pre><code>text.delete(text.changePosition(cursor, -1), cursor);
</code></pre><p>&#x4F7F;&#x7528;&#x901A;&#x7528;&#x6587;&#x672C; API&#xFF0C;&#x5B9E;&#x73B0;&#x7528;&#x6237;&#x754C;&#x9762;&#x529F;&#x80FD;&#xFF08;&#x5982;&#x5220;&#x9664;&#x548C;&#x9000;&#x683C;&#xFF09;&#x7684;&#x4EE3;&#x7801;&#x6BD4;&#x4F7F;&#x7528;&#x4E13;&#x7528;&#x6587;&#x672C; API &#x7684;&#x539F;&#x59CB;&#x65B9;&#x6CD5;&#x8981;&#x957F;&#x4E00;&#x4E9B;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x65B0;&#x4EE3;&#x7801;&#x6BD4;&#x65E7;&#x4EE3;&#x7801;&#x66F4;&#x660E;&#x663E;&#x3002;&#x5728;&#x7528;&#x6237;&#x754C;&#x9762;&#x6A21;&#x5757;&#x4E2D;&#x5DE5;&#x4F5C;&#x7684;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x53EF;&#x80FD;&#x4F1A;&#x5173;&#x5FC3;&#x7531; Backspace &#x952E;&#x5220;&#x9664;&#x54EA;&#x4E9B;&#x5B57;&#x7B26;&#x3002;&#x4F7F;&#x7528;&#x65B0;&#x4EE3;&#x7801;&#xFF0C;&#x8FD9;&#x662F;&#x663E;&#x800C;&#x6613;&#x89C1;&#x7684;&#x3002;&#x4F7F;&#x7528;&#x65E7;&#x4EE3;&#x7801;&#xFF0C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5FC5;&#x987B;&#x8F6C;&#x5230;&#x6587;&#x672C;&#x7C7B;&#x5E76;&#x9605;&#x8BFB;&#x9000;&#x683C;&#x65B9;&#x6CD5;&#x7684;&#x6587;&#x6863;&#x548C;/&#x6216;&#x4EE3;&#x7801;&#x4EE5;&#x9A8C;&#x8BC1;&#x884C;&#x4E3A;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x901A;&#x7528;&#x65B9;&#x6CD5;&#x603B;&#x4F53;&#x4E0A;&#x6BD4;&#x4E13;&#x7528;&#x65B9;&#x6CD5;&#x5177;&#x6709;&#x66F4;&#x5C11;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x7528;&#x8F83;&#x5C11;&#x6570;&#x91CF;&#x7684;&#x901A;&#x7528;&#x65B9;&#x6CD5;&#x4EE3;&#x66FF;&#x4E86;&#x6587;&#x672C;&#x7C7B;&#x4E2D;&#x7684;&#x5927;&#x91CF;&#x4E13;&#x7528;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x4F7F;&#x7528;&#x901A;&#x7528;&#x63A5;&#x53E3;&#x5B9E;&#x73B0;&#x7684;&#x6587;&#x672C;&#x7C7B;&#x9664;&#x4EA4;&#x4E92;&#x5F0F;&#x7F16;&#x8F91;&#x5668;&#x5916;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x5176;&#x4ED6;&#x76EE;&#x7684;&#x3002;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x793A;&#x4F8B;&#xFF0C;&#x5047;&#x8BBE;&#x60A8;&#x6B63;&#x5728;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x8BE5;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x901A;&#x8FC7;&#x5C06;&#x6240;&#x6709;&#x51FA;&#x73B0;&#x7684;&#x7279;&#x5B9A;&#x5B57;&#x7B26;&#x4E32;&#x66FF;&#x6362;&#x4E3A;&#x53E6;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x6765;&#x4FEE;&#x6539;&#x6307;&#x5B9A;&#x6587;&#x4EF6;&#x3002;&#x4E13;&#x7528;&#x6587;&#x672C;&#x7C7B;&#x4E2D;&#x7684;&#x65B9;&#x6CD5;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x9000;&#x683C;&#x952E;&#x548C; Delete&#xFF09;&#x5BF9;&#x4E8E;&#x6B64;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x51E0;&#x4E4E;&#x6CA1;&#x6709;&#x4EF7;&#x503C;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x901A;&#x7528;&#x6587;&#x672C;&#x7C7B;&#x5DF2;&#x7ECF;&#x5177;&#x6709;&#x65B0;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6240;&#x9700;&#x7684;&#x5927;&#x591A;&#x6570;&#x529F;&#x80FD;&#x3002;&#x7F3A;&#x5C11;&#x7684;&#x53EA;&#x662F;&#x4E00;&#x79CD;&#x641C;&#x7D22;&#x7ED9;&#x5B9A;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x4E0B;&#x4E00;&#x4E2A;&#x5339;&#x914D;&#x9879;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;</p>
<pre><code>Position findNext(Position start, String string);
</code></pre><p>&#x5F53;&#x7136;&#xFF0C;&#x4EA4;&#x4E92;&#x5F0F;&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;&#x53EF;&#x80FD;&#x5177;&#x6709;&#x641C;&#x7D22;&#x548C;&#x66FF;&#x6362;&#x7684;&#x673A;&#x5236;&#xFF0C;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6587;&#x672C;&#x7C7B;&#x5C06;&#x5DF2;&#x7ECF;&#x5305;&#x542B;&#x6B64;&#x65B9;&#x6CD5;&#x3002;</p>
<h4 id="64-&#x901A;&#x7528;&#x6027;&#x53EF;&#x4EE5;&#x66F4;&#x597D;&#x5730;&#x9690;&#x85CF;&#x4FE1;&#x606F;">6.4 &#x901A;&#x7528;&#x6027;&#x53EF;&#x4EE5;&#x66F4;&#x597D;&#x5730;&#x9690;&#x85CF;&#x4FE1;&#x606F;</h4>
<p>&#x901A;&#x7528;&#x65B9;&#x6CD5;&#x5728;&#x6587;&#x672C;&#x548C;&#x7528;&#x6237;&#x754C;&#x9762;&#x7C7B;&#x4E4B;&#x95F4;&#x63D0;&#x4F9B;&#x4E86;&#x66F4;&#x6E05;&#x6670;&#x7684;&#x5206;&#x9694;&#xFF0C;&#x4ECE;&#x800C;&#x53EF;&#x4EE5;&#x66F4;&#x597D;&#x5730;&#x9690;&#x85CF;&#x4FE1;&#x606F;&#x3002;&#x6587;&#x672C;&#x7C7B;&#x4E0D;&#x9700;&#x8981;&#x77E5;&#x9053;&#x7528;&#x6237;&#x754C;&#x9762;&#x7684;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#xFF0C;&#x4F8B;&#x5982;&#x5982;&#x4F55;&#x5904;&#x7406;&#x9000;&#x683C;&#x952E;&#x3002;&#x8FD9;&#x4E9B;&#x7EC6;&#x8282;&#x73B0;&#x5728;&#x5C01;&#x88C5;&#x5728;&#x7528;&#x6237;&#x754C;&#x9762;&#x7C7B;&#x4E2D;&#x3002;&#x53EF;&#x4EE5;&#x6DFB;&#x52A0;&#x65B0;&#x7684;&#x7528;&#x6237;&#x754C;&#x9762;&#x529F;&#x80FD;&#xFF0C;&#x800C;&#x65E0;&#x9700;&#x5728;&#x6587;&#x672C;&#x7C7B;&#x4E2D;&#x521B;&#x5EFA;&#x65B0;&#x7684;&#x652F;&#x6301;&#x529F;&#x80FD;&#x3002;&#x901A;&#x7528;&#x754C;&#x9762;&#x8FD8;&#x51CF;&#x8F7B;&#x4E86;&#x8BA4;&#x77E5;&#x8D1F;&#x62C5;&#xFF1A;&#x4F7F;&#x7528;&#x7528;&#x6237;&#x754C;&#x9762;&#x7684;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x53EA;&#x9700;&#x8981;&#x5B66;&#x4E60;&#x4E00;&#x4E9B;&#x7B80;&#x5355;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x5C06;&#x5176;&#x91CD;&#x590D;&#x7528;&#x4E8E;&#x5404;&#x79CD;&#x76EE;&#x7684;</p>
<p>&#x6587;&#x672C;&#x7C7B;&#x539F;&#x59CB;&#x7248;&#x672C;&#x4E2D;&#x7684; backspace &#x65B9;&#x6CD5;&#x662F;&#x9519;&#x8BEF;&#x7684;&#x62BD;&#x8C61;&#x3002;&#x5B83;&#x65E8;&#x5728;&#x9690;&#x85CF;&#x6709;&#x5173;&#x5220;&#x9664;&#x54EA;&#x4E9B;&#x5B57;&#x7B26;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x4F46;&#x662F;&#x7528;&#x6237;&#x754C;&#x9762;&#x6A21;&#x5757;&#x786E;&#x5B9E;&#x9700;&#x8981;&#x77E5;&#x9053;&#x8FD9;&#x4E00;&#x70B9;&#x3002;&#x7528;&#x6237;&#x754C;&#x9762;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x53EF;&#x80FD;&#x4F1A;&#x9605;&#x8BFB;&#x9000;&#x683C;&#x65B9;&#x6CD5;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x4EE5;&#x786E;&#x8BA4;&#x5176;&#x7CBE;&#x786E;&#x7684;&#x884C;&#x4E3A;&#x3002;&#x5C06;&#x65B9;&#x6CD5;&#x653E;&#x5728;&#x6587;&#x672C;&#x7C7B;&#x4E2D;&#x53EA;&#x4F1A;&#x4F7F;&#x7528;&#x6237;&#x754C;&#x9762;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x66F4;&#x96BE;&#x83B7;&#x5F97;&#x6240;&#x9700;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x6700;&#x91CD;&#x8981;&#x7684;&#x5143;&#x7D20;&#x4E4B;&#x4E00;&#x5C31;&#x662F;&#x786E;&#x5B9A;&#x8C01;&#x9700;&#x8981;&#x77E5;&#x9053;&#x4EC0;&#x4E48;&#x4EE5;&#x53CA;&#x4F55;&#x65F6;&#x77E5;&#x9053;&#x3002;&#x5F53;&#x7EC6;&#x8282;&#x5F88;&#x91CD;&#x8981;&#x65F6;&#xFF0C;&#x6700;&#x597D;&#x4F7F;&#x5B83;&#x4EEC;&#x660E;&#x786E;&#x4E14;&#x5C3D;&#x53EF;&#x80FD;&#x660E;&#x663E;&#xFF0C;&#x4F8B;&#x5982;&#x4FEE;&#x8BA2;&#x7684; Backspace &#x64CD;&#x4F5C;&#x5B9E;&#x73B0;&#x3002;&#x5C06;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x9690;&#x85CF;&#x5728;&#x754C;&#x9762;&#x540E;&#x9762;&#x53EA;&#x4F1A;&#x4EA7;&#x751F;&#x6666;&#x6DA9;&#x611F;</p>
<h4 id="65-&#x95EE;&#x81EA;&#x5DF1;&#x7684;&#x95EE;&#x9898;">6.5 &#x95EE;&#x81EA;&#x5DF1;&#x7684;&#x95EE;&#x9898;</h4>
<p>&#x8BC6;&#x522B;&#x5E72;&#x51C0;&#x7684;&#x901A;&#x7528;&#x7C7B;&#x8BBE;&#x8BA1;&#x8981;&#x6BD4;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x3002;&#x60A8;&#x53EF;&#x4EE5;&#x95EE;&#x81EA;&#x5DF1;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x5C06;&#x5E2E;&#x52A9;&#x60A8;&#x5728;&#x63A5;&#x53E3;&#x7684;&#x901A;&#x7528;&#x548C;&#x4E13;&#x7528;&#x4E4B;&#x95F4;&#x627E;&#x5230;&#x9002;&#x5F53;&#x7684;&#x5E73;&#x8861;&#x3002;</p>
<p>&#x6EE1;&#x8DB3;&#x6211;&#x5F53;&#x524D;&#x6240;&#x6709;&#x9700;&#x6C42;&#x7684;&#x6700;&#x7B80;&#x5355;&#x7684;&#x754C;&#x9762;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x5982;&#x679C;&#x51CF;&#x5C11; API &#x4E2D;&#x7684;&#x65B9;&#x6CD5;&#x6570;&#x91CF;&#x800C;&#x4E0D;&#x964D;&#x4F4E;&#x5176;&#x6574;&#x4F53;&#x529F;&#x80FD;&#xFF0C;&#x5219;&#x53EF;&#x80FD;&#x6B63;&#x5728;&#x521B;&#x5EFA;&#x66F4;&#x591A;&#x901A;&#x7528;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x4E13;&#x7528;&#x6587;&#x672C; API &#x81F3;&#x5C11;&#x5177;&#x6709;&#x4E09;&#x79CD;&#x5220;&#x9664;&#x6587;&#x672C;&#x7684;&#x65B9;&#x6CD5;&#xFF1A;&#x9000;&#x683C;&#xFF0C;&#x5220;&#x9664;&#x548C; deleteSelection&#x3002;&#x901A;&#x7528;&#x6027;&#x66F4;&#x5F3A;&#x7684; API &#x53EA;&#x6709;&#x4E00;&#x79CD;&#x5220;&#x9664;&#x6587;&#x672C;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x53EF;&#x540C;&#x65F6;&#x6EE1;&#x8DB3;&#x6240;&#x6709;&#x4E09;&#x4E2A;&#x76EE;&#x7684;&#x3002;&#x4EC5;&#x5728;&#x6BCF;&#x79CD;&#x65B9;&#x6CD5;&#x7684; API &#x4FDD;&#x6301;&#x7B80;&#x5355;&#x7684;&#x524D;&#x63D0;&#x4E0B;&#xFF0C;&#x51CF;&#x5C11;&#x65B9;&#x6CD5;&#x7684;&#x6570;&#x91CF;&#x624D;&#x6709;&#x610F;&#x4E49;&#x3002;&#x5982;&#x679C;&#x60A8;&#x5FC5;&#x987B;&#x5F15;&#x5165;&#x8BB8;&#x591A;&#x5176;&#x4ED6;&#x53C2;&#x6570;&#x4EE5;&#x51CF;&#x5C11;&#x65B9;&#x6CD5;&#x6570;&#x91CF;&#xFF0C;&#x90A3;&#x4E48;&#x60A8;&#x53EF;&#x80FD;&#x5E76;&#x6CA1;&#x6709;&#x771F;&#x6B63;&#x7B80;&#x5316;&#x4E8B;&#x60C5;&#x3002;</p>
<p>&#x5728;&#x591A;&#x5C11;&#x60C5;&#x51B5;&#x4E0B;&#x4F1A;&#x4F7F;&#x7528;&#x6B64;&#x65B9;&#x6CD5;&#xFF1F;&#x5982;&#x679C;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x4E3A;&#x7279;&#x5B9A;&#x7528;&#x9014;&#x800C;&#x8BBE;&#x8BA1;&#x7684;&#xFF0C;&#x4F8B;&#x5982;&#x9000;&#x683C;&#x65B9;&#x6CD5;&#xFF0C;&#x90A3;&#x662F;&#x4E00;&#x4E2A;&#x5371;&#x9669;&#x4FE1;&#x53F7;&#xFF0C;&#x5B83;&#x53EF;&#x80FD;&#x592A;&#x7279;&#x6B8A;&#x4E86;&#x3002;&#x770B;&#x770B;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x7528;&#x4E00;&#x4E2A;&#x901A;&#x7528;&#x65B9;&#x6CD5;&#x66FF;&#x6362;&#x51E0;&#x79CD;&#x4E13;&#x7528;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x8FD9;&#x4E2A; API &#x662F;&#x5426;&#x6613;&#x4E8E;&#x4F7F;&#x7528;&#x4EE5;&#x6EE1;&#x8DB3;&#x6211;&#x5F53;&#x524D;&#x7684;&#x9700;&#x6C42;&#xFF1F;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x60A8;&#x786E;&#x5B9A;&#x4F55;&#x65F6;&#x4F7F; API &#x53D8;&#x5F97;&#x7B80;&#x5355;&#x800C;&#x901A;&#x7528;&#x3002;&#x5982;&#x679C;&#x60A8;&#x5FC5;&#x987B;&#x7F16;&#x5199;&#x8BB8;&#x591A;&#x5176;&#x4ED6;&#x4EE3;&#x7801;&#x624D;&#x80FD;&#x5C06;&#x7C7B;&#x7528;&#x4E8E;&#x5F53;&#x524D;&#x7528;&#x9014;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5371;&#x9669;&#x4FE1;&#x53F7;&#xFF0C;&#x5373;&#x8BE5;&#x63A5;&#x53E3;&#x672A;&#x63D0;&#x4F9B;&#x6B63;&#x786E;&#x7684;&#x529F;&#x80FD;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x9488;&#x5BF9;&#x6587;&#x672C;&#x7C7B;&#x7684;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x56F4;&#x7ED5;&#x5355;&#x5B57;&#x7B26;&#x64CD;&#x4F5C;&#x8FDB;&#x884C;&#x8BBE;&#x8BA1;&#xFF1A;insert &#x63D2;&#x5165;&#x5355;&#x4E2A;&#x5B57;&#x7B26;&#xFF0C;&#x800C; delete &#x5220;&#x9664;&#x5355;&#x4E2A;&#x5B57;&#x7B26;&#x3002;&#x8BE5; API &#x65E2;&#x7B80;&#x5355;&#x53C8;&#x901A;&#x7528;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5BF9;&#x4E8E;&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;&#x6765;&#x8BF4;&#x5E76;&#x4E0D;&#x662F;&#x7279;&#x522B;&#x5BB9;&#x6613;&#x4F7F;&#x7528;&#xFF1A;&#x66F4;&#x9AD8;&#x7EA7;&#x522B;&#x7684;&#x4EE3;&#x7801;&#x5C06;&#x5305;&#x542B;&#x8BB8;&#x591A;&#x5FAA;&#x73AF;&#xFF0C;&#x7528;&#x4E8E;&#x63D2;&#x5165;&#x6216;&#x5220;&#x9664;&#x5B57;&#x7B26;&#x8303;&#x56F4;&#x3002;&#x5355;&#x5B57;&#x7B26;&#x65B9;&#x6CD5;&#x5BF9;&#x4E8E;&#x5927;&#x578B;&#x64CD;&#x4F5C;&#x4E5F;&#x5C06;&#x662F;&#x4F4E;&#x6548;&#x7684;&#x3002;</p>
<h4 id="66-&#x7ED3;&#x8BBA;">6.6 &#x7ED3;&#x8BBA;</h4>
<p>&#x901A;&#x7528;&#x63A5;&#x53E3;&#x6BD4;&#x4E13;&#x7528;&#x63A5;&#x53E3;&#x5177;&#x6709;&#x8BB8;&#x591A;&#x4F18;&#x70B9;&#x3002;&#x5B83;&#x4EEC;&#x5F80;&#x5F80;&#x66F4;&#x7B80;&#x5355;&#xFF0C;&#x4F7F;&#x7528;&#x7684;&#x65B9;&#x6CD5;&#x66F4;&#x5C11;&#x3002;&#x5B83;&#x4EEC;&#x8FD8;&#x63D0;&#x4F9B;&#x4E86;&#x7C7B;&#x4E4B;&#x95F4;&#x7684;&#x66F4;&#x6E05;&#x6670;&#x7684;&#x5206;&#x9694;&#xFF0C;&#x800C;&#x4E13;&#x7528;&#x63A5;&#x53E3;&#x5219;&#x503E;&#x5411;&#x4E8E;&#x5728;&#x7C7B;&#x4E4B;&#x95F4;&#x6CC4;&#x6F0F;&#x4FE1;&#x606F;&#x3002;&#x4F7F;&#x6A21;&#x5757;&#x5177;&#x6709;&#x67D0;&#x79CD;&#x901A;&#x7528;&#x6027;&#x662F;&#x964D;&#x4F4E;&#x6574;&#x4F53;&#x7CFB;&#x7EDF;&#x590D;&#x6742;&#x6027;&#x7684;&#x6700;&#x4F73;&#x65B9;&#x6CD5;&#x4E4B;&#x4E00;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="ch5.html" class="navigation navigation-prev " aria-label="Previous page: 第五章：信息隐藏(和泄露)">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="ch7.html" class="navigation navigation-next " aria-label="Next page: 第七章: 不同的层，不同的抽象">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第六章：通用模块更深入","level":"1.9","depth":1,"next":{"title":"第七章: 不同的层，不同的抽象","level":"1.10","depth":1,"path":"docs/ch7.md","ref":"./docs/ch7.md","articles":[]},"previous":{"title":"第五章：信息隐藏(和泄露)","level":"1.8","depth":1,"path":"docs/ch5.md","ref":"./docs/ch5.md","articles":[]},"dir":"ltr"},"config":{"plugins":["back-to-top-button","expandable-chapters-small","page-toc-button","livereload"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"livereload":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"page-toc-button":{},"back-to-top-button":{},"expandable-chapters-small":{},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"John Ousterhout","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"软件设计哲学","language":"zh-hans","gitbook":"*","description":"书中讨论了软件设计的主题：如何将复杂的软件系统分解成可以相对独立实现的模块(如类和方法)"},"file":{"path":"docs/ch6.md","mtime":"2020-08-06T16:26:19.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-02-06T04:55:41.669Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-page-toc-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

