
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第八章: 降低复杂性 · 软件设计哲学</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="John Ousterhout">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-page-toc-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="ch9.html" />
    
    
    <link rel="prev" href="ch7.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    首页
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="preface">
            
                <span>
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="ch1.html">
            
                <a href="ch1.html">
            
                    
                    第一章：介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="ch2.html">
            
                <a href="ch2.html">
            
                    
                    第二章：复杂性的本质
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="ch3.html">
            
                <a href="ch3.html">
            
                    
                    第三章：工作代码是不够的（战略与战术编程）
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="ch4.html">
            
                <a href="ch4.html">
            
                    
                    第四章：模块应该是深的
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="ch5.html">
            
                <a href="ch5.html">
            
                    
                    第五章：信息隐藏(和泄露)
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="ch6.html">
            
                <a href="ch6.html">
            
                    
                    第六章：通用模块更深入
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="ch7.html">
            
                <a href="ch7.html">
            
                    
                    第七章: 不同的层，不同的抽象
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.11" data-path="ch8.html">
            
                <a href="ch8.html">
            
                    
                    第八章: 降低复杂性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="ch9.html">
            
                <a href="ch9.html">
            
                    
                    第九章: 在一起更好还是分开更好？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="ch10.html">
            
                <a href="ch10.html">
            
                    
                    第十章: 定义不存在的错误
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="ch11.html">
            
                <a href="ch11.html">
            
                    
                    第十一章: 设计它两次
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="ch12.html">
            
                <a href="ch12.html">
            
                    
                    第十二章: 为什么写注释？四个理由
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="ch13.html">
            
                <a href="ch13.html">
            
                    
                    第十三章: 注释应该描述代码中不明显的内容
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="ch14.html">
            
                <a href="ch14.html">
            
                    
                    第十四章: 选择的名字
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="ch15.html">
            
                <a href="ch15.html">
            
                    
                    第十五章: 先写注释
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="ch16.html">
            
                <a href="ch16.html">
            
                    
                    第十六章: 修改现有的代码
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.20" data-path="ch17.html">
            
                <a href="ch17.html">
            
                    
                    第十七章: 一致性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.21" data-path="ch18.html">
            
                <a href="ch18.html">
            
                    
                    第十八章: 代码应该是显而易见的
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.22" data-path="ch19.html">
            
                <a href="ch19.html">
            
                    
                    第十九章: 软件发展趋势
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.23" data-path="ch20.html">
            
                <a href="ch20.html">
            
                    
                    第二十章: 设计性能
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.24" data-path="ch21.html">
            
                <a href="ch21.html">
            
                    
                    第二十一章: 结论
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.25" data-path="summary.html">
            
                <a href="summary.html">
            
                    
                    总结
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >第八章: 降低复杂性</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7B2C;-8-&#x7AE0;-&#x964D;&#x4F4E;&#x590D;&#x6742;&#x6027;">&#x7B2C; 8 &#x7AE0; &#x964D;&#x4F4E;&#x590D;&#x6742;&#x6027;</h1>
<p>&#x672C;&#x7AE0;&#x4ECB;&#x7ECD;&#x4E86;&#x6709;&#x5173;&#x5982;&#x4F55;&#x521B;&#x5EFA;&#x66F4;&#x6DF1;&#x5C42;&#x7C7B;&#x7684;&#x53E6;&#x4E00;&#x79CD;&#x601D;&#x8003;&#x65B9;&#x5F0F;&#x3002;&#x5047;&#x8BBE;&#x60A8;&#x6B63;&#x5728;&#x5F00;&#x53D1;&#x4E00;&#x4E2A;&#x65B0;&#x6A21;&#x5757;&#xFF0C;&#x5E76;&#x4E14;&#x53D1;&#x73B0;&#x4E86;&#x4E00;&#x4E2A;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#x7684;&#x590D;&#x6742;&#x6027;&#x3002;&#x54EA;&#x4E2A;&#x66F4;&#x597D;&#xFF1A;&#x5E94;&#x8BE5;&#x8BA9;&#x6A21;&#x5757;&#x7528;&#x6237;&#x5904;&#x7406;&#x590D;&#x6742;&#x6027;&#xFF0C;&#x8FD8;&#x662F;&#x5E94;&#x8BE5;&#x5728;&#x6A21;&#x5757;&#x5185;&#x90E8;&#x5904;&#x7406;&#x590D;&#x6742;&#x6027;&#xFF1F;&#x5982;&#x679C;&#x590D;&#x6742;&#x5EA6;&#x4E0E;&#x6A21;&#x5757;&#x63D0;&#x4F9B;&#x7684;&#x529F;&#x80FD;&#x6709;&#x5173;&#xFF0C;&#x5219;&#x7B2C;&#x4E8C;&#x4E2A;&#x7B54;&#x6848;&#x901A;&#x5E38;&#x662F;&#x6B63;&#x786E;&#x7684;&#x7B54;&#x6848;&#x3002;&#x5927;&#x591A;&#x6570;&#x6A21;&#x5757;&#x62E5;&#x6709;&#x7684;&#x7528;&#x6237;&#x591A;&#x4E8E;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#xFF0C;&#x56E0;&#x6B64;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x906D;&#x53D7;&#x7684;&#x82E6;&#x96BE;&#x8981;&#x5927;&#x4E8E;&#x7528;&#x6237;&#x3002;&#x4F5C;&#x4E3A;&#x6A21;&#x5757;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#xFF0C;&#x60A8;&#x5E94;&#x8BE5;&#x52AA;&#x529B;&#x4F7F;&#x6A21;&#x5757;&#x7528;&#x6237;&#x7684;&#x751F;&#x6D3B;&#x5C3D;&#x53EF;&#x80FD;&#x8F7B;&#x677E;&#xFF0C;&#x5373;&#x4F7F;&#x8FD9;&#x5BF9;&#x60A8;&#x6765;&#x8BF4;&#x610F;&#x5473;&#x7740;&#x989D;&#x5916;&#x7684;&#x5DE5;&#x4F5C;&#x3002;&#x8868;&#x8FBE;&#x6B64;&#x60F3;&#x6CD5;&#x7684;&#x53E6;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#xFF0C;&#x6A21;&#x5757;&#x5177;&#x6709;&#x7B80;&#x5355;&#x7684;&#x63A5;&#x53E3;&#x6BD4;&#x7B80;&#x5355;&#x7684;&#x5B9E;&#x73B0;&#x66F4;&#x4E3A;&#x91CD;&#x8981;&#x3002;</p>
<p>&#x4F5C;&#x4E3A;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#xFF0C;&#x5F88;&#x5BB9;&#x6613;&#x4EE5;&#x76F8;&#x53CD;&#x7684;&#x65B9;&#x5F0F;&#x884C;&#x4E8B;&#xFF1A;&#x89E3;&#x51B3;&#x7B80;&#x5355;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x56F0;&#x96BE;&#x7684;&#x95EE;&#x9898;&#x63A8;&#x7ED9;&#x5176;&#x4ED6;&#x4EBA;&#x3002;&#x5982;&#x679C;&#x51FA;&#x73B0;&#x4E0D;&#x786E;&#x5B9A;&#x5982;&#x4F55;&#x5904;&#x7406;&#x7684;&#x6761;&#x4EF6;&#xFF0C;&#x6700;&#x7B80;&#x5355;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x5F15;&#x53D1;&#x5F02;&#x5E38;&#x5E76;&#x8BA9;&#x8C03;&#x7528;&#x65B9;&#x5904;&#x7406;&#x5B83;&#x3002;&#x5982;&#x679C;&#x4E0D;&#x786E;&#x5B9A;&#x8981;&#x5B9E;&#x65BD;&#x4EC0;&#x4E48;&#x7B56;&#x7565;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x4E00;&#x4E9B;&#x914D;&#x7F6E;&#x53C2;&#x6570;&#x6765;&#x63A7;&#x5236;&#x8BE5;&#x7B56;&#x7565;&#xFF0C;&#x7136;&#x540E;&#x7531;&#x7CFB;&#x7EDF;&#x7BA1;&#x7406;&#x5458;&#x81EA;&#x884C;&#x786E;&#x5B9A;&#x6700;&#x4F73;&#x7B56;&#x7565;&#x3002;</p>
<p>&#x8FD9;&#x6837;&#x7684;&#x65B9;&#x6CD5;&#x77ED;&#x671F;&#x5185;&#x4F1A;&#x4F7F;&#x60A8;&#x7684;&#x751F;&#x6D3B;&#x66F4;&#x8F7B;&#x677E;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x4F1A;&#x52A0;&#x5267;&#x590D;&#x6742;&#x6027;&#xFF0C;&#x56E0;&#x6B64;&#x8BB8;&#x591A;&#x4EBA;&#x5FC5;&#x987B;&#x5904;&#x7406;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x800C;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x4E00;&#x4E2A;&#x4EBA;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x7C7B;&#x629B;&#x51FA;&#x5F02;&#x5E38;&#xFF0C;&#x5219;&#x8BE5;&#x7C7B;&#x7684;&#x6BCF;&#x4E2A;&#x8C03;&#x7528;&#x8005;&#x90FD;&#x5FC5;&#x987B;&#x5904;&#x7406;&#x8BE5;&#x5F02;&#x5E38;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x7C7B;&#x5BFC;&#x51FA;&#x914D;&#x7F6E;&#x53C2;&#x6570;&#xFF0C;&#x5219;&#x6BCF;&#x4E2A;&#x5B89;&#x88C5;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x7CFB;&#x7EDF;&#x7BA1;&#x7406;&#x5458;&#x90FD;&#x5FC5;&#x987B;&#x5B66;&#x4E60;&#x5982;&#x4F55;&#x8BBE;&#x7F6E;&#x5B83;&#x4EEC;&#x3002;</p>
<h4 id="81-example-editor-text-class-&#x793A;&#x4F8B;&#xFF1A;&#x7F16;&#x8F91;&#x5668;&#x6587;&#x672C;&#x7C7B;">8.1 Example: editor text class &#x793A;&#x4F8B;&#xFF1A;&#x7F16;&#x8F91;&#x5668;&#x6587;&#x672C;&#x7C7B;</h4>
<p>&#x8003;&#x8651;&#x4E3A; GUI &#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;&#x7BA1;&#x7406;&#x6587;&#x4EF6;&#x6587;&#x672C;&#x7684;&#x7C7B;&#xFF0C;&#x8FD9;&#x5728;&#x7B2C; 6 &#x7AE0;&#x548C;&#x7B2C; 7 &#x7AE0;&#x4E2D;&#x8BA8;&#x8BBA;&#x8FC7;&#x3002;&#x8BE5;&#x7C7B;&#x63D0;&#x4F9B;&#x4E86;&#x5C06;&#x6587;&#x4EF6;&#x4ECE;&#x78C1;&#x76D8;&#x8BFB;&#x5165;&#x5185;&#x5B58;&#x3001;&#x67E5;&#x8BE2;&#x548C;&#x4FEE;&#x6539;&#x6587;&#x4EF6;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x526F;&#x672C;&#x4EE5;&#x53CA;&#x5C06;&#x4FEE;&#x6539;&#x540E;&#x7684;&#x7248;&#x672C;&#x5199;&#x56DE;&#x78C1;&#x76D8;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x5F53;&#x5B66;&#x751F;&#x5FC5;&#x987B;&#x5B9E;&#x73B0;&#x8FD9;&#x4E2A;&#x7C7B;&#x65F6;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E2D;&#x7684;&#x8BB8;&#x591A;&#x4EBA;&#x9009;&#x62E9;&#x4E86;&#x4E00;&#x4E2A;&#x9762;&#x5411;&#x884C;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x8BE5;&#x63A5;&#x53E3;&#x5177;&#x6709;&#x8BFB;&#x53D6;&#x3001;&#x63D2;&#x5165;&#x548C;&#x5220;&#x9664;&#x6574;&#x884C;&#x6587;&#x672C;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x8FD9;&#x5BFC;&#x81F4;&#x4E86;&#x7C7B;&#x7684;&#x7B80;&#x5355;&#x5B9E;&#x73B0;&#xFF0C;&#x4F46;&#x4E5F;&#x4E3A;&#x66F4;&#x9AD8;&#x7EA7;&#x522B;&#x7684;&#x8F6F;&#x4EF6;&#x5E26;&#x6765;&#x4E86;&#x590D;&#x6742;&#x6027;&#x3002;&#x5728;&#x7528;&#x6237;&#x754C;&#x9762;&#x7EA7;&#x522B;&#xFF0C;&#x64CD;&#x4F5C;&#x5F88;&#x5C11;&#x6D89;&#x53CA;&#x6574;&#x884C;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x51FB;&#x952E;&#x4F1A;&#x5BFC;&#x81F4;&#x5728;&#x73B0;&#x6709;&#x884C;&#x4E2D;&#x63D2;&#x5165;&#x5355;&#x4E2A;&#x5B57;&#x7B26;;&#x590D;&#x5236;&#x6216;&#x5220;&#x9664;&#x9009;&#x62E9;&#x9879;&#x53EF;&#x4EE5;&#x4FEE;&#x6539;&#x51E0;&#x4E2A;&#x4E0D;&#x540C;&#x884C;&#x7684;&#x90E8;&#x5206;&#x3002;&#x4F7F;&#x7528;&#x9762;&#x5411;&#x884C;&#x7684;&#x6587;&#x672C;&#x754C;&#x9762;&#xFF0C;&#x4E3A;&#x4E86;&#x5B9E;&#x73B0;&#x7528;&#x6237;&#x754C;&#x9762;&#xFF0C;&#x9AD8;&#x7EA7;&#x8F6F;&#x4EF6;&#x5FC5;&#x987B;&#x5206;&#x5272;&#x548C;&#x8FDE;&#x63A5;&#x884C;&#x3002;</p>
<p>&#x9762;&#x5411;&#x5B57;&#x7B26;&#x7684;&#x754C;&#x9762;&#xFF08;&#x5982; 6.3 &#x8282;&#x4E2D;&#x6240;&#x8FF0;&#xFF09;&#x964D;&#x4F4E;&#x4E86;&#x590D;&#x6742;&#x6027;&#x3002;&#x7528;&#x6237;&#x754C;&#x9762;&#x8F6F;&#x4EF6;&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x63D2;&#x5165;&#x548C;&#x5220;&#x9664;&#x4EFB;&#x610F;&#x8303;&#x56F4;&#x7684;&#x6587;&#x672C;&#xFF0C;&#x800C;&#x65E0;&#x9700;&#x5206;&#x5272;&#x548C;&#x5408;&#x5E76;&#x884C;&#xFF0C;&#x56E0;&#x6B64;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x7B80;&#x5355;&#x3002;&#x6587;&#x672C;&#x7C7B;&#x7684;&#x5B9E;&#x73B0;&#x53EF;&#x80FD;&#x4F1A;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x590D;&#x6742;&#xFF1A;&#x5982;&#x679C;&#x5185;&#x90E8;&#x5C06;&#x6587;&#x672C;&#x8868;&#x793A;&#x4E3A;&#x884C;&#x7684;&#x96C6;&#x5408;&#xFF0C;&#x5219;&#x5FC5;&#x987B;&#x62C6;&#x5206;&#x548C;&#x5408;&#x5E76;&#x884C;&#x4EE5;&#x5B9E;&#x73B0;&#x9762;&#x5411;&#x5B57;&#x7B26;&#x7684;&#x64CD;&#x4F5C;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x66F4;&#x597D;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x5C01;&#x88C5;&#x4E86;&#x5728;&#x6587;&#x672C;&#x7C7B;&#x4E2D;&#x62C6;&#x5206;&#x548C;&#x5408;&#x5E76;&#x7684;&#x590D;&#x6742;&#x6027;&#xFF0C;&#x4ECE;&#x800C;&#x964D;&#x4F4E;&#x4E86;&#x7CFB;&#x7EDF;&#x7684;&#x6574;&#x4F53;&#x590D;&#x6742;&#x6027;&#x3002;</p>
<h4 id="82-example-configuration-parameters-&#x793A;&#x4F8B;&#xFF1A;&#x914D;&#x7F6E;&#x53C2;&#x6570;">8.2 Example: configuration parameters &#x793A;&#x4F8B;&#xFF1A;&#x914D;&#x7F6E;&#x53C2;&#x6570;</h4>
<p>&#x914D;&#x7F6E;&#x53C2;&#x6570;&#x662F;&#x63D0;&#x9AD8;&#x590D;&#x6742;&#x5EA6;&#x800C;&#x4E0D;&#x662F;&#x964D;&#x4F4E;&#x590D;&#x6742;&#x5EA6;&#x7684;&#x4E00;&#x4E2A;&#x793A;&#x4F8B;&#x3002;&#x7C7B;&#x53EF;&#x4EE5;&#x5728;&#x5185;&#x90E8;&#x8F93;&#x51FA;&#x4E00;&#x4E9B;&#x63A7;&#x5236;&#x5176;&#x884C;&#x4E3A;&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5728;&#x5185;&#x90E8;&#x786E;&#x5B9A;&#x7279;&#x5B9A;&#x7684;&#x884C;&#x4E3A;&#xFF0C;&#x4F8B;&#x5982;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x7684;&#x5927;&#x5C0F;&#x6216;&#x5728;&#x653E;&#x5F03;&#x4E4B;&#x524D;&#x91CD;&#x8BD5;&#x8BF7;&#x6C42;&#x7684;&#x6B21;&#x6570;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x8BE5;&#x7C7B;&#x7684;&#x7528;&#x6237;&#x5FC5;&#x987B;&#x4E3A;&#x53C2;&#x6570;&#x6307;&#x5B9A;&#x9002;&#x5F53;&#x7684;&#x503C;&#x3002;&#x5728;&#x5F53;&#x4ECA;&#x7684;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x914D;&#x7F6E;&#x53C2;&#x6570;&#x5DF2;&#x53D8;&#x5F97;&#x975E;&#x5E38;&#x6D41;&#x884C;&#x3002;&#x6709;&#x4E9B;&#x7CFB;&#x7EDF;&#x6709;&#x6570;&#x767E;&#x4E2A;&#x3002;</p>
<p>&#x62E5;&#x62A4;&#x8005;&#x8BA4;&#x4E3A;&#x914D;&#x7F6E;&#x53C2;&#x6570;&#x4E0D;&#x9519;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x5141;&#x8BB8;&#x7528;&#x6237;&#x6839;&#x636E;&#x4ED6;&#x4EEC;&#x7684;&#x7279;&#x5B9A;&#x8981;&#x6C42;&#x548C;&#x5DE5;&#x4F5C;&#x8D1F;&#x8F7D;&#x6765;&#x8C03;&#x6574;&#x7CFB;&#x7EDF;&#x3002;&#x5728;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F4E;&#x7EA7;&#x57FA;&#x7840;&#x7ED3;&#x6784;&#x4EE3;&#x7801;&#x5F88;&#x96BE;&#x77E5;&#x9053;&#x8981;&#x5E94;&#x7528;&#x7684;&#x6700;&#x4F73;&#x7B56;&#x7565;&#xFF0C;&#x800C;&#x7528;&#x6237;&#x5219;&#x5BF9;&#x5176;&#x57DF;&#x66F4;&#x52A0;&#x719F;&#x6089;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x7528;&#x6237;&#x53EF;&#x80FD;&#x77E5;&#x9053;&#x67D0;&#x4E9B;&#x8BF7;&#x6C42;&#x6BD4;&#x5176;&#x4ED6;&#x8BF7;&#x6C42;&#x66F4;&#x7D27;&#x8FEB;&#xFF0C;&#x56E0;&#x6B64;&#x7528;&#x6237;&#x4E3A;&#x8FD9;&#x4E9B;&#x8BF7;&#x6C42;&#x6307;&#x5B9A;&#x66F4;&#x9AD8;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#x662F;&#x6709;&#x610F;&#x4E49;&#x7684;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x914D;&#x7F6E;&#x53C2;&#x6570;&#x53EF;&#x4EE5;&#x5728;&#x66F4;&#x5E7F;&#x6CDB;&#x7684;&#x57DF;&#x4E2D;&#x5E26;&#x6765;&#x66F4;&#x597D;&#x7684;&#x6027;&#x80FD;&#x3002;</p>
<p>&#x4F46;&#x662F;&#xFF0C;&#x914D;&#x7F6E;&#x53C2;&#x6570;&#x8FD8;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x8F7B;&#x677E;&#x7684;&#x501F;&#x53E3;&#xFF0C;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x5904;&#x7406;&#x91CD;&#x8981;&#x95EE;&#x9898;&#x5E76;&#x5C06;&#x5176;&#x4F20;&#x9012;&#x7ED9;&#x5176;&#x4ED6;&#x4EBA;&#x3002;&#x5728;&#x8BB8;&#x591A;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x7528;&#x6237;&#x6216;&#x7BA1;&#x7406;&#x5458;&#x5F88;&#x96BE;&#x6216;&#x65E0;&#x6CD5;&#x786E;&#x5B9A;&#x53C2;&#x6570;&#x7684;&#x6B63;&#x786E;&#x503C;&#x3002;&#x5728;&#x5176;&#x4ED6;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5728;&#x7CFB;&#x7EDF;&#x5B9E;&#x73B0;&#x4E2D;&#x8FDB;&#x884C;&#x4E00;&#x4E9B;&#x989D;&#x5916;&#x7684;&#x5DE5;&#x4F5C;&#x6765;&#x81EA;&#x52A8;&#x786E;&#x5B9A;&#x6B63;&#x786E;&#x7684;&#x503C;&#x3002;&#x8003;&#x8651;&#x5FC5;&#x987B;&#x5904;&#x7406;&#x4E22;&#x5931;&#x6570;&#x636E;&#x5305;&#x7684;&#x7F51;&#x7EDC;&#x534F;&#x8BAE;&#x3002;&#x5982;&#x679C;&#x5B83;&#x53D1;&#x9001;&#x8BF7;&#x6C42;&#x4F46;&#x5728;&#x4E00;&#x5B9A;&#x65F6;&#x95F4;&#x5185;&#x672A;&#x6536;&#x5230;&#x54CD;&#x5E94;&#xFF0C;&#x5219;&#x91CD;&#x65B0;&#x53D1;&#x9001;&#x8BE5;&#x8BF7;&#x6C42;&#x3002;&#x786E;&#x5B9A;&#x91CD;&#x8BD5;&#x95F4;&#x9694;&#x7684;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x5F15;&#x5165;&#x914D;&#x7F6E;&#x53C2;&#x6570;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x4F20;&#x8F93;&#x534F;&#x8BAE;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x6D4B;&#x91CF;&#x6210;&#x529F;&#x8BF7;&#x6C42;&#x7684;&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x5176;&#x500D;&#x6570;&#x7528;&#x4E8E;&#x91CD;&#x8BD5;&#x95F4;&#x9694;&#xFF0C;&#x81EA;&#x5DF1;&#x8BA1;&#x7B97;&#x51FA;&#x4E00;&#x4E2A;&#x5408;&#x7406;&#x7684;&#x503C;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x964D;&#x4F4E;&#x4E86;&#x590D;&#x6742;&#x6027;&#xFF0C;&#x4F7F;&#x7528;&#x6237;&#x4E0D;&#x5FC5;&#x627E;&#x51FA;&#x6B63;&#x786E;&#x7684;&#x91CD;&#x8BD5;&#x95F4;&#x9694;&#x3002;&#x5B83;&#x5177;&#x6709;&#x52A8;&#x6001;&#x8BA1;&#x7B97;&#x91CD;&#x8BD5;&#x95F4;&#x9694;&#x7684;&#x5176;&#x4ED6;&#x4F18;&#x70B9;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x5982;&#x679C;&#x64CD;&#x4F5C;&#x6761;&#x4EF6;&#x53D1;&#x751F;&#x53D8;&#x5316;&#xFF0C;&#x5B83;&#x5C06;&#x81EA;&#x52A8;&#x8FDB;&#x884C;&#x8C03;&#x6574;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x914D;&#x7F6E;&#x53C2;&#x6570;&#x5F88;&#x5BB9;&#x6613;&#x8FC7;&#x65F6;&#x3002;</p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x60A8;&#x5E94;&#x5C3D;&#x53EF;&#x80FD;&#x907F;&#x514D;&#x4F7F;&#x7528;&#x914D;&#x7F6E;&#x53C2;&#x6570;&#x3002;&#x5728;&#x5BFC;&#x51FA;&#x914D;&#x7F6E;&#x53C2;&#x6570;&#x4E4B;&#x524D;&#xFF0C;&#x8BF7;&#x95EE;&#x81EA;&#x5DF1;&#xFF1A;&#x201C;&#x7528;&#x6237;&#xFF08;&#x6216;&#x66F4;&#x9AD8;&#x7EA7;&#x522B;&#x7684;&#x6A21;&#x5757;&#xFF09;&#x662F;&#x5426;&#x80FD;&#x591F;&#x786E;&#x5B9A;&#x6BD4;&#x6211;&#x4EEC;&#x5728;&#x6B64;&#x786E;&#x5B9A;&#x7684;&#x66F4;&#x597D;&#x7684;&#x503C;&#xFF1F;&#x201D; &#x5F53;&#x60A8;&#x521B;&#x5EFA;&#x914D;&#x7F6E;&#x53C2;&#x6570;&#x65F6;&#xFF0C;&#x8BF7;&#x67E5;&#x770B;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x81EA;&#x52A8;&#x8BA1;&#x7B97;&#x5408;&#x7406;&#x7684;&#x9ED8;&#x8BA4;&#x503C;&#xFF0C;&#x56E0;&#x6B64;&#x7528;&#x6237;&#x4EC5;&#x9700;&#x5728;&#x7279;&#x6B8A;&#x60C5;&#x51B5;&#x4E0B;&#x63D0;&#x4F9B;&#x503C;&#x5373;&#x53EF;&#x3002;&#x7406;&#x60F3;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6BCF;&#x4E2A;&#x6A21;&#x5757;&#x90FD;&#x5E94;&#x5B8C;&#x5168;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x3002;&#x914D;&#x7F6E;&#x53C2;&#x6570;&#x5BFC;&#x81F4;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x4E0D;&#x5B8C;&#x6574;&#xFF0C;&#x4ECE;&#x800C;&#x589E;&#x52A0;&#x4E86;&#x7CFB;&#x7EDF;&#x590D;&#x6742;&#x6027;&#x3002;</p>
<h4 id="83-taking-it-too-far-&#x8D70;&#x5F97;&#x592A;&#x8FDC;">8.3 Taking it too far &#x8D70;&#x5F97;&#x592A;&#x8FDC;</h4>
<p>&#x964D;&#x4F4E;&#x590D;&#x6742;&#x6027;&#x65F6;&#x8981;&#x8C28;&#x614E;&#x5904;&#x7406;&#xFF1B;&#x8FD9;&#x4E2A;&#x60F3;&#x6CD5;&#x5F88;&#x5BB9;&#x6613;&#x88AB;&#x5938;&#x5927;&#x3002;&#x4E00;&#x79CD;&#x6781;&#x7AEF;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x5C06;&#x6574;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x6240;&#x6709;&#x529F;&#x80FD;&#x5F52;&#x4E3A;&#x4E00;&#x4E2A;&#x7C7B;&#xFF0C;&#x8FD9;&#x663E;&#x7136;&#x6CA1;&#x6709;&#x610F;&#x4E49;&#x3002;&#x5982;&#x679C;&#xFF08;a&#xFF09;&#x88AB;&#x964D;&#x4F4E;&#x7684;&#x590D;&#x6742;&#x5EA6;&#x4E0E;&#x8BE5;&#x7C7B;&#x7684;&#x73B0;&#x6709;&#x529F;&#x80FD;&#x5BC6;&#x5207;&#x76F8;&#x5173;&#xFF0C;&#xFF08;b&#xFF09;&#x964D;&#x4F4E;&#x590D;&#x6742;&#x5EA6;&#x5C06;&#x5BFC;&#x81F4;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x5176;&#x4ED6;&#x5730;&#x65B9;&#x7684;&#x8BB8;&#x591A;&#x7B80;&#x5316;&#xFF0C;&#x5219;&#x964D;&#x4F4E;&#x590D;&#x6742;&#x5EA6;&#x6700;&#x6709;&#x610F;&#x4E49;&#x3002;&#x7B80;&#x5316;&#x4E86;&#x7C7B;&#x7684;&#x754C;&#x9762;&#x3002;&#x8BF7;&#x8BB0;&#x4F4F;&#xFF0C;&#x76EE;&#x6807;&#x662F;&#x6700;&#x5927;&#x7A0B;&#x5EA6;&#x5730;&#x964D;&#x4F4E;&#x6574;&#x4F53;&#x7CFB;&#x7EDF;&#x590D;&#x6742;&#x6027;&#x3002;</p>
<p>&#x7B2C; 6 &#x7AE0;&#x4ECB;&#x7ECD;&#x4E86;&#x4E00;&#x4E9B;&#x5B66;&#x751F;&#x5982;&#x4F55;&#x5728;&#x6587;&#x672C;&#x7C7B;&#x4E2D;&#x5B9A;&#x4E49;&#x53CD;&#x6620;&#x7528;&#x6237;&#x754C;&#x9762;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x4F8B;&#x5982;&#x5B9E;&#x73B0;&#x9000;&#x683C;&#x952E;&#x529F;&#x80FD;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x8FD9;&#x4F3C;&#x4E4E;&#x5F88;&#x597D;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x53EF;&#x4EE5;&#x964D;&#x4F4E;&#x590D;&#x6742;&#x6027;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5C06;&#x7528;&#x6237;&#x754C;&#x9762;&#x7684;&#x77E5;&#x8BC6;&#x6DFB;&#x52A0;&#x5230;&#x6587;&#x672C;&#x7C7B;&#x4E2D;&#x5E76;&#x4E0D;&#x4F1A;&#x5927;&#x5927;&#x7B80;&#x5316;&#x9AD8;&#x5C42;&#x4EE3;&#x7801;&#xFF0C;&#x5E76;&#x4E14;&#x7528;&#x6237;&#x754C;&#x9762;&#x7684;&#x77E5;&#x8BC6;&#x4E0E;&#x6587;&#x672C;&#x7C7B;&#x7684;&#x6838;&#x5FC3;&#x529F;&#x80FD;&#x65E0;&#x5173;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x964D;&#x4F4E;&#x590D;&#x6742;&#x5EA6;&#x53EA;&#x4F1A;&#x5BFC;&#x81F4;&#x4FE1;&#x606F;&#x6CC4;&#x6F0F;&#x3002;</p>
<h4 id="84-conclusion-&#x7ED3;&#x8BBA;">8.4 Conclusion &#x7ED3;&#x8BBA;</h4>
<p>&#x5728;&#x5F00;&#x53D1;&#x6A21;&#x5757;&#x65F6;&#xFF0C;&#x8BF7;&#x5BFB;&#x627E;&#x673A;&#x4F1A;&#x51CF;&#x8F7B;&#x81EA;&#x5DF1;&#x7684;&#x75DB;&#x82E6;&#xFF0C;&#x4EE5;&#x51CF;&#x8F7B;&#x7528;&#x6237;&#x7684;&#x75DB;&#x82E6;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="ch7.html" class="navigation navigation-prev " aria-label="Previous page: 第七章: 不同的层，不同的抽象">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="ch9.html" class="navigation navigation-next " aria-label="Next page: 第九章: 在一起更好还是分开更好？">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第八章: 降低复杂性","level":"1.11","depth":1,"next":{"title":"第九章: 在一起更好还是分开更好？","level":"1.12","depth":1,"path":"docs/ch9.md","ref":"./docs/ch9.md","articles":[]},"previous":{"title":"第七章: 不同的层，不同的抽象","level":"1.10","depth":1,"path":"docs/ch7.md","ref":"./docs/ch7.md","articles":[]},"dir":"ltr"},"config":{"plugins":["back-to-top-button","expandable-chapters-small","page-toc-button","livereload"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"livereload":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"page-toc-button":{},"back-to-top-button":{},"expandable-chapters-small":{},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"John Ousterhout","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"软件设计哲学","language":"zh-hans","gitbook":"*","description":"书中讨论了软件设计的主题：如何将复杂的软件系统分解成可以相对独立实现的模块(如类和方法)"},"file":{"path":"docs/ch8.md","mtime":"2020-08-06T16:26:19.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-02-06T04:55:41.669Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-page-toc-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

