
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第九章: 在一起更好还是分开更好？ · 软件设计哲学</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="John Ousterhout">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-page-toc-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="ch10.html" />
    
    
    <link rel="prev" href="ch8.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    首页
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="preface">
            
                <span>
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="ch1.html">
            
                <a href="ch1.html">
            
                    
                    第一章：介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="ch2.html">
            
                <a href="ch2.html">
            
                    
                    第二章：复杂性的本质
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="ch3.html">
            
                <a href="ch3.html">
            
                    
                    第三章：工作代码是不够的（战略与战术编程）
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="ch4.html">
            
                <a href="ch4.html">
            
                    
                    第四章：模块应该是深的
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="ch5.html">
            
                <a href="ch5.html">
            
                    
                    第五章：信息隐藏(和泄露)
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="ch6.html">
            
                <a href="ch6.html">
            
                    
                    第六章：通用模块更深入
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="ch7.html">
            
                <a href="ch7.html">
            
                    
                    第七章: 不同的层，不同的抽象
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="ch8.html">
            
                <a href="ch8.html">
            
                    
                    第八章: 降低复杂性
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.12" data-path="ch9.html">
            
                <a href="ch9.html">
            
                    
                    第九章: 在一起更好还是分开更好？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="ch10.html">
            
                <a href="ch10.html">
            
                    
                    第十章: 定义不存在的错误
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="ch11.html">
            
                <a href="ch11.html">
            
                    
                    第十一章: 设计它两次
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="ch12.html">
            
                <a href="ch12.html">
            
                    
                    第十二章: 为什么写注释？四个理由
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="ch13.html">
            
                <a href="ch13.html">
            
                    
                    第十三章: 注释应该描述代码中不明显的内容
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="ch14.html">
            
                <a href="ch14.html">
            
                    
                    第十四章: 选择的名字
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="ch15.html">
            
                <a href="ch15.html">
            
                    
                    第十五章: 先写注释
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="ch16.html">
            
                <a href="ch16.html">
            
                    
                    第十六章: 修改现有的代码
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.20" data-path="ch17.html">
            
                <a href="ch17.html">
            
                    
                    第十七章: 一致性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.21" data-path="ch18.html">
            
                <a href="ch18.html">
            
                    
                    第十八章: 代码应该是显而易见的
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.22" data-path="ch19.html">
            
                <a href="ch19.html">
            
                    
                    第十九章: 软件发展趋势
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.23" data-path="ch20.html">
            
                <a href="ch20.html">
            
                    
                    第二十章: 设计性能
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.24" data-path="ch21.html">
            
                <a href="ch21.html">
            
                    
                    第二十一章: 结论
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.25" data-path="summary.html">
            
                <a href="summary.html">
            
                    
                    总结
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >第九章: 在一起更好还是分开更好？</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x7B2C;-9-&#x7AE0;-&#x5728;&#x4E00;&#x8D77;&#x66F4;&#x597D;&#x8FD8;&#x662F;&#x5206;&#x5F00;&#x66F4;&#x597D;&#xFF1F;">&#x7B2C; 9 &#x7AE0; &#x5728;&#x4E00;&#x8D77;&#x66F4;&#x597D;&#x8FD8;&#x662F;&#x5206;&#x5F00;&#x66F4;&#x597D;&#xFF1F;</h1>
<p>&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x4E2D;&#x6700;&#x57FA;&#x672C;&#x7684;&#x95EE;&#x9898;&#x4E4B;&#x4E00;&#x662F;&#xFF1A;&#x7ED9;&#x5B9A;&#x4E24;&#x4E2A;&#x529F;&#x80FD;&#xFF0C;&#x5B83;&#x4EEC;&#x5E94;&#x8BE5;&#x5728;&#x540C;&#x4E00;&#x4F4D;&#x7F6E;&#x4E00;&#x8D77;&#x5B9E;&#x73B0;&#xFF0C;&#x8FD8;&#x662F;&#x5E94;&#x8BE5;&#x5206;&#x5F00;&#x5B9E;&#x73B0;&#xFF1F;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x9002;&#x7528;&#x4E8E;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x7EA7;&#x522B;&#xFF0C;&#x4F8B;&#x5982;&#x529F;&#x80FD;&#xFF0C;&#x65B9;&#x6CD5;&#xFF0C;&#x7C7B;&#x548C;&#x670D;&#x52A1;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5E94;&#x8BE5;&#x5728;&#x63D0;&#x4F9B;&#x9762;&#x5411;&#x6D41;&#x7684;&#x6587;&#x4EF6; I/O &#x7684;&#x7C7B;&#x4E2D;&#x5305;&#x62EC;&#x7F13;&#x51B2;&#xFF0C;&#x8FD8;&#x662F;&#x5E94;&#x8BE5;&#x5728;&#x5355;&#x72EC;&#x7684;&#x7C7B;&#x4E2D;&#xFF1F;HTTP &#x8BF7;&#x6C42;&#x7684;&#x89E3;&#x6790;&#x5E94;&#x8BE5;&#x5B8C;&#x5168;&#x5728;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x4E2D;&#x5B9E;&#x73B0;&#xFF0C;&#x8FD8;&#x662F;&#x5E94;&#x8BE5;&#x5728;&#x591A;&#x4E2A;&#x65B9;&#x6CD5;&#xFF08;&#x751A;&#x81F3;&#x591A;&#x4E2A;&#x7C7B;&#xFF09;&#x4E4B;&#x95F4;&#x5212;&#x5206;&#xFF1F;&#x672C;&#x7AE0;&#x8BA8;&#x8BBA;&#x505A;&#x51FA;&#x8FD9;&#x4E9B;&#x51B3;&#x5B9A;&#x65F6;&#x8981;&#x8003;&#x8651;&#x7684;&#x56E0;&#x7D20;&#x3002;&#x8FD9;&#x4E9B;&#x56E0;&#x7D20;&#x4E2D;&#x7684;&#x4E00;&#x4E9B;&#x5DF2;&#x7ECF;&#x5728;&#x524D;&#x9762;&#x7684;&#x7AE0;&#x8282;&#x4E2D;&#x8FDB;&#x884C;&#x4E86;&#x8BA8;&#x8BBA;&#xFF0C;&#x4F46;&#x662F;&#x4E3A;&#x4E86;&#x5B8C;&#x6574;&#x8D77;&#x89C1;&#xFF0C;&#x8FD9;&#x91CC;&#x5C06;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x91CD;&#x65B0;&#x8BA8;&#x8BBA;&#x3002;</p>
<p>&#x5728;&#x51B3;&#x5B9A;&#x662F;&#x5408;&#x5E76;&#x8FD8;&#x662F;&#x5206;&#x5F00;&#x65F6;&#xFF0C;&#x76EE;&#x6807;&#x662F;&#x964D;&#x4F4E;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x7684;&#x590D;&#x6742;&#x6027;&#x5E76;&#x6539;&#x5584;&#x5176;&#x6A21;&#x5757;&#x5316;&#x3002;&#x770B;&#x6765;&#x5B9E;&#x73B0;&#x6B64;&#x76EE;&#x6807;&#x7684;&#x6700;&#x4F73;&#x65B9;&#x6CD5;&#x662F;&#x5C06;&#x7CFB;&#x7EDF;&#x5212;&#x5206;&#x4E3A;&#x5927;&#x91CF;&#x7684;&#x5C0F;&#x7EC4;&#x4EF6;&#xFF1A;&#x7EC4;&#x4EF6;&#x8D8A;&#x5C0F;&#xFF0C;&#x6BCF;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x7EC4;&#x4EF6;&#x53EF;&#x80FD;&#x8D8A;&#x7B80;&#x5355;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x7EC6;&#x5206;&#x7684;&#x884C;&#x4E3A;&#x4F1A;&#x5E26;&#x6765;&#x989D;&#x5916;&#x7684;&#x590D;&#x6742;&#x6027;&#xFF0C;&#x800C;&#x8FD9;&#x5728;&#x7EC6;&#x5206;&#x4E4B;&#x524D;&#x662F;&#x4E0D;&#x5B58;&#x5728;&#x7684;&#xFF1A;</p>
<ul>
<li>&#x4E00;&#x4E9B;&#x7EC4;&#x4EF6;&#x7684;&#x590D;&#x6742;&#x6027;&#x4EC5;&#x6765;&#x81EA;&#x7EC4;&#x4EF6;&#x7684;&#x6570;&#x91CF;&#xFF1A;&#x7EC4;&#x4EF6;&#x8D8A;&#x591A;&#xFF0C;&#x5C31;&#x8D8A;&#x96BE;&#x4EE5;&#x8FFD;&#x8E2A;&#x6240;&#x6709;&#x7EC4;&#x4EF6;&#xFF0C;&#x4E5F;&#x5C31;&#x8D8A;&#x96BE;&#x5728;&#x5927;&#x578B;&#x96C6;&#x5408;&#x4E2D;&#x627E;&#x5230;&#x6240;&#x9700;&#x7684;&#x7EC4;&#x4EF6;&#x3002;&#x7EC6;&#x5206;&#x901A;&#x5E38;&#x4F1A;&#x5BFC;&#x81F4;&#x66F4;&#x591A;&#x63A5;&#x53E3;&#xFF0C;&#x5E76;&#x4E14;&#x6BCF;&#x4E2A;&#x65B0;&#x63A5;&#x53E3;&#x90FD;&#x4F1A;&#x589E;&#x52A0;&#x590D;&#x6742;&#x6027;&#x3002;</li>
<li>&#x7EC6;&#x5206;&#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x9644;&#x52A0;&#x4EE3;&#x7801;&#x6765;&#x7BA1;&#x7406;&#x7EC4;&#x4EF6;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5728;&#x7EC6;&#x5206;&#x4E4B;&#x524D;&#x4F7F;&#x7528;&#x5355;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x4E00;&#x6BB5;&#x4EE3;&#x7801;&#x73B0;&#x5728;&#x53EF;&#x80FD;&#x5FC5;&#x987B;&#x7BA1;&#x7406;&#x591A;&#x4E2A;&#x5BF9;&#x8C61;&#x3002;</li>
<li>&#x7EC6;&#x5206;&#x4EA7;&#x751F;&#x5206;&#x79BB;&#xFF1A;&#x7EC6;&#x5206;&#x540E;&#x7684;&#x7EC4;&#x4EF6;&#x5C06;&#x6BD4;&#x7EC6;&#x5206;&#x524D;&#x7684;&#x7EC4;&#x4EF6;&#x76F8;&#x8DDD;&#x66F4;&#x8FDC;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5728;&#x7EC6;&#x5206;&#x4E4B;&#x524D;&#x4F4D;&#x4E8E;&#x5355;&#x4E2A;&#x7C7B;&#x4E2D;&#x7684;&#x65B9;&#x6CD5;&#x53EF;&#x80FD;&#x5728;&#x7EC6;&#x5206;&#x4E4B;&#x540E;&#x4F4D;&#x4E8E;&#x4E0D;&#x540C;&#x7684;&#x7C7B;&#x4E2D;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x80FD;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x6587;&#x4EF6;&#x4E2D;&#x3002;&#x5206;&#x79BB;&#x4F7F;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x66F4;&#x96BE;&#x4E8E;&#x540C;&#x65F6;&#x67E5;&#x770B;&#x8FD9;&#x4E9B;&#x7EC4;&#x4EF6;&#xFF0C;&#x751A;&#x81F3;&#x5F88;&#x96BE;&#x77E5;&#x9053;&#x5B83;&#x4EEC;&#x7684;&#x5B58;&#x5728;&#x3002;&#x5982;&#x679C;&#x7EC4;&#x4EF6;&#x771F;&#x6B63;&#x72EC;&#x7ACB;&#xFF0C;&#x90A3;&#x4E48;&#x5206;&#x79BB;&#x662F;&#x597D;&#x7684;&#xFF1A;&#x5B83;&#x4F7F;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x53EF;&#x4EE5;&#x4E00;&#x6B21;&#x4E13;&#x6CE8;&#x4E8E;&#x5355;&#x4E2A;&#x7EC4;&#x4EF6;&#xFF0C;&#x800C;&#x4E0D;&#x4F1A;&#x88AB;&#x5176;&#x4ED6;&#x7EC4;&#x4EF6;&#x5206;&#x6563;&#x6CE8;&#x610F;&#x529B;&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x5982;&#x679C;&#x7EC4;&#x4EF6;&#x4E4B;&#x95F4;&#x5B58;&#x5728;&#x4F9D;&#x8D56;&#x6027;&#xFF0C;&#x5219;&#x5206;&#x79BB;&#x662F;&#x4E0D;&#x597D;&#x7684;&#xFF1A;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x6700;&#x7EC8;&#x5C06;&#x5728;&#x7EC4;&#x4EF6;&#x4E4B;&#x95F4;&#x6765;&#x56DE;&#x7FFB;&#x8F6C;&#x3002;&#x66F4;&#x7CDF;&#x7CD5;&#x7684;&#x662F;&#xFF0C;&#x4ED6;&#x4EEC;&#x53EF;&#x80FD;&#x4E0D;&#x4E86;&#x89E3;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#xFF0C;&#x8FD9;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x9519;&#x8BEF;&#x3002;</li>
<li>&#x7EC6;&#x5206;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x91CD;&#x590D;&#xFF1A;&#x7EC6;&#x5206;&#x4E4B;&#x524D;&#x7684;&#x5355;&#x4E2A;&#x5B9E;&#x4F8B;&#x4E2D;&#x5B58;&#x5728;&#x7684;&#x4EE3;&#x7801;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x5B58;&#x5728;&#x4E8E;&#x6BCF;&#x4E2A;&#x7EC6;&#x5206;&#x7684;&#x7EC4;&#x4EF6;&#x4E2D;&#x3002;</li>
</ul>
<p>&#x5982;&#x679C;&#x5B83;&#x4EEC;&#x7D27;&#x5BC6;&#x76F8;&#x5173;&#xFF0C;&#x5219;&#x5C06;&#x4EE3;&#x7801;&#x6BB5;&#x7EC4;&#x5408;&#x5728;&#x4E00;&#x8D77;&#x662F;&#x6700;&#x6709;&#x76CA;&#x7684;&#x3002;&#x5982;&#x679C;&#x5404;&#x90E8;&#x5206;&#x65E0;&#x5173;&#xFF0C;&#x5219;&#x6700;&#x597D;&#x5206;&#x5F00;&#x3002;&#x4EE5;&#x4E0B;&#x662F;&#x4E24;&#x4E2A;&#x4EE3;&#x7801;&#x76F8;&#x5173;&#x7684;&#x4E00;&#x4E9B;&#x63D0;&#x793A;&#xFF1A;</p>
<ul>
<li>&#x4ED6;&#x4EEC;&#x5171;&#x4EAB;&#x4FE1;&#x606F;&#xFF1B;&#x4F8B;&#x5982;&#xFF0C;&#x8FD9;&#x4E24;&#x6BB5;&#x4EE3;&#x7801;&#x90FD;&#x53EF;&#x80FD;&#x53D6;&#x51B3;&#x4E8E;&#x7279;&#x5B9A;&#x7C7B;&#x578B;&#x6587;&#x6863;&#x7684;&#x8BED;&#x6CD5;&#x3002;</li>
<li>&#x5B83;&#x4EEC;&#x4E00;&#x8D77;&#x4F7F;&#x7528;&#xFF1A;&#x4EFB;&#x4F55;&#x4F7F;&#x7528;&#x5176;&#x4E2D;&#x4E00;&#x6BB5;&#x4EE3;&#x7801;&#x7684;&#x4EBA;&#x90FD;&#x53EF;&#x80FD;&#x540C;&#x65F6;&#x4F7F;&#x7528;&#x53E6;&#x4E00;&#x6BB5;&#x4EE3;&#x7801;&#x3002;&#x8FD9;&#x79CD;&#x5173;&#x7CFB;&#x5F62;&#x5F0F;&#x53EA;&#x6709;&#x5728;&#x53CC;&#x5411;&#x5173;&#x7CFB;&#x4E2D;&#x624D;&#x5177;&#x6709;&#x5438;&#x5F15;&#x529B;&#x3002;&#x4F5C;&#x4E3A;&#x53CD;&#x4F8B;&#xFF0C;&#x78C1;&#x76D8;&#x5757;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x51E0;&#x4E4E;&#x603B;&#x662F;&#x5305;&#x542B;&#x54C8;&#x5E0C;&#x8868;&#xFF0C;&#x4F46;&#x662F;&#x54C8;&#x5E0C;&#x8868;&#x53EF;&#x4EE5;&#x5728;&#x8BB8;&#x591A;&#x4E0D;&#x6D89;&#x53CA;&#x5757;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x4F7F;&#x7528;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x8FD9;&#x4E9B;&#x6A21;&#x5757;&#x5E94;&#x8BE5;&#x5206;&#x5F00;&#x3002;</li>
<li>&#x5B83;&#x4EEC;&#x5728;&#x6982;&#x5FF5;&#x4E0A;&#x91CD;&#x53E0;&#xFF0C;&#x56E0;&#x4E3A;&#x5B58;&#x5728;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x66F4;&#x9AD8;&#x7EA7;&#x522B;&#x7684;&#x7C7B;&#x522B;&#xFF0C;&#x5176;&#x4E2D;&#x5305;&#x62EC;&#x8FD9;&#x4E24;&#x6BB5;&#x4EE3;&#x7801;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x641C;&#x7D22;&#x5B50;&#x5B57;&#x7B26;&#x4E32;&#x548C;&#x5927;&#x5C0F;&#x5199;&#x8F6C;&#x6362;&#x90FD;&#x5C5E;&#x4E8E;&#x5B57;&#x7B26;&#x4E32;&#x64CD;&#x4F5C;&#x7C7B;&#x522B;&#x3002;&#x6D41;&#x63A7;&#x5236;&#x548C;&#x53EF;&#x9760;&#x7684;&#x4EA4;&#x4ED8;&#x90FD;&#x5C5E;&#x4E8E;&#x7F51;&#x7EDC;&#x901A;&#x4FE1;&#x7684;&#x8303;&#x7574;&#x3002;</li>
<li>&#x4E0D;&#x770B;&#x5176;&#x4E2D;&#x7684;&#x4E00;&#x6BB5;&#x4EE3;&#x7801;&#x5C31;&#x5F88;&#x96BE;&#x7406;&#x89E3;&#x3002;</li>
</ul>
<p>&#x672C;&#x7AE0;&#x7684;&#x5176;&#x4F59;&#x90E8;&#x5206;&#x4F7F;&#x7528;&#x66F4;&#x5177;&#x4F53;&#x7684;&#x89C4;&#x5219;&#x4EE5;&#x53CA;&#x793A;&#x4F8B;&#x6765;&#x8BF4;&#x660E;&#x4F55;&#x65F6;&#x5C06;&#x4EE3;&#x7801;&#x6BB5;&#x7EC4;&#x5408;&#x5728;&#x4E00;&#x8D77;&#x4EE5;&#x53CA;&#x4F55;&#x65F6;&#x5C06;&#x5B83;&#x4EEC;&#x5206;&#x5F00;&#x662F;&#x6709;&#x610F;&#x4E49;&#x7684;&#x3002;</p>
<h2 id="91-bring-together-if-information-is-shared-&#x5982;&#x679C;&#x4FE1;&#x606F;&#x5171;&#x4EAB;&#x5219;&#x6C47;&#x805A;&#x5728;&#x4E00;&#x8D77;">9.1 Bring together if information is shared &#x5982;&#x679C;&#x4FE1;&#x606F;&#x5171;&#x4EAB;&#x5219;&#x6C47;&#x805A;&#x5728;&#x4E00;&#x8D77;</h2>
<p>5.4 &#x8282;&#x5728;&#x5B9E;&#x73B0; HTTP &#x670D;&#x52A1;&#x5668;&#x7684;&#x9879;&#x76EE;&#x4E0A;&#x4E0B;&#x6587;&#x4E2D;&#x4ECB;&#x7ECD;&#x4E86;&#x6B64;&#x539F;&#x7406;&#x3002;&#x5728;&#x5176;&#x7B2C;&#x4E00;&#x4E2A;&#x5B9E;&#x73B0;&#x4E2D;&#xFF0C;&#x8BE5;&#x9879;&#x76EE;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x7C7B;&#x4E2D;&#x4F7F;&#x7528;&#x4E86;&#x4E24;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x65B9;&#x6CD5;&#x6765;&#x8BFB;&#x53D6;&#x548C;&#x89E3;&#x6790; HTTP &#x8BF7;&#x6C42;&#x3002;&#x7B2C;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x4ECE;&#x7F51;&#x7EDC;&#x5957;&#x63A5;&#x5B57;&#x8BFB;&#x53D6;&#x4F20;&#x5165;&#x8BF7;&#x6C42;&#x7684;&#x6587;&#x672C;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x653E;&#x7F6E;&#x5728;&#x5B57;&#x7B26;&#x4E32;&#x5BF9;&#x8C61;&#x4E2D;&#x3002;&#x7B2C;&#x4E8C;&#x79CD;&#x65B9;&#x6CD5;&#x89E3;&#x6790;&#x5B57;&#x7B26;&#x4E32;&#x4EE5;&#x63D0;&#x53D6;&#x8BF7;&#x6C42;&#x7684;&#x5404;&#x4E2A;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#x3002;&#x7ECF;&#x8FC7;&#x8FD9;&#x79CD;&#x5206;&#x89E3;&#xFF0C;&#x8FD9;&#x4E24;&#x79CD;&#x65B9;&#x6CD5;&#x6700;&#x7EC8;&#x90FD;&#x5BF9; HTTP &#x8BF7;&#x6C42;&#x7684;&#x683C;&#x5F0F;&#x6709;&#x4E86;&#x76F8;&#x5F53;&#x7684;&#x4E86;&#x89E3;&#xFF1A;&#x7B2C;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x53EA;&#x662F;&#x5C1D;&#x8BD5;&#x8BFB;&#x53D6;&#x8BF7;&#x6C42;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x89E3;&#x6790;&#x8BF7;&#x6C42;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;&#x4E0D;&#x6267;&#x884C;&#x5927;&#x591A;&#x6570;&#x64CD;&#x4F5C;&#xFF0C;&#x5C31;&#x65E0;&#x6CD5;&#x786E;&#x5B9A;&#x8BF7;&#x6C42;&#x7684;&#x7ED3;&#x675F;&#x89E3;&#x6790;&#x5B83;&#x7684;&#x5DE5;&#x4F5C;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x5B83;&#x5FC5;&#x987B;&#x89E3;&#x6790;&#x6807;&#x5934;&#x884C;&#x624D;&#x80FD;&#x8BC6;&#x522B;&#x5305;&#x542B;&#x6574;&#x4E2A;&#x8BF7;&#x6C42;&#x957F;&#x5EA6;&#x7684;&#x6807;&#x5934;&#xFF09;&#x3002;&#x7531;&#x4E8E;&#x6B64;&#x5171;&#x4EAB;&#x4FE1;&#x606F;&#xFF0C;&#x6700;&#x597D;&#x5728;&#x540C;&#x4E00;&#x4F4D;&#x7F6E;&#x8BFB;&#x53D6;&#x548C;&#x89E3;&#x6790;&#x8BF7;&#x6C42;&#xFF1B;&#x5F53;&#x4E24;&#x4E2A;&#x7C7B;&#x5408;&#x800C;&#x4E3A;&#x4E00;&#x65F6;&#xFF0C;&#x4EE3;&#x7801;&#x53D8;&#x5F97;&#x66F4;&#x77ED;&#xFF0C;&#x66F4;&#x7B80;&#x5355;&#x3002;</p>
<h2 id="92-bring-together-if-it-will-simplify-the-interface-&#x6C47;&#x96C6;&#x5728;&#x4E00;&#x8D77;-&#x200B;&#x200B;-&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x7B80;&#x5316;&#x63A5;&#x53E3;">9.2 Bring together if it will simplify the interface &#x6C47;&#x96C6;&#x5728;&#x4E00;&#x8D77; &#x200B;&#x200B; &#x662F;&#x5426;&#x53EF;&#x4EE5;&#x7B80;&#x5316;&#x63A5;&#x53E3;</h2>
<p>&#x5F53;&#x4E24;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x6A21;&#x5757;&#x7EC4;&#x5408;&#x6210;&#x4E00;&#x4E2A;&#x6A21;&#x5757;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x4E3A;&#x65B0;&#x6A21;&#x5757;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x6BD4;&#x539F;&#x59CB;&#x63A5;&#x53E3;&#x66F4;&#x7B80;&#x5355;&#x6216;&#x66F4;&#x6613;&#x4E8E;&#x4F7F;&#x7528;&#x7684;&#x63A5;&#x53E3;&#x3002;&#x5F53;&#x539F;&#x59CB;&#x6A21;&#x5757;&#x5404;&#x81EA;&#x5B9E;&#x73B0;&#x95EE;&#x9898;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x65F6;&#xFF0C;&#x901A;&#x5E38;&#x4F1A;&#x53D1;&#x751F;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x3002;&#x5728;&#x4E0A;&#x4E00;&#x90E8;&#x5206;&#x7684; HTTP &#x670D;&#x52A1;&#x5668;&#x793A;&#x4F8B;&#x4E2D;&#xFF0C;&#x539F;&#x59CB;&#x65B9;&#x6CD5;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x63A5;&#x53E3;&#x6765;&#x4ECE;&#x7B2C;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x8FD4;&#x56DE; HTTP &#x8BF7;&#x6C42;&#x5B57;&#x7B26;&#x4E32;&#x5E76;&#x5C06;&#x5176;&#x4F20;&#x9012;&#x7ED9;&#x7B2C;&#x4E8C;&#x4E2A;&#x65B9;&#x6CD5;&#x3002;&#x5F53;&#x8FD9;&#x4E9B;&#x65B9;&#x6CD5;&#x7ED3;&#x5408;&#x5728;&#x4E00;&#x8D77;&#x65F6;&#xFF0C;&#x8FD9;&#x4E9B;&#x63A5;&#x53E3;&#x5C31;&#x88AB;&#x6DD8;&#x6C70;&#x4E86;&#x3002;</p>
<p>&#x53E6;&#x5916;&#xFF0C;&#x5C06;&#x4E24;&#x4E2A;&#x6216;&#x66F4;&#x591A;&#x7C7B;&#x7684;&#x529F;&#x80FD;&#x7EC4;&#x5408;&#x5728;&#x4E00;&#x8D77;&#x65F6;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x81EA;&#x52A8;&#x6267;&#x884C;&#x67D0;&#x4E9B;&#x529F;&#x80FD;&#xFF0C;&#x56E0;&#x6B64;&#x5927;&#x591A;&#x6570;&#x7528;&#x6237;&#x65E0;&#x9700;&#x4E86;&#x89E3;&#x5B83;&#x4EEC;&#x3002;Java I/O &#x5E93;&#x8BF4;&#x660E;&#x4E86;&#x8FD9;&#x79CD;&#x673A;&#x4F1A;&#x3002;&#x5982;&#x679C;&#x5C06; FileInputStream &#x548C; BufferedInputStream &#x7C7B;&#x7EC4;&#x5408;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x5E76;&#x4E14;&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#x63D0;&#x4F9B;&#x4E86;&#x7F13;&#x51B2;&#xFF0C;&#x5219;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x7528;&#x6237;&#x751A;&#x81F3;&#x90FD;&#x4E0D;&#x9700;&#x8981;&#x77E5;&#x9053;&#x7F13;&#x51B2;&#x7684;&#x5B58;&#x5728;&#x3002;&#x7EC4;&#x5408;&#x7684; FileInputStream &#x7C7B;&#x53EF;&#x80FD;&#x63D0;&#x4F9B;&#x7981;&#x7528;&#x6216;&#x66FF;&#x6362;&#x9ED8;&#x8BA4;&#x7F13;&#x51B2;&#x673A;&#x5236;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x4F46;&#x662F;&#x5927;&#x591A;&#x6570;&#x7528;&#x6237;&#x4E0D;&#x9700;&#x8981;&#x4E86;&#x89E3;&#x5B83;&#x4EEC;&#x3002;</p>
<h2 id="93-bring-together-to-eliminate-duplication-&#x6D88;&#x9664;&#x91CD;&#x590D;">9.3 Bring together to eliminate duplication &#x6D88;&#x9664;&#x91CD;&#x590D;</h2>
<p>&#x5982;&#x679C;&#x53D1;&#x73B0;&#x53CD;&#x590D;&#x91CD;&#x590D;&#x76F8;&#x540C;&#x7684;&#x4EE3;&#x7801;&#x6A21;&#x5F0F;&#xFF0C;&#x8BF7;&#x67E5;&#x770B;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x91CD;&#x65B0;&#x7EC4;&#x7EC7;&#x4EE3;&#x7801;&#x4EE5;&#x6D88;&#x9664;&#x91CD;&#x590D;&#x3002;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x5C06;&#x91CD;&#x590D;&#x7684;&#x4EE3;&#x7801;&#x5206;&#x89E3;&#x4E3A;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5E76;&#x7528;&#x5BF9;&#x8BE5;&#x65B9;&#x6CD5;&#x7684;&#x8C03;&#x7528;&#x66FF;&#x6362;&#x91CD;&#x590D;&#x7684;&#x4EE3;&#x7801;&#x6BB5;&#x3002;&#x5982;&#x679C;&#x91CD;&#x590D;&#x7684;&#x4EE3;&#x7801;&#x6BB5;&#x5F88;&#x957F;&#x5E76;&#x4E14;&#x66FF;&#x6362;&#x65B9;&#x6CD5;&#x5177;&#x6709;&#x7B80;&#x5355;&#x7684;&#x7B7E;&#x540D;&#xFF0C;&#x5219;&#x6B64;&#x65B9;&#x6CD5;&#x6700;&#x6709;&#x6548;&#x3002;&#x5982;&#x679C;&#x4EE3;&#x7801;&#x6BB5;&#x53EA;&#x6709;&#x4E00;&#x4E24;&#x884C;&#xFF0C;&#x90A3;&#x4E48;&#x7528;&#x65B9;&#x6CD5;&#x8C03;&#x7528;&#x66FF;&#x6362;&#x5B83;&#x53EF;&#x80FD;&#x4E0D;&#x4F1A;&#x6709;&#x592A;&#x591A;&#x597D;&#x5904;&#x3002;&#x5982;&#x679C;&#x4EE3;&#x7801;&#x6BB5;&#x4E0E;&#x5176;&#x73AF;&#x5883;&#x4EE5;&#x590D;&#x6742;&#x7684;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x4EA4;&#x4E92;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x901A;&#x8FC7;&#x8BBF;&#x95EE;&#x591A;&#x4E2A;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#xFF09;&#xFF0C;&#x5219;&#x66FF;&#x6362;&#x65B9;&#x6CD5;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x590D;&#x6742;&#x7684;&#x7B7E;&#x540D;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x8BB8;&#x591A;&#x201C;&#x6309;&#x5F15;&#x7528;&#x4F20;&#x9012;&#x201D;&#x53C2;&#x6570;&#xFF09;&#xFF0C;&#x8FD9;&#x4F1A;&#x964D;&#x4F4E;&#x5176;&#x4EF7;&#x503C;&#x3002;</p>
<p>&#x6D88;&#x9664;&#x91CD;&#x590D;&#x7684;&#x53E6;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x91CD;&#x6784;&#x4EE3;&#x7801;&#xFF0C;&#x4F7F;&#x76F8;&#x5173;&#x4EE3;&#x7801;&#x6BB5;&#x4EC5;&#x9700;&#x8981;&#x5728;&#x4E00;&#x4E2A;&#x5730;&#x65B9;&#x6267;&#x884C;&#x3002;&#x5047;&#x8BBE;&#x60A8;&#x6B63;&#x5728;&#x7F16;&#x5199;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#xFF0C;&#x8BE5;&#x65B9;&#x6CD5;&#x9700;&#x8981;&#x5728;&#x51E0;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x70B9;&#x8FD4;&#x56DE;&#x9519;&#x8BEF;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x8FD4;&#x56DE;&#x4E4B;&#x524D;&#x9700;&#x8981;&#x5728;&#x6BCF;&#x4E2A;&#x8FD9;&#x4E9B;&#x70B9;&#x6267;&#x884C;&#x76F8;&#x540C;&#x7684;&#x6E05;&#x9664;&#x64CD;&#x4F5C;&#xFF08;&#x793A;&#x4F8B;&#x8BF7;&#x53C2;&#x89C1;&#x56FE; 9.1&#xFF09;&#x3002;&#x5982;&#x679C;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x652F;&#x6301; goto&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x5C06;&#x6E05;&#x9664;&#x4EE3;&#x7801;&#x79FB;&#x5230;&#x65B9;&#x6CD5;&#x7684;&#x6700;&#x540E;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x9700;&#x8981;&#x8FD4;&#x56DE;&#x9519;&#x8BEF;&#x7684;&#x6BCF;&#x4E2A;&#x70B9;&#x5904;&#x8F6C;&#x5230;&#x8BE5;&#x7247;&#x6BB5;&#xFF0C;&#x5982;&#x56FE; 9.2 &#x6240;&#x793A;&#x3002;Goto &#x8BED;&#x53E5;&#x901A;&#x5E38;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x4E00;&#x4E2A;&#x574F;&#x4E3B;&#x610F;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x52A0;&#x9009;&#x62E9;&#x5730;&#x4F7F;&#x7528;&#x5B83;&#x4EEC;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x65E0;&#x6CD5;&#x8BC6;&#x522B;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x8BF8;&#x5982;&#x6B64;&#x7C7B;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5B83;&#x4EEC;&#x53EF;&#x7528;&#x4E8E;&#x4ECE;&#x5D4C;&#x5957;&#x4EE3;&#x7801;&#x4E2D;&#x8F6C;&#x4E49;&#xFF0C;&#x56E0;&#x6B64;&#x5B83;&#x4EEC;&#x975E;&#x5E38;&#x6709;&#x7528;&#x3002;</p>
<h2 id="94-separate-general-purpose-and-special-purpose-code-&#x5355;&#x72EC;&#x7684;&#x901A;&#x7528;&#x4EE3;&#x7801;&#x548C;&#x4E13;&#x7528;&#x4EE3;&#x7801;">9.4 Separate general-purpose and special-purpose code &#x5355;&#x72EC;&#x7684;&#x901A;&#x7528;&#x4EE3;&#x7801;&#x548C;&#x4E13;&#x7528;&#x4EE3;&#x7801;</h2>
<p>&#x5982;&#x679C;&#x6A21;&#x5757;&#x5305;&#x542B;&#x53EF;&#x7528;&#x4E8E;&#x591A;&#x79CD;&#x4E0D;&#x540C;&#x76EE;&#x7684;&#x7684;&#x673A;&#x5236;&#xFF0C;&#x5219;&#x5B83;&#x5E94;&#x4EC5;&#x63D0;&#x4F9B;&#x4E00;&#x79CD;&#x901A;&#x7528;&#x673A;&#x5236;&#x3002;&#x5B83;&#x4E0D;&#x5E94;&#x5305;&#x542B;&#x4E13;&#x95E8;&#x9488;&#x5BF9;&#x7279;&#x5B9A;&#x7528;&#x9014;&#x7684;&#x673A;&#x5236;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x4E5F;&#x4E0D;&#x5E94;&#x5305;&#x542B;&#x5176;&#x4ED6;&#x901A;&#x7528;&#x673A;&#x5236;&#x3002;&#x4E0E;&#x901A;&#x7528;&#x673A;&#x5236;&#x5173;&#x8054;&#x7684;&#x4E13;&#x7528;&#x4EE3;&#x7801;&#x901A;&#x5E38;&#x5E94;&#x653E;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x6A21;&#x5757;&#x4E2D;&#xFF08;&#x901A;&#x5E38;&#x662F;&#x4E0E;&#x7279;&#x5B9A;&#x7528;&#x9014;&#x5173;&#x8054;&#x7684;&#x6A21;&#x5757;&#xFF09;&#x3002;&#x7B2C; 6 &#x7AE0;&#x4E2D;&#x7684; GUI &#x7F16;&#x8F91;&#x5668;&#x8BA8;&#x8BBA;&#x9610;&#x660E;&#x4E86;&#x8FD9;&#x4E00;&#x539F;&#x7406;&#xFF1A;&#x6700;&#x4F73;&#x8BBE;&#x8BA1;&#x662F;&#x6587;&#x672C;&#x7C7B;&#x63D0;&#x4F9B;&#x901A;&#x7528;&#x6587;&#x672C;&#x64CD;&#x4F5C;&#xFF0C;&#x800C;&#x7279;&#x5B9A;&#x4E8E;&#x7528;&#x6237;&#x754C;&#x9762;&#x7684;&#x64CD;&#x4F5C;&#xFF08;&#x4F8B;&#x5982;&#x5220;&#x9664;&#x6240;&#x9009;&#x5185;&#x5BB9;&#xFF09;&#x5219;&#x5728;&#x7528;&#x6237;&#x754C;&#x9762;&#x6A21;&#x5757;&#x4E2D;&#x5B9E;&#x73B0;&#x3002;</p>
<p>&#x5982;&#x679C;&#x76F8;&#x540C;&#x7684;&#x4EE3;&#x7801;&#xFF08;&#x6216;&#x51E0;&#x4E4E;&#x76F8;&#x540C;&#x7684;&#x4EE3;&#x7801;&#xFF09;&#x4E00;&#x904D;&#x53C8;&#x4E00;&#x904D;&#x5730;&#x51FA;&#x73B0;&#xFF0C;&#x90A3;&#x662F;&#x4E00;&#x4E2A;&#x5371;&#x9669;&#x4FE1;&#x53F7;&#xFF0C;&#x60A8;&#x6CA1;&#x6709;&#x627E;&#x5230;&#x6B63;&#x786E;&#x7684;&#x62BD;&#x8C61;&#x3002;</p>
<p><img src="figures/00017.gif" alt=""></p>
<p>&#x56FE; 9.1&#xFF1A;&#x6B64;&#x4EE3;&#x7801;&#x5904;&#x7406;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x4F20;&#x5165;&#x7F51;&#x7EDC;&#x6570;&#x636E;&#x5305;&#x3002;&#x5BF9;&#x4E8E;&#x6BCF;&#x79CD;&#x7C7B;&#x578B;&#xFF0C;&#x5982;&#x679C;&#x6570;&#x636E;&#x5305;&#x5BF9;&#x4E8E;&#x8BE5;&#x7C7B;&#x578B;&#x800C;&#x8A00;&#x592A;&#x77ED;&#xFF0C;&#x5219;&#x4F1A;&#x8BB0;&#x5F55;&#x4E00;&#x6761;&#x6D88;&#x606F;&#x3002;&#x5728;&#x6B64;&#x7248;&#x672C;&#x7684;&#x4EE3;&#x7801;&#x4E2D;&#xFF0C;LOG &#x8BED;&#x53E5;&#x5BF9;&#x4E8E;&#x51E0;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x6570;&#x636E;&#x5305;&#x7C7B;&#x578B;&#x662F;&#x91CD;&#x590D;&#x7684;&#x3002;</p>
<p><img src="figures/00018.gif" alt=""></p>
<p>&#x56FE; 9.2&#xFF1A;&#x5BF9;&#x56FE; 9.1 &#x4E2D;&#x7684;&#x4EE3;&#x7801;&#x8FDB;&#x884C;&#x4E86;&#x91CD;&#x65B0;&#x7EC4;&#x7EC7;&#xFF0C;&#x56E0;&#x6B64;&#x53EA;&#x6709; LOG &#x8BED;&#x53E5;&#x7684;&#x4E00;&#x4E2A;&#x526F;&#x672C;&#x3002;</p>
<p>&#x901A;&#x5E38;&#xFF0C;&#x7CFB;&#x7EDF;&#x7684;&#x4E0B;&#x5C42;&#x503E;&#x5411;&#x4E8E;&#x66F4;&#x901A;&#x7528;&#xFF0C;&#x800C;&#x4E0A;&#x5C42;&#x5219;&#x66F4;&#x4E13;&#x7528;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x6700;&#x9876;&#x5C42;&#x5305;&#x542B;&#x5B8C;&#x5168;&#x7279;&#x5B9A;&#x4E8E;&#x8BE5;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x529F;&#x80FD;&#x3002;&#x5C06;&#x4E13;&#x7528;&#x4EE3;&#x7801;&#x4E0E;&#x901A;&#x7528;&#x4EE3;&#x7801;&#x5206;&#x5F00;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x5C06;&#x4E13;&#x7528;&#x4EE3;&#x7801;&#x5411;&#x4E0A;&#x62C9;&#x5230;&#x8F83;&#x9AD8;&#x7684;&#x5C42;&#xFF0C;&#x800C;&#x5C06;&#x8F83;&#x4F4E;&#x7684;&#x5C42;&#x4FDD;&#x7559;&#x4E3A;&#x901A;&#x7528;&#x3002;&#x5F53;&#x60A8;&#x9047;&#x5230;&#x540C;&#x65F6;&#x5305;&#x542B;&#x901A;&#x7528;&#x529F;&#x80FD;&#x548C;&#x4E13;&#x7528;&#x529F;&#x80FD;&#x7684;&#x540C;&#x4E00;&#x7C7B;&#x7684;&#x7C7B;&#x65F6;&#xFF0C;&#x8BF7;&#x67E5;&#x770B;&#x8BE5;&#x7C7B;&#x662F;&#x5426;&#x53EF;&#x4EE5;&#x5206;&#x4E3A;&#x4E24;&#x4E2A;&#x7C7B;&#xFF0C;&#x4E00;&#x4E2A;&#x5305;&#x542B;&#x901A;&#x7528;&#x529F;&#x80FD;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x5728;&#x5176;&#x4E0A;&#x5206;&#x5C42;&#x4EE5;&#x63D0;&#x4F9B;&#x7279;&#x6B8A;&#x529F;&#x80FD;</p>
<h2 id="95-example-insertion-cursor-and-selection-&#x793A;&#x4F8B;&#xFF1A;&#x63D2;&#x5165;&#x5149;&#x6807;&#x548C;&#x9009;&#x62E9;">9.5 Example: insertion cursor and selection &#x793A;&#x4F8B;&#xFF1A;&#x63D2;&#x5165;&#x5149;&#x6807;&#x548C;&#x9009;&#x62E9;</h2>
<p>&#x4E0B;&#x4E00;&#x8282;&#x5C06;&#x901A;&#x8FC7;&#x4E09;&#x4E2A;&#x793A;&#x4F8B;&#x8BF4;&#x660E;&#x4E0A;&#x8FF0;&#x539F;&#x7406;&#x3002;&#x5728;&#x4E24;&#x4E2A;&#x793A;&#x4F8B;&#x4E2D;&#xFF0C;&#x6700;&#x597D;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x5206;&#x79BB;&#x76F8;&#x5173;&#x7684;&#x4EE3;&#x7801;&#x6BB5;&#x3002;&#x5728;&#x7B2C;&#x4E09;&#x4E2A;&#x793A;&#x4F8B;&#x4E2D;&#xFF0C;&#x6700;&#x597D;&#x5C06;&#x5B83;&#x4EEC;&#x7ED3;&#x5408;&#x5728;&#x4E00;&#x8D77;&#x3002;</p>
<p>&#x7B2C;&#x4E00;&#x4E2A;&#x793A;&#x4F8B;&#x7531;&#x63D2;&#x5165;&#x5149;&#x6807;&#x548C;&#x7B2C; 6 &#x7AE0;&#x7684; GUI &#x7F16;&#x8F91;&#x5668;&#x9879;&#x76EE;&#x4E2D;&#x7684;&#x9009;&#x62E9;&#x7EC4;&#x6210;&#x3002;&#x7F16;&#x8F91;&#x5668;&#x663E;&#x793A;&#x95EA;&#x70C1;&#x7684;&#x5782;&#x76F4;&#x7EBF;&#xFF0C;&#x6307;&#x793A;&#x7528;&#x6237;&#x952E;&#x5165;&#x7684;&#x6587;&#x672C;&#x5C06;&#x51FA;&#x73B0;&#x5728;&#x6587;&#x6863;&#x4E2D;&#x7684;&#x4F55;&#x5904;&#x3002;&#x5B83;&#x8FD8;&#x663E;&#x793A;&#x4E86;&#x4E00;&#x4E2A;&#x7A81;&#x51FA;&#x663E;&#x793A;&#x7684;&#x5B57;&#x7B26;&#x8303;&#x56F4;&#xFF0C;&#x79F0;&#x4E3A;&#x9009;&#x62E9;&#xFF0C;&#x7528;&#x4E8E;&#x590D;&#x5236;&#x6216;&#x5220;&#x9664;&#x6587;&#x672C;&#x3002;&#x63D2;&#x5165;&#x5149;&#x6807;&#x59CB;&#x7EC8;&#x53EF;&#x89C1;&#xFF0C;&#x4F46;&#x662F;&#x6709;&#x65F6;&#x53EF;&#x80FD;&#x6CA1;&#x6709;&#x9009;&#x62E9;&#x6587;&#x672C;&#x3002;&#x5982;&#x679C;&#x5B58;&#x5728;&#x9009;&#x62E9;&#xFF0C;&#x5219;&#x63D2;&#x5165;&#x5149;&#x6807;&#x59CB;&#x7EC8;&#x4F4D;&#x4E8E;&#x5176;&#x4E00;&#x7AEF;&#x3002;</p>
<p>&#x9009;&#x62E9;&#x548C;&#x63D2;&#x5165;&#x5149;&#x6807;&#x5728;&#x67D0;&#x4E9B;&#x65B9;&#x9762;&#x76F8;&#x5173;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5149;&#x6807;&#x59CB;&#x7EC8;&#x4F4D;&#x4E8E;&#x6240;&#x9009;&#x5185;&#x5BB9;&#x7684;&#x4E00;&#x7AEF;&#xFF0C;&#x5E76;&#x4E14;&#x503E;&#x5411;&#x4E8E;&#x5C06;&#x5149;&#x6807;&#x548C;&#x6240;&#x9009;&#x5185;&#x5BB9;&#x4E00;&#x8D77;&#x64CD;&#x4F5C;&#xFF1A;&#x5355;&#x51FB;&#x5E76;&#x62D6;&#x52A8;&#x9F20;&#x6807;&#x5C06;&#x5B83;&#x4EEC;&#x90FD;&#x8BBE;&#x7F6E;&#xFF0C;&#x7136;&#x540E;&#x63D2;&#x5165;&#x6587;&#x672C;&#x4F1A;&#x9996;&#x5148;&#x5220;&#x9664;&#x6240;&#x9009;&#x7684;&#x6587;&#x672C;&#xFF08;&#x5982;&#x679C;&#x6709;&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x5149;&#x6807;&#x4F4D;&#x7F6E;&#x63D2;&#x5165;&#x65B0;&#x6587;&#x672C;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x4F7F;&#x7528;&#x5355;&#x4E2A;&#x5BF9;&#x8C61;&#x7BA1;&#x7406;&#x9009;&#x62E9;&#x548C;&#x5149;&#x6807;&#x4F3C;&#x4E4E;&#x5408;&#x4E4E;&#x903B;&#x8F91;&#xFF0C;&#x5E76;&#x4E14;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x56E2;&#x961F;&#x91C7;&#x7528;&#x4E86;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x3002;&#x8BE5;&#x5BF9;&#x8C61;&#x5728;&#x6587;&#x4EF6;&#x4E2D;&#x5B58;&#x50A8;&#x4E86;&#x4E24;&#x4E2A;&#x4F4D;&#x7F6E;&#xFF0C;&#x4EE5;&#x53CA;&#x5E03;&#x5C14;&#x503C;&#xFF0C;&#x5B83;&#x4EEC;&#x6307;&#x793A;&#x5149;&#x6807;&#x7684;&#x54EA;&#x4E00;&#x7AEF;&#x4EE5;&#x53CA;&#x9009;&#x62E9;&#x662F;&#x5426;&#x5B58;&#x5728;&#x3002;</p>
<p>&#x4F46;&#x662F;&#xFF0C;&#x5408;&#x5E76;&#x7684;&#x5BF9;&#x8C61;&#x5F88;&#x5C34;&#x5C2C;&#x3002;&#x5B83;&#x5BF9;&#x9AD8;&#x7EA7;&#x4EE3;&#x7801;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x597D;&#x5904;&#xFF0C;&#x56E0;&#x4E3A;&#x9AD8;&#x7EA7;&#x4EE3;&#x7801;&#x4ECD;&#x7136;&#x9700;&#x8981;&#x5C06;&#x9009;&#x62E9;&#x548C;&#x6E38;&#x6807;&#x89C6;&#x4E3A;&#x4E0D;&#x540C;&#x7684;&#x5B9E;&#x4F53;&#xFF0C;&#x5E76;&#x4E14;&#x5BF9;&#x5B83;&#x4EEC;&#x8FDB;&#x884C;&#x5355;&#x72EC;&#x64CD;&#x4F5C;&#xFF08;&#x5728;&#x63D2;&#x5165;&#x6587;&#x672C;&#x671F;&#x95F4;&#xFF0C;&#x5B83;&#x9996;&#x5148;&#x5728;&#x7EC4;&#x5408;&#x5BF9;&#x8C61;&#x4E0A;&#x8C03;&#x7528;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x6765;&#x5220;&#x9664;&#x9009;&#x5B9A;&#x7684;&#x6587;&#x672C;&#xFF1B;&#x7136;&#x540E;&#x8C03;&#x7528;&#x53E6;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x6765;&#x68C0;&#x7D22;&#x5149;&#x6807;&#x4F4D;&#x7F6E;&#xFF0C;&#x4EE5;&#x63D2;&#x5165;&#x65B0;&#x6587;&#x672C;&#xFF09;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x7EC4;&#x5408;&#x5BF9;&#x8C61;&#x6BD4;&#x5355;&#x72EC;&#x7684;&#x5BF9;&#x8C61;&#x5B9E;&#x73B0;&#x8D77;&#x6765;&#x8981;&#x590D;&#x6742;&#x5F97;&#x591A;&#x3002;&#x5B83;&#x907F;&#x514D;&#x4E86;&#x5C06;&#x5149;&#x6807;&#x4F4D;&#x7F6E;&#x5B58;&#x50A8;&#x4E3A;&#x5355;&#x72EC;&#x7684;&#x5B9E;&#x4F53;&#xFF0C;&#x800C;&#x662F;&#x4E0D;&#x5F97;&#x4E0D;&#x5B58;&#x50A8;&#x4E00;&#x4E2A;&#x5E03;&#x5C14;&#x503C;&#xFF0C;&#x8BE5;&#x5E03;&#x5C14;&#x503C;&#x6307;&#x793A;&#x9009;&#x62E9;&#x7684;&#x54EA;&#x4E00;&#x7AEF;&#x662F;&#x5149;&#x6807;&#x3002;&#x4E3A;&#x4E86;&#x68C0;&#x7D22;&#x5149;&#x6807;&#x4F4D;&#x7F6E;&#xFF0C;&#x7EC4;&#x5408;&#x5BF9;&#x8C61;&#x5FC5;&#x987B;&#x9996;&#x5148;&#x6D4B;&#x8BD5;&#x5E03;&#x5C14;&#x503C;&#xFF0C;&#x7136;&#x540E;&#x9009;&#x62E9;&#x9009;&#x62E9;&#x7684;&#x9002;&#x5F53;&#x7ED3;&#x5C3E;&#x3002;</p>
<p>&#x5F53;&#x901A;&#x7528;&#x673A;&#x5236;&#x8FD8;&#x5305;&#x542B;&#x4E13;&#x95E8;&#x7528;&#x4E8E;&#x8BE5;&#x673A;&#x5236;&#x7684;&#x7279;&#x5B9A;&#x7528;&#x9014;&#x7684;&#x4EE3;&#x7801;&#x65F6;&#xFF0C;&#x5C31;&#x4F1A;&#x51FA;&#x73B0;&#x6B64;&#x7EA2;&#x8272;&#x6807;&#x5FD7;&#x3002;&#x8FD9;&#x4F7F;&#x8BE5;&#x673A;&#x5236;&#x66F4;&#x52A0;&#x590D;&#x6742;&#xFF0C;&#x5E76;&#x5728;&#x8BE5;&#x673A;&#x5236;&#x4E0E;&#x7279;&#x5B9A;&#x7528;&#x4F8B;&#x4E4B;&#x95F4;&#x9020;&#x6210;&#x4E86;&#x4FE1;&#x606F;&#x6CC4;&#x6F0F;&#xFF1A;&#x5BF9;&#x7528;&#x4F8B;&#x7684;&#x672A;&#x6765;&#x4FEE;&#x6539;&#x4E5F;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x5BF9;&#x57FA;&#x7840;&#x673A;&#x5236;&#x8FDB;&#x884C;&#x66F4;&#x6539;&#x3002;</p>
<p>&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x9009;&#x62E9;&#x548C;&#x5149;&#x6807;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x8054;&#x5EA6;&#x4E0D;&#x8DB3;&#x4EE5;&#x5C06;&#x5B83;&#x4EEC;&#x7EC4;&#x5408;&#x5728;&#x4E00;&#x8D77;&#x3002;&#x5F53;&#x4FEE;&#x6539;&#x4EE3;&#x7801;&#x4EE5;&#x5206;&#x9694;&#x9009;&#x62E9;&#x548C;&#x5149;&#x6807;&#x65F6;&#xFF0C;&#x7528;&#x6CD5;&#x548C;&#x5B9E;&#x73B0;&#x90FD;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x7B80;&#x5355;&#x3002;&#x4E0E;&#x5FC5;&#x987B;&#x4ECE;&#x4E2D;&#x63D0;&#x53D6;&#x9009;&#x62E9;&#x548C;&#x5149;&#x6807;&#x4FE1;&#x606F;&#x7684;&#x7EC4;&#x5408;&#x5BF9;&#x8C61;&#x76F8;&#x6BD4;&#xFF0C;&#x5355;&#x72EC;&#x7684;&#x5BF9;&#x8C61;&#x63D0;&#x4F9B;&#x4E86;&#x66F4;&#x7B80;&#x5355;&#x7684;&#x63A5;&#x53E3;&#x3002;&#x6E38;&#x6807;&#x7684;&#x5B9E;&#x73B0;&#x4E5F;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x7B80;&#x5355;&#xFF0C;&#x56E0;&#x4E3A;&#x6E38;&#x6807;&#x7684;&#x4F4D;&#x7F6E;&#x662F;&#x76F4;&#x63A5;&#x8868;&#x793A;&#x7684;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x901A;&#x8FC7;&#x9009;&#x62E9;&#x548C;&#x5E03;&#x5C14;&#x503C;&#x95F4;&#x63A5;&#x8868;&#x793A;&#x7684;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x5728;&#x4FEE;&#x8BA2;&#x7248;&#x4E2D;&#xFF0C;&#x6CA1;&#x6709;&#x7279;&#x6B8A;&#x7684;&#x7C7B;&#x7528;&#x4E8E;&#x9009;&#x62E9;&#x6216;&#x6E38;&#x6807;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x5F15;&#x5165;&#x4E86;&#x4E00;&#x4E2A;&#x65B0;&#x7684; Position &#x7C7B;&#x6765;&#x8868;&#x793A;&#x6587;&#x4EF6;&#x4E2D;&#x7684;&#x4F4D;&#x7F6E;&#xFF08;&#x884C;&#x53F7;&#x548C;&#x884C;&#x5185;&#x7684;&#x5B57;&#x7B26;&#xFF09;&#x3002;&#x9009;&#x62E9;&#x7528;&#x4E24;&#x4E2A;&#x4F4D;&#x7F6E;&#x8868;&#x793A;&#xFF0C;&#x5149;&#x6807;&#x7528;&#x4E00;&#x4E2A;&#x4F4D;&#x7F6E;&#x8868;&#x793A;&#x3002;&#x804C;&#x4F4D;&#x8FD8;&#x5728;&#x9879;&#x76EE;&#x4E2D;&#x627E;&#x5230;&#x4E86;&#x5176;&#x4ED6;&#x7528;&#x9014;&#x3002;</p>
<h2 id="96-example-separate-class-for-logging-&#x793A;&#x4F8B;&#xFF1A;&#x7528;&#x4E8E;&#x8BB0;&#x5F55;&#x7684;&#x5355;&#x72EC;&#x7C7B;">9.6 Example: separate class for logging &#x793A;&#x4F8B;&#xFF1A;&#x7528;&#x4E8E;&#x8BB0;&#x5F55;&#x7684;&#x5355;&#x72EC;&#x7C7B;</h2>
<p>&#x7B2C;&#x4E8C;&#x4E2A;&#x793A;&#x4F8B;&#x6D89;&#x53CA;&#x5B66;&#x751F;&#x9879;&#x76EE;&#x4E2D;&#x7684;&#x9519;&#x8BEF;&#x8BB0;&#x5F55;&#x3002;&#x4E00;&#x4E2A;&#x7C7B;&#x5305;&#x542B;&#x51E0;&#x4E2A;&#x4EE3;&#x7801;&#x5E8F;&#x5217;&#xFF0C;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;</p>
<pre><code class="lang-java"><span class="hljs-keyword">try</span> {
    rpcConn = connectionPool.getConnection(dest);
} <span class="hljs-keyword">catch</span> (IOException e) {
    NetworkErrorLogger.logRpcOpenError(req, dest, e);
    <span class="hljs-keyword">return</span> <span class="hljs-keyword">null</span>;
}
</code></pre>
<p>&#x800C;&#x4E0D;&#x662F;&#x5728;&#x68C0;&#x6D4B;&#x5230;&#x9519;&#x8BEF;&#x65F6;&#x8BB0;&#x5F55;&#x9519;&#x8BEF;&#xFF0C;&#x800C;&#x662F;&#x8C03;&#x7528;&#x7279;&#x6B8A;&#x9519;&#x8BEF;&#x8BB0;&#x5F55;&#x7C7B;&#x4E2D;&#x7684;&#x5355;&#x72EC;&#x65B9;&#x6CD5;&#x3002;&#x9519;&#x8BEF;&#x8BB0;&#x5F55;&#x7C7B;&#x662F;&#x5728;&#x540C;&#x4E00;&#x6E90;&#x6587;&#x4EF6;&#x7684;&#x672B;&#x5C3E;&#x5B9A;&#x4E49;&#x7684;&#xFF1A;</p>
<pre><code class="lang-java"><span class="hljs-keyword">private</span> <span class="hljs-keyword">static</span> <span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">NetworkErrorLogger</span> </span>{
    <span class="hljs-comment">/**
    *  Output information relevant to an error that occurs when trying
    *  to open a connection to send an RPC.
    *
    *  <span class="hljs-doctag">@param</span> req
    *       The RPC request that would have been sent through the connection
    *  <span class="hljs-doctag">@param</span> dest
    *       The destination of the RPC
    *  <span class="hljs-doctag">@param</span> e
    *       The caught error
    */</span>
    <span class="hljs-function"><span class="hljs-keyword">public</span> <span class="hljs-keyword">static</span> <span class="hljs-keyword">void</span> <span class="hljs-title">logRpcOpenError</span><span class="hljs-params">(RpcRequest req, AddrPortTuple dest, Exception e)</span> </span>{
        logger.log(Level.WARNING, <span class="hljs-string">&quot;Cannot send message: &quot;</span> + req + <span class="hljs-string">&quot;. \n&quot;</span> + <span class="hljs-string">&quot;Unable to find or open connection to &quot;</span> + dest + <span class="hljs-string">&quot; :&quot;</span> + e);
    }
...
}
</code></pre>
<p>NetworkErrorLogger &#x7C7B;&#x5305;&#x542B;&#x51E0;&#x4E2A;&#x65B9;&#x6CD5;&#xFF0C;&#x4F8B;&#x5982; logRpcSendError &#x548C; logRpcReceiveError&#xFF0C;&#x6BCF;&#x4E2A;&#x65B9;&#x6CD5;&#x90FD;&#x8BB0;&#x5F55;&#x4E86;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x9519;&#x8BEF;&#x3002;</p>
<p>&#x8FD9;&#x79CD;&#x5206;&#x79BB;&#x589E;&#x52A0;&#x4E86;&#x590D;&#x6742;&#x6027;&#xFF0C;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x597D;&#x5904;&#x3002;&#x65E5;&#x5FD7;&#x8BB0;&#x5F55;&#x65B9;&#x6CD5;&#x5F88;&#x6D45;&#xFF1A;&#x5927;&#x591A;&#x6570;&#x53EA;&#x5305;&#x542B;&#x4E00;&#x884C;&#x4EE3;&#x7801;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x4EEC;&#x9700;&#x8981;&#x5927;&#x91CF;&#x7684;&#x6587;&#x6863;&#x3002;&#x6BCF;&#x4E2A;&#x65B9;&#x6CD5;&#x4EC5;&#x5728;&#x5355;&#x4E2A;&#x4F4D;&#x7F6E;&#x8C03;&#x7528;&#x3002;&#x65E5;&#x5FD7;&#x8BB0;&#x5F55;&#x65B9;&#x6CD5;&#x9AD8;&#x5EA6;&#x4F9D;&#x8D56;&#x4E8E;&#x5B83;&#x4EEC;&#x7684;&#x8C03;&#x7528;&#xFF1A;&#x8BFB;&#x53D6;&#x8C03;&#x7528;&#x7684;&#x4EBA;&#x5F88;&#x53EF;&#x80FD;&#x4F1A;&#x5207;&#x6362;&#x5230;&#x65E5;&#x5FD7;&#x8BB0;&#x5F55;&#x65B9;&#x6CD5;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;&#x8BB0;&#x5F55;&#x4E86;&#x6B63;&#x786E;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x540C;&#x6837;&#xFF0C;&#x9605;&#x8BFB;&#x65E5;&#x5FD7;&#x8BB0;&#x5F55;&#x65B9;&#x6CD5;&#x7684;&#x4EBA;&#x53EF;&#x80FD;&#x4F1A;&#x8F6C;&#x5230;&#x8C03;&#x7528;&#x7AD9;&#x70B9;&#x4EE5;&#x4E86;&#x89E3;&#x8BE5;&#x65B9;&#x6CD5;&#x7684;&#x76EE;&#x7684;&#x3002;</p>
<p>&#x5728;&#x6B64;&#x793A;&#x4F8B;&#x4E2D;&#xFF0C;&#x6700;&#x597D;&#x6D88;&#x9664;&#x65E5;&#x5FD7;&#x8BB0;&#x5F55;&#x65B9;&#x6CD5;&#xFF0C;&#x5E76;&#x5C06;&#x65E5;&#x5FD7;&#x8BB0;&#x5F55;&#x8BED;&#x53E5;&#x653E;&#x7F6E;&#x5728;&#x68C0;&#x6D4B;&#x5230;&#x9519;&#x8BEF;&#x7684;&#x4F4D;&#x7F6E;&#x3002;&#x8FD9;&#x5C06;&#x4F7F;&#x4EE3;&#x7801;&#x66F4;&#x6613;&#x4E8E;&#x9605;&#x8BFB;&#xFF0C;&#x5E76;&#x6D88;&#x9664;&#x4E86;&#x65E5;&#x5FD7;&#x8BB0;&#x5F55;&#x65B9;&#x6CD5;&#x6240;&#x9700;&#x7684;&#x63A5;&#x53E3;&#x3002;</p>
<h2 id="97-example-editor-undo-mechanism-&#x793A;&#x4F8B;&#xFF1A;&#x7F16;&#x8F91;&#x5668;&#x64A4;&#x6D88;&#x673A;&#x5236;">9.7 Example: editor undo mechanism &#x793A;&#x4F8B;&#xFF1A;&#x7F16;&#x8F91;&#x5668;&#x64A4;&#x6D88;&#x673A;&#x5236;</h2>
<p>&#x5728; 6.2 &#x8282;&#x7684; GUI &#x7F16;&#x8F91;&#x5668;&#x9879;&#x76EE;&#x4E2D;&#xFF0C;&#x8981;&#x6C42;&#x4E4B;&#x4E00;&#x662F;&#x652F;&#x6301;&#x591A;&#x7EA7;&#x64A4;&#x6D88;/&#x91CD;&#x505A;&#xFF0C;&#x4E0D;&#x4EC5;&#x8981;&#x66F4;&#x6539;&#x6587;&#x672C;&#x672C;&#x8EAB;&#xFF0C;&#x8FD8;&#x8981;&#x66F4;&#x6539;&#x9009;&#x62E9;&#xFF0C;&#x63D2;&#x5165;&#x5149;&#x6807;&#x548C;&#x89C6;&#x56FE;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x7528;&#x6237;&#x9009;&#x62E9;&#x4E86;&#x4E00;&#x4E9B;&#x6587;&#x672C;&#xFF0C;&#x5C06;&#x5176;&#x5220;&#x9664;&#xFF0C;&#x6EDA;&#x52A8;&#x5230;&#x6587;&#x4EF6;&#x4E2D;&#x7684;&#x5176;&#x4ED6;&#x4F4D;&#x7F6E;&#xFF0C;&#x7136;&#x540E;&#x8C03;&#x7528; undo&#xFF0C;&#x5219;&#x7F16;&#x8F91;&#x5668;&#x5FC5;&#x987B;&#x5C06;&#x5176;&#x72B6;&#x6001;&#x6062;&#x590D;&#x4E3A;&#x5220;&#x9664;&#x524D;&#x7684;&#x72B6;&#x6001;&#x3002;&#x8FD9;&#x5305;&#x62EC;&#x8FD8;&#x539F;&#x5DF2;&#x5220;&#x9664;&#x7684;&#x6587;&#x672C;&#xFF0C;&#x518D;&#x6B21;&#x9009;&#x62E9;&#x5B83;&#xFF0C;&#x5E76;&#x4F7F;&#x6240;&#x9009;&#x7684;&#x6587;&#x672C;&#x5728;&#x7A97;&#x53E3;&#x4E2D;&#x53EF;&#x89C1;&#x3002;</p>
<p>&#x4E00;&#x4E9B;&#x5B66;&#x751F;&#x9879;&#x76EE;&#x5C06;&#x6574;&#x4E2A;&#x64A4;&#x6D88;&#x673A;&#x5236;&#x5B9E;&#x73B0;&#x4E3A;&#x6587;&#x672C;&#x7C7B;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;&#x6587;&#x672C;&#x7C7B;&#x7EF4;&#x62A4;&#x6240;&#x6709;&#x4E0D;&#x53EF;&#x64A4;&#x6D88;&#x66F4;&#x6539;&#x7684;&#x5217;&#x8868;&#x3002;&#x6BCF;&#x5F53;&#x66F4;&#x6539;&#x6587;&#x672C;&#x65F6;&#xFF0C;&#x5B83;&#x5C06;&#x81EA;&#x52A8;&#x5C06;&#x6761;&#x76EE;&#x6DFB;&#x52A0;&#x5230;&#x6B64;&#x5217;&#x8868;&#x4E2D;&#x3002;&#x4E3A;&#x4E86;&#x66F4;&#x6539;&#x9009;&#x62E9;&#xFF0C;&#x63D2;&#x5165;&#x5149;&#x6807;&#x548C;&#x89C6;&#x56FE;&#xFF0C;&#x7528;&#x6237;&#x754C;&#x9762;&#x4EE3;&#x7801;&#x8C03;&#x7528;&#x4E86;&#x6587;&#x672C;&#x7C7B;&#x4E2D;&#x7684;&#x5176;&#x4ED6;&#x65B9;&#x6CD5;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x8FD9;&#x4E9B;&#x66F4;&#x6539;&#x7684;&#x6761;&#x76EE;&#x6DFB;&#x52A0;&#x5230;&#x64A4;&#x6D88;&#x5217;&#x8868;&#x4E2D;&#x3002;&#x5F53;&#x7528;&#x6237;&#x8BF7;&#x6C42;&#x64A4;&#x6D88;&#x6216;&#x91CD;&#x505A;&#x65F6;&#xFF0C;&#x7528;&#x6237;&#x754C;&#x9762;&#x4EE3;&#x7801;&#x5C06;&#x8C03;&#x7528;&#x6587;&#x672C;&#x7C7B;&#x4E2D;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x8BE5;&#x65B9;&#x6CD5;&#x7136;&#x540E;&#x5904;&#x7406;&#x64A4;&#x6D88;&#x5217;&#x8868;&#x4E2D;&#x7684;&#x6761;&#x76EE;&#x3002;&#x5BF9;&#x4E8E;&#x4E0E;&#x6587;&#x672C;&#x76F8;&#x5173;&#x7684;&#x6761;&#x76EE;&#xFF0C;&#x5B83;&#x66F4;&#x65B0;&#x4E86;&#x6587;&#x672C;&#x7C7B;&#x7684;&#x5185;&#x90E8;&#x3002;&#x5BF9;&#x4E8E;&#x4E0E;&#x5176;&#x4ED6;&#x4E8B;&#x7269;&#xFF08;&#x4F8B;&#x5982;&#x9009;&#x62E9;&#xFF09;&#x76F8;&#x5173;&#x7684;&#x6761;&#x76EE;&#xFF0C;&#x5C06;&#x8C03;&#x7528;&#x8FD4;&#x56DE;&#x5230;&#x7528;&#x6237;&#x754C;&#x9762;&#x4EE3;&#x7801;&#x7684;&#x6587;&#x672C;&#x7C7B;&#x6765;&#x6267;&#x884C;&#x64A4;&#x6D88;&#x6216;&#x91CD;&#x505A;&#x3002;</p>
<p>&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x5728;&#x6587;&#x672C;&#x7C7B;&#x4E2D;&#x5BFC;&#x81F4;&#x4E86;&#x4E00;&#x7CFB;&#x5217;&#x5C34;&#x5C2C;&#x7684;&#x529F;&#x80FD;&#x3002;&#x64A4;&#x6D88;/&#x91CD;&#x505A;&#x7684;&#x6838;&#x5FC3;&#x7531;&#x901A;&#x7528;&#x673A;&#x5236;&#x7EC4;&#x6210;&#xFF0C;&#x7528;&#x4E8E;&#x7BA1;&#x7406;&#x5DF2;&#x6267;&#x884C;&#x7684;&#x52A8;&#x4F5C;&#x5217;&#x8868;&#xFF0C;&#x5E76;&#x5728;&#x64A4;&#x6D88;&#x548C;&#x91CD;&#x505A;&#x64CD;&#x4F5C;&#x671F;&#x95F4;&#x9010;&#x6B65;&#x6267;&#x884C;&#x8FD9;&#x4E9B;&#x52A8;&#x4F5C;&#x3002;&#x6838;&#x5FC3;&#x4E0E;&#x4E13;&#x7528;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x4E00;&#x8D77;&#x4F4D;&#x4E8E; text &#x7C7B;&#x4E2D;&#xFF0C;&#x8BE5;&#x4E13;&#x7528;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x5BF9;&#x8BF8;&#x5982;&#x6587;&#x672C;&#x548C;&#x9009;&#x62E9;&#x4E4B;&#x7C7B;&#x7684;&#x7279;&#x5B9A;&#x5185;&#x5BB9;&#x5B9E;&#x73B0;&#x4E86;&#x64A4;&#x6D88;&#x548C;&#x91CD;&#x505A;&#x3002;&#x7528;&#x4E8E;&#x9009;&#x62E9;&#x548C;&#x5149;&#x6807;&#x7684;&#x4E13;&#x7528;&#x64A4;&#x6D88;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x4E0E;&#x6587;&#x672C;&#x7C7B;&#x4E2D;&#x7684;&#x4EFB;&#x4F55;&#x5176;&#x4ED6;&#x5185;&#x5BB9;&#x5747;&#x65E0;&#x5173;&#x3002;&#x5B83;&#x4EEC;&#x5BFC;&#x81F4;&#x6587;&#x672C;&#x7C7B;&#x548C;&#x7528;&#x6237;&#x754C;&#x9762;&#x4E4B;&#x95F4;&#x7684;&#x4FE1;&#x606F;&#x6CC4;&#x6F0F;&#xFF0C;&#x4EE5;&#x53CA;&#x6BCF;&#x4E2A;&#x6A21;&#x5757;&#x4E2D;&#x6765;&#x56DE;&#x4F20;&#x9012;&#x64A4;&#x6D88;&#x4FE1;&#x606F;&#x7684;&#x989D;&#x5916;&#x65B9;&#x6CD5;&#x3002;&#x5982;&#x679C;&#x5C06;&#x6765;&#x5C06;&#x65B0;&#x7684;&#x53EF;&#x64A4;&#x6D88;&#x5B9E;&#x4F53;&#x6DFB;&#x52A0;&#x5230;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x5219;&#x5C06;&#x9700;&#x8981;&#x66F4;&#x6539;&#x6587;&#x672C;&#x7C7B;&#xFF0C;&#x5305;&#x62EC;&#x7279;&#x5B9A;&#x4E8E;&#x8BE5;&#x5B9E;&#x4F53;&#x7684;&#x65B0;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x901A;&#x8FC7;&#x63D0;&#x53D6;&#x64A4;&#x6D88;/&#x91CD;&#x505A;&#x673A;&#x5236;&#x7684;&#x901A;&#x7528;&#x6838;&#x5FC3;&#x5E76;&#x5C06;&#x5176;&#x653E;&#x5728;&#x5355;&#x72EC;&#x7684;&#x7C7B;&#x4E2D;&#xFF0C;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#xFF1A;</p>
<pre><code class="lang-java"><span class="hljs-keyword">public</span> <span class="hljs-class"><span class="hljs-keyword">class</span> <span class="hljs-title">History</span> </span>{
    <span class="hljs-keyword">public</span> <span class="hljs-class"><span class="hljs-keyword">interface</span> <span class="hljs-title">Action</span> </span>{
        <span class="hljs-function"><span class="hljs-keyword">public</span> <span class="hljs-keyword">void</span> <span class="hljs-title">redo</span><span class="hljs-params">()</span></span>;
        <span class="hljs-function"><span class="hljs-keyword">public</span> <span class="hljs-keyword">void</span> <span class="hljs-title">undo</span><span class="hljs-params">()</span></span>;
    }
    History() {...}
    <span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">addAction</span><span class="hljs-params">(Action action)</span> </span>{...}
    <span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">addFence</span><span class="hljs-params">()</span> </span>{...}
    <span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">undo</span><span class="hljs-params">()</span> </span>{...}
    <span class="hljs-function"><span class="hljs-keyword">void</span> <span class="hljs-title">redo</span><span class="hljs-params">()</span> </span>{...}
}
</code></pre>
<p>&#x5728;&#x6B64;&#x8BBE;&#x8BA1;&#x4E2D;&#xFF0C;History &#x7C7B;&#x7BA1;&#x7406;&#x5B9E;&#x73B0;&#x63A5;&#x53E3; History.Action &#x7684;&#x5BF9;&#x8C61;&#x7684;&#x96C6;&#x5408;&#x3002;&#x6BCF;&#x4E2A; History.Action &#x63CF;&#x8FF0;&#x4E00;&#x4E2A;&#x64CD;&#x4F5C;&#xFF0C;&#x4F8B;&#x5982;&#x63D2;&#x5165;&#x6587;&#x672C;&#x6216;&#x66F4;&#x6539;&#x5149;&#x6807;&#x4F4D;&#x7F6E;&#xFF0C;&#x5E76;&#x4E14;&#x5B83;&#x63D0;&#x4F9B;&#x4E86;&#x53EF;&#x4EE5;&#x64A4;&#x6D88;&#x6216;&#x91CD;&#x505A;&#x8BE5;&#x64CD;&#x4F5C;&#x7684;&#x65B9;&#x6CD5;&#x3002;History &#x7C7B;&#x5BF9;&#x64CD;&#x4F5C;&#x4E2D;&#x5B58;&#x50A8;&#x7684;&#x4FE1;&#x606F;&#x6216;&#x5B83;&#x4EEC;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x5176;&#x64A4;&#x6D88;&#x548C;&#x91CD;&#x505A;&#x65B9;&#x6CD5;&#x4E00;&#x65E0;&#x6240;&#x77E5;&#x3002;&#x5386;&#x53F2;&#x8BB0;&#x5F55;&#x7EF4;&#x62A4;&#x4E00;&#x4E2A;&#x5386;&#x53F2;&#x8BB0;&#x5F55;&#x5217;&#x8868;&#xFF0C;&#x8BE5;&#x5217;&#x8868;&#x63CF;&#x8FF0;&#x4E86;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6574;&#x4E2A;&#x751F;&#x547D;&#x5468;&#x671F;&#x4E2D;&#x6267;&#x884C;&#x7684;&#x6240;&#x6709;&#x64CD;&#x4F5C;&#xFF0C;&#x5E76;&#x4E14;&#x5B83;&#x63D0;&#x4F9B;&#x4E86;&#x64A4;&#x6D88;&#x548C;&#x91CD;&#x505A;&#x65B9;&#x6CD5;&#xFF0C;&#x4EE5;&#x54CD;&#x5E94;&#x7528;&#x6237;&#x8BF7;&#x6C42;&#x7684;&#x64A4;&#x6D88;&#x548C;&#x91CD;&#x505A;&#x800C;&#x5728;&#x5217;&#x8868;&#x4E2D;&#x524D;&#x540E;&#x79FB;&#x52A8;&#xFF0C;&#x5E76;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x8C03;&#x7528;&#x64A4;&#x6D88;&#x548C;&#x91CD;&#x505A;&#x65B9;&#x6CD5;&#x3002;&#x5386;&#x53F2;&#x52A8;&#x4F5C;&#x3002;</p>
<p>History.Actions are special-purpose objects: each one understands a particular kind of undoable operation. They are implemented outside the History class, in modules that understand particular kinds of undoable actions. The text class might implement UndoableInsert and UndoableDelete objects to describe text insertions and deletions. Whenever it inserts text, the text class creates a new UndoableInsert object describing the insertion and invokes History.addAction to add it to the history list. The editor&#x2019;s user interface code might create UndoableSelection and UndoableCursor objects that describe changes to the selection and insertion cursor.</p>
<blockquote>
<p>&#x5386;&#x53F2;&#x3002;&#x52A8;&#x4F5C;&#x662F;&#x7279;&#x6B8A;&#x76EE;&#x7684;&#x7684;&#x5BF9;&#x8C61;&#xFF1A;&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x4E86;&#x89E3;&#x4E00;&#x79CD;&#x7279;&#x6B8A;&#x7684;&#x4E0D;&#x53EF;&#x64CD;&#x4F5C;&#x3002;&#x5B83;&#x4EEC;&#x5728; History &#x7C7B;&#x4E4B;&#x5916;&#x7684;&#x6A21;&#x5757;&#x4E2D;&#x5B9E;&#x73B0;&#xFF0C;&#x8FD9;&#x4E9B;&#x6A21;&#x5757;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x7279;&#x5B9A;&#x7C7B;&#x578B;&#x7684;&#x53EF;&#x64A4;&#x9500;&#x64CD;&#x4F5C;&#x3002;&#x6587;&#x672C;&#x7C7B;&#x53EF;&#x80FD;&#x5B9E;&#x73B0; UndoableInsert &#x548C; UndoableDelete &#x5BF9;&#x8C61;&#xFF0C;&#x4EE5;&#x63CF;&#x8FF0;&#x6587;&#x672C;&#x7684;&#x63D2;&#x5165;&#x548C;&#x5220;&#x9664;&#x3002;&#x6BCF;&#x5F53;&#x63D2;&#x5165;&#x6587;&#x672C;&#x65F6;&#xFF0C;&#x6587;&#x672C;&#x7C7B;&#x90FD;&#x4F1A;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x63CF;&#x8FF0;&#x8BE5;&#x63D2;&#x5165;&#x7684;&#x65B0; UndoableInsert &#x5BF9;&#x8C61;&#xFF0C;&#x5E76;&#x8C03;&#x7528; History.addAction &#x5C06;&#x5176;&#x6DFB;&#x52A0;&#x5230;&#x5386;&#x53F2;&#x5217;&#x8868;&#x4E2D;&#x3002;&#x7F16;&#x8F91;&#x5668;&#x7684;&#x7528;&#x6237;&#x754C;&#x9762;&#x4EE3;&#x7801;&#x53EF;&#x80FD;&#x4F1A;&#x521B;&#x5EFA; UndoableSelection &#x548C; UndoableCursor &#x5BF9;&#x8C61;&#xFF0C;&#x8FD9;&#x4E9B;&#x5BF9;&#x8C61;&#x63CF;&#x8FF0;&#x5BF9;&#x9009;&#x62E9;&#x548C;&#x63D2;&#x5165;&#x5149;&#x6807;&#x7684;&#x66F4;&#x6539;&#x3002;</p>
</blockquote>
<p>The History class also allows actions to be grouped so that, for example, a single undo request from the user can restore deleted text, reselect the deleted text, and reposition the insertion cursor. There are a number of ways to group actions; the History class uses fences, which are markers placed in the history list to separate groups of related actions. Each call to History.redo walks backwards through the history list, undoing actions until it reaches the next fence. The placement of fences is determined by higher-level code by invoking History.addFence.</p>
<blockquote>
<p>History &#x7C7B;&#x8FD8;&#x5141;&#x8BB8;&#x5BF9;&#x64CD;&#x4F5C;&#x8FDB;&#x884C;&#x5206;&#x7EC4;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x6765;&#x81EA;&#x7528;&#x6237;&#x7684;&#x5355;&#x4E2A;&#x64A4;&#x6D88;&#x8BF7;&#x6C42;&#x53EF;&#x4EE5;&#x6062;&#x590D;&#x5DF2;&#x5220;&#x9664;&#x7684;&#x6587;&#x672C;&#xFF0C;&#x91CD;&#x65B0;&#x9009;&#x62E9;&#x5DF2;&#x5220;&#x9664;&#x7684;&#x6587;&#x672C;&#x4EE5;&#x53CA;&#x91CD;&#x65B0;&#x653E;&#x7F6E;&#x63D2;&#x5165;&#x5149;&#x6807;&#x3002;&#x6709;&#x591A;&#x79CD;&#x5C06;&#x52A8;&#x4F5C;&#x5206;&#x7EC4;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x5386;&#x53F2;&#x8BB0;&#x5F55;&#x7C7B;&#x4F7F;&#x7528;&#x56F4;&#x680F;&#xFF0C;&#x56F4;&#x680F;&#x662F;&#x653E;&#x7F6E;&#x5728;&#x5386;&#x53F2;&#x8BB0;&#x5F55;&#x5217;&#x8868;&#x4E2D;&#x7684;&#x6807;&#x8BB0;&#xFF0C;&#x7528;&#x4E8E;&#x5206;&#x9694;&#x76F8;&#x5173;&#x52A8;&#x4F5C;&#x7684;&#x7EC4;&#x3002;&#x6BCF;&#x6B21;&#x5BF9; History.redo &#x7684;&#x8C03;&#x7528;&#x90FD;&#x4F1A;&#x5411;&#x540E;&#x6D4F;&#x89C8;&#x5386;&#x53F2;&#x8BB0;&#x5F55;&#x5217;&#x8868;&#xFF0C;&#x64A4;&#x6D88;&#x64CD;&#x4F5C;&#xFF0C;&#x76F4;&#x5230;&#x5230;&#x8FBE;&#x4E0B;&#x4E00;&#x4E2A;&#x6805;&#x680F;&#x3002;&#x56F4;&#x680F;&#x7684;&#x4F4D;&#x7F6E;&#x7531;&#x66F4;&#x9AD8;&#x7EA7;&#x522B;&#x7684;&#x4EE3;&#x7801;&#x901A;&#x8FC7;&#x8C03;&#x7528; History.addFence &#x786E;&#x5B9A;&#x3002;</p>
</blockquote>
<p>This approach divides the functionality of undo into three categories, each of which is implemented in a different place:</p>
<blockquote>
<p>&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x5C06;&#x64A4;&#x6D88;&#x529F;&#x80FD;&#x5206;&#x4E3A;&#x4E09;&#x7C7B;&#xFF0C;&#x6BCF;&#x7C7B;&#x90FD;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x5730;&#x65B9;&#x5B9E;&#x73B0;&#xFF1A;</p>
</blockquote>
<p>A general-purpose mechanism for managing and grouping actions and invoking undo/redo operations (implemented by the History class).
The specifics of particular actions (implemented by a variety of classes, each of which understands a small number of action types).
The policy for grouping actions (implemented by high-level user interface code to provide the right overall application behavior).
Each of these categories can be implemented without any understanding of the other categories. The History class does not know what kind of actions are being undone; it could be used in a variety of applications. Each action class understands only a single kind of action, and neither the History class nor the action classes needs to be aware of the policy for grouping actions.</p>
<blockquote>
<p>&#x4E00;&#x79CD;&#x7528;&#x4E8E;&#x7BA1;&#x7406;&#x548C;&#x5206;&#x7EC4;&#x52A8;&#x4F5C;&#x4EE5;&#x53CA;&#x8C03;&#x7528;&#x64A4;&#x6D88;/&#x91CD;&#x505A;&#x64CD;&#x4F5C;&#x7684;&#x901A;&#x7528;&#x673A;&#x5236;&#xFF08;&#x7531; History &#x7C7B;&#x5B9E;&#x73B0;&#xFF09;&#x3002;&#x7279;&#x5B9A;&#x64CD;&#x4F5C;&#x7684;&#x7EC6;&#x8282;&#xFF08;&#x7531;&#x5404;&#x79CD;&#x7C7B;&#x5B9E;&#x73B0;&#xFF0C;&#x6BCF;&#x4E2A;&#x7C7B;&#x90FD;&#x4E86;&#x89E3;&#x5C11;&#x91CF;&#x7684;&#x64CD;&#x4F5C;&#x7C7B;&#x578B;&#xFF09;&#x3002;&#x5206;&#x7EC4;&#x64CD;&#x4F5C;&#x7684;&#x7B56;&#x7565;&#xFF08;&#x7531;&#x9AD8;&#x7EA7;&#x7528;&#x6237;&#x754C;&#x9762;&#x4EE3;&#x7801;&#x5B9E;&#x73B0;&#xFF0C;&#x4EE5;&#x63D0;&#x4F9B;&#x6B63;&#x786E;&#x7684;&#x6574;&#x4F53;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x884C;&#x4E3A;&#xFF09;&#x3002;&#x8FD9;&#x4E9B;&#x7C7B;&#x522B;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x90FD;&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x4E86;&#x89E3;&#x5176;&#x4ED6;&#x7C7B;&#x522B;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x5B9E;&#x65BD;&#x3002;&#x5386;&#x53F2;&#x8BFE;&#x4E0D;&#x77E5;&#x9053;&#x8981;&#x64A4;&#x6D88;&#x54EA;&#x79CD;&#x64CD;&#x4F5C;&#xFF1B;&#x5B83;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x591A;&#x79CD;&#x5E94;&#x7528;&#x3002;&#x6BCF;&#x4E2A;&#x52A8;&#x4F5C;&#x7C7B;&#x4EC5;&#x7406;&#x89E3;&#x4E00;&#x79CD;&#x52A8;&#x4F5C;&#xFF0C;&#x5E76;&#x4E14;&#x5386;&#x53F2;&#x8BB0;&#x5F55;&#x7C7B;&#x548C;&#x52A8;&#x4F5C;&#x7C7B;&#x90FD;&#x4E0D;&#x9700;&#x8981;&#x77E5;&#x9053;&#x5C06;&#x52A8;&#x4F5C;&#x5206;&#x7EC4;&#x7684;&#x7B56;&#x7565;&#x3002;</p>
</blockquote>
<p>The key design decision was the one that separated the general-purpose part of the undo mechanism from the special-purpose parts and put the general-purpose part in a class by itself. Once that was done, the rest of the design fell out naturally.</p>
<blockquote>
<p>&#x5173;&#x952E;&#x7684;&#x8BBE;&#x8BA1;&#x51B3;&#x7B56;&#x662F;&#x5C06;&#x64A4;&#x6D88;&#x673A;&#x5236;&#x7684;&#x901A;&#x7528;&#x90E8;&#x5206;&#x4E0E;&#x4E13;&#x7528;&#x90E8;&#x5206;&#x5206;&#x5F00;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x901A;&#x7528;&#x90E8;&#x5206;&#x5355;&#x72EC;&#x653E;&#x5728;&#x4E00;&#x4E2A;&#x7C7B;&#x4E2D;&#x7684;&#x51B3;&#x5B9A;&#x3002;&#x4E00;&#x65E6;&#x5B8C;&#x6210;&#xFF0C;&#x5176;&#x4F59;&#x7684;&#x8BBE;&#x8BA1;&#x5C31;&#x4F1A;&#x81EA;&#x7136;&#x6D88;&#x5931;&#x3002;</p>
</blockquote>
<p>Note: the suggestion to separate general-purpose code from special-purpose code refers to code related to a particular mechanism. For example, special-purpose undo code (such as code to undo a text insertion) should be separated from general-purpose undo code (such as code to manage the history list). However, it often makes sense to combine special-purpose code for one mechanism with general-purpose code for another. The text class is an example of this: it implements a general-purpose mechanism for managing text, but it includes special-purpose code related to undoing. The undo code is special-purpose because it only handles undo operations for text modifications. It doesn&#x2019;t make sense to combine this code with the general-purpose undo infrastructure in the History class, but it does make sense to put it in the text class, since it is closely related to other text functions.</p>
<blockquote>
<p>&#x6CE8;&#x610F;:&#x5C06;&#x901A;&#x7528;&#x4EE3;&#x7801;&#x4E0E;&#x4E13;&#x7528;&#x4EE3;&#x7801;&#x5206;&#x79BB;&#x7684;&#x5EFA;&#x8BAE;&#x662F;&#x6307;&#x4E0E;&#x7279;&#x5B9A;&#x673A;&#x5236;&#x76F8;&#x5173;&#x7684;&#x4EE3;&#x7801;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x7279;&#x6B8A;&#x7528;&#x9014;&#x7684;&#x64A4;&#x6D88;&#x4EE3;&#x7801;(&#x4F8B;&#x5982;&#x64A4;&#x6D88;&#x6587;&#x672C;&#x63D2;&#x5165;&#x7684;&#x4EE3;&#x7801;)&#x5E94;&#x8BE5;&#x4E0E;&#x901A;&#x7528;&#x7528;&#x9014;&#x7684;&#x64A4;&#x6D88;&#x4EE3;&#x7801;(&#x4F8B;&#x5982;&#x7BA1;&#x7406;&#x5386;&#x53F2;&#x8BB0;&#x5F55;&#x5217;&#x8868;&#x7684;&#x4EE3;&#x7801;)&#x5206;&#x5F00;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5C06;&#x4E00;&#x79CD;&#x673A;&#x5236;&#x7684;&#x4E13;&#x7528;&#x4EE3;&#x7801;&#x4E0E;&#x53E6;&#x4E00;&#x79CD;&#x673A;&#x5236;&#x7684;&#x901A;&#x7528;&#x4EE3;&#x7801;&#x7EC4;&#x5408;&#x8D77;&#x6765;&#x901A;&#x5E38;&#x662F;&#x6709;&#x610F;&#x4E49;&#x7684;&#x3002;text &#x7C7B;&#x5C31;&#x662F;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;:&#x5B83;&#x5B9E;&#x73B0;&#x4E86;&#x4E00;&#x79CD;&#x7BA1;&#x7406;&#x6587;&#x672C;&#x7684;&#x901A;&#x7528;&#x673A;&#x5236;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x5305;&#x542B;&#x4E86;&#x4E0E;&#x64A4;&#x9500;&#x76F8;&#x5173;&#x7684;&#x4E13;&#x7528;&#x4EE3;&#x7801;&#x3002;&#x64A4;&#x6D88;&#x4EE3;&#x7801;&#x662F;&#x4E13;&#x7528;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x53EA;&#x5904;&#x7406;&#x6587;&#x672C;&#x4FEE;&#x6539;&#x7684;&#x64A4;&#x6D88;&#x64CD;&#x4F5C;&#x3002;&#x5C06;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x4E0E; History &#x7C7B;&#x4E2D;&#x901A;&#x7528;&#x7684; undo &#x57FA;&#x7840;&#x7ED3;&#x6784;&#x7ED3;&#x5408;&#x5728;&#x4E00;&#x8D77;&#x662F;&#x6CA1;&#x6709;&#x610F;&#x4E49;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x5C06;&#x5B83;&#x653E;&#x5728; text &#x7C7B;&#x4E2D;&#x662F;&#x6709;&#x610F;&#x4E49;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4E0E;&#x5176;&#x4ED6;&#x6587;&#x672C;&#x51FD;&#x6570;&#x5BC6;&#x5207;&#x76F8;&#x5173;&#x3002;</p>
</blockquote>
<h2 id="98-splitting-and-joining-methods-&#x62C6;&#x5206;&#x548C;&#x5408;&#x5E76;&#x65B9;&#x6CD5;">9.8 Splitting and joining methods &#x62C6;&#x5206;&#x548C;&#x5408;&#x5E76;&#x65B9;&#x6CD5;</h2>
<p>The issue of when to subdivide applies not just to classes, but also to methods: are there times when it is better to divide an existing method into multiple smaller methods? Or, should two smaller methods be combined into one larger one? Long methods tend to be more difficult to understand than shorter ones, so many people argue that length alone is a good justification for breaking up a method. Students in classes are often given rigid criteria, such as &#x201C;Split up any method longer than 20 lines!&#x201D;</p>
<blockquote>
<p>&#x4F55;&#x65F6;&#x7EC6;&#x5206;&#x7684;&#x95EE;&#x9898;&#x4E0D;&#x4EC5;&#x9002;&#x7528;&#x4E8E;&#x7C7B;&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x9002;&#x7528;&#x4E8E;&#x65B9;&#x6CD5;&#xFF1A;&#x662F;&#x5426;&#x6709;&#x65F6;&#x6700;&#x597D;&#x5C06;&#x73B0;&#x6709;&#x65B9;&#x6CD5;&#x5206;&#x4E3A;&#x591A;&#x4E2A;&#x8F83;&#x5C0F;&#x7684;&#x65B9;&#x6CD5;&#xFF1F;&#x8FD8;&#x662F;&#x5E94;&#x8BE5;&#x5C06;&#x4E24;&#x79CD;&#x8F83;&#x5C0F;&#x7684;&#x65B9;&#x6CD5;&#x5408;&#x5E76;&#x4E3A;&#x4E00;&#x79CD;&#x8F83;&#x5927;&#x7684;&#x65B9;&#x6CD5;&#xFF1F;&#x957F;&#x65B9;&#x6CD5;&#x6BD4;&#x77ED;&#x65B9;&#x6CD5;&#x66F4;&#x96BE;&#x4E8E;&#x7406;&#x89E3;&#xFF0C;&#x56E0;&#x6B64;&#x8BB8;&#x591A;&#x4EBA;&#x8BA4;&#x4E3A;&#x4EC5;&#x957F;&#x5EA6;&#x662F;&#x5206;&#x89E3;&#x65B9;&#x6CD5;&#x7684;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x7406;&#x7531;&#x3002;&#x8BFE;&#x5802;&#x4E0A;&#x7684;&#x5B66;&#x751F;&#x901A;&#x5E38;&#x4F1A;&#x83B7;&#x5F97;&#x4E25;&#x683C;&#x7684;&#x6807;&#x51C6;&#xFF0C;&#x4F8B;&#x5982;&#x201C;&#x62C6;&#x5206;&#x8D85;&#x8FC7; 20 &#x884C;&#x7684;&#x4EFB;&#x4F55;&#x65B9;&#x6CD5;&#xFF01;&#x201D;</p>
</blockquote>
<p>However, length by itself is rarely a good reason for splitting up a method. In general, developers tend to break up methods too much. Splitting up a method introduces additional interfaces, which add to complexity. It also separates the pieces of the original method, which makes the code harder to read if the pieces are actually related. You shouldn&#x2019;t break up a method unless it makes the overall system simpler; I&#x2019;ll discuss how this might happen below.</p>
<blockquote>
<p>&#x4F46;&#x662F;&#xFF0C;&#x957F;&#x5EA6;&#x672C;&#x8EAB;&#x5F88;&#x5C11;&#x662F;&#x62C6;&#x5206;&#x65B9;&#x6CD5;&#x7684;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x7406;&#x7531;&#x3002;&#x901A;&#x5E38;&#xFF0C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x503E;&#x5411;&#x4E8E;&#x8FC7;&#x591A;&#x5730;&#x5206;&#x89E3;&#x65B9;&#x6CD5;&#x3002;&#x62C6;&#x5206;&#x65B9;&#x6CD5;&#x4F1A;&#x5F15;&#x5165;&#x5176;&#x4ED6;&#x63A5;&#x53E3;&#xFF0C;&#x4ECE;&#x800C;&#x589E;&#x52A0;&#x4E86;&#x590D;&#x6742;&#x6027;&#x3002;&#x5B83;&#x8FD8;&#x5C06;&#x539F;&#x59CB;&#x65B9;&#x6CD5;&#x7684;&#x5404;&#x4E2A;&#x90E8;&#x5206;&#x5206;&#x5F00;&#xFF0C;&#x5982;&#x679C;&#x8FD9;&#x4E9B;&#x90E8;&#x5206;&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x76F8;&#x5173;&#x7684;&#xFF0C;&#x5219;&#x4F7F;&#x4EE3;&#x7801;&#x66F4;&#x96BE;&#x9605;&#x8BFB;&#x3002;&#x60A8;&#x4E0D;&#x5E94;&#x8BE5;&#x5206;&#x89E3;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#xFF0C;&#x9664;&#x975E;&#x5B83;&#x4F7F;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x66F4;&#x52A0;&#x7B80;&#x5355;&#xFF1B;&#x6211;&#x5C06;&#x5728;&#x4E0B;&#x9762;&#x8BA8;&#x8BBA;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x3002;</p>
</blockquote>
<p>Long methods aren&#x2019;t always bad. For example, suppose a method contains five 20-line blocks of code that are executed in order. If the blocks are relatively independent, then the method can be read and understood one block at a time; there&#x2019;s not much benefit in moving each of the blocks into a separate method. If the blocks have complex interactions, it&#x2019;s even more important to keep them together so readers can see all of the code at once; if each block is in a separate method, readers will have to flip back and forth between these spread-out methods in order to understand how they work together. Methods containing hundreds of lines of code are fine if they have a simple signature and are easy to read. These methods are deep (lots of functionality, simple interface), which is good.</p>
<blockquote>
<p>&#x957F;&#x65B9;&#x6CD5;&#x5E76;&#x4E0D;&#x603B;&#x662F;&#x574F;&#x7684;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5047;&#x8BBE;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x5305;&#x542B;&#x6309;&#x987A;&#x5E8F;&#x6267;&#x884C;&#x7684;&#x4E94;&#x4E2A; 20 &#x884C;&#x4EE3;&#x7801;&#x5757;&#x3002;&#x5982;&#x679C;&#x8FD9;&#x4E9B;&#x5757;&#x662F;&#x76F8;&#x5BF9;&#x72EC;&#x7ACB;&#x7684;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x4E00;&#x6B21;&#x8BFB;&#x53D6;&#x5E76;&#x7406;&#x89E3;&#x8BE5;&#x65B9;&#x6CD5;&#x7684;&#x4E00;&#x4E2A;&#x5757;&#x3002;&#x5C06;&#x6BCF;&#x4E2A;&#x5757;&#x79FB;&#x52A8;&#x5230;&#x5355;&#x72EC;&#x7684;&#x65B9;&#x6CD5;&#x4E2D;&#x5E76;&#x6CA1;&#x6709;&#x592A;&#x5927;&#x7684;&#x597D;&#x5904;&#x3002;&#x5982;&#x679C;&#x8FD9;&#x4E9B;&#x5757;&#x5177;&#x6709;&#x590D;&#x6742;&#x7684;&#x4EA4;&#x4E92;&#x4F5C;&#x7528;&#xFF0C;&#x5219;&#x5C06;&#x5B83;&#x4EEC;&#x4FDD;&#x6301;&#x5728;&#x4E00;&#x8D77;&#x5C31;&#x663E;&#x5F97;&#x5C24;&#x4E3A;&#x91CD;&#x8981;&#xFF0C;&#x8FD9;&#x6837;&#x8BFB;&#x8005;&#x5C31;&#x53EF;&#x4EE5;&#x4E00;&#x6B21;&#x770B;&#x5230;&#x6240;&#x6709;&#x4EE3;&#x7801;&#x3002;&#x5982;&#x679C;&#x6BCF;&#x4E2A;&#x5757;&#x4F7F;&#x7528;&#x5355;&#x72EC;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5219;&#x8BFB;&#x8005;&#x5C06;&#x4E0D;&#x5F97;&#x4E0D;&#x5728;&#x8FD9;&#x4E9B;&#x6269;&#x5C55;&#x65B9;&#x6CD5;&#x4E4B;&#x95F4;&#x6765;&#x56DE;&#x5207;&#x6362;&#xFF0C;&#x4EE5;&#x4E86;&#x89E3;&#x5B83;&#x4EEC;&#x5982;&#x4F55;&#x534F;&#x540C;&#x5DE5;&#x4F5C;&#x3002;&#x5982;&#x679C;&#x65B9;&#x6CD5;&#x5177;&#x6709;&#x7B80;&#x5355;&#x7684;&#x7B7E;&#x540D;&#x5E76;&#x4E14;&#x6613;&#x4E8E;&#x9605;&#x8BFB;&#xFF0C;&#x5219;&#x5305;&#x542B;&#x6570;&#x767E;&#x884C;&#x4EE3;&#x7801;&#x7684;&#x65B9;&#x6CD5;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;&#x8FD9;&#x4E9B;&#x65B9;&#x6CD5;&#x5F88;&#x6DF1;&#x5165;&#xFF08;&#x5F88;&#x591A;&#x529F;&#x80FD;&#xFF0C;&#x7B80;&#x5355;&#x7684;&#x63A5;&#x53E3;&#xFF09;&#xFF0C;&#x5F88;&#x597D;&#x3002;</p>
</blockquote>
<p><img src="figures/00019.jpeg" alt=""></p>
<p>Figure 9.3: A method (a) can be split either by by extracting a subtask (b) or by dividing its functionality into two separate methods (c). A method should not be split if it results in shallow methods, as in (d).</p>
<blockquote>
<p>&#x56FE; 9.3&#xFF1A;&#x65B9;&#x6CD5;&#xFF08;a&#xFF09;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x63D0;&#x53D6;&#x5B50;&#x4EFB;&#x52A1;&#xFF08;b&#xFF09;&#x6216;&#x5C06;&#x5176;&#x529F;&#x80FD;&#x5212;&#x5206;&#x4E3A;&#x4E24;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x65B9;&#x6CD5;&#xFF08;c&#xFF09;&#x8FDB;&#x884C;&#x62C6;&#x5206;&#x3002;&#x5982;&#x679C;&#x65B9;&#x6CD5;&#x5BFC;&#x81F4;&#x6D45;&#x5C42;&#x65B9;&#x6CD5;&#xFF0C;&#x5219;&#x4E0D;&#x5E94;&#x62C6;&#x5206;&#x8BE5;&#x65B9;&#x6CD5;&#xFF0C;&#x5982;&#xFF08;d&#xFF09;&#x6240;&#x793A;&#x3002;</p>
</blockquote>
<p>When designing methods, the most important goal is to provide clean and simple abstractions. Each method should do one thing and do it completely. The method should have a clean and simple interface, so that users don&#x2019;t need to have much information in their heads in order to use it correctly. The method should be deep: its interface should be much simpler than its implementation. If a method has all of these properties, then it probably doesn&#x2019;t matter whether it is long or not.</p>
<blockquote>
<p>&#x8BBE;&#x8BA1;&#x65B9;&#x6CD5;&#x65F6;&#xFF0C;&#x6700;&#x91CD;&#x8981;&#x7684;&#x76EE;&#x6807;&#x662F;&#x63D0;&#x4F9B;&#x7B80;&#x6D01;&#x7684;&#x62BD;&#x8C61;&#x3002;&#x6BCF;&#x79CD;&#x65B9;&#x6CD5;&#x90FD;&#x5E94;&#x8BE5;&#x505A;&#x4E00;&#x4EF6;&#x4E8B;&#x5E76;&#x4E14;&#x5B8C;&#x5168;&#x505A;&#x5230;&#x8FD9;&#x4E00;&#x70B9;&#x3002;&#x8BE5;&#x65B9;&#x6CD5;&#x5E94;&#x8BE5;&#x5177;&#x6709;&#x7B80;&#x6D01;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x4EE5;&#x4FBF;&#x7528;&#x6237;&#x65E0;&#x9700;&#x8D39;&#x795E;&#x5C31;&#x53EF;&#x4EE5;&#x6B63;&#x786E;&#x4F7F;&#x7528;&#x5B83;&#x3002;&#x8BE5;&#x65B9;&#x6CD5;&#x5E94;&#x8BE5;&#x5F88;&#x6DF1;&#xFF1A;&#x5176;&#x63A5;&#x53E3;&#x5E94;&#x8BE5;&#x6BD4;&#x5176;&#x5B9E;&#x73B0;&#x7B80;&#x5355;&#x5F97;&#x591A;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x5177;&#x6709;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x5C5E;&#x6027;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x7684;&#x957F;&#x77ED;&#x4E0E;&#x5426;&#x53EF;&#x80FD;&#x65E0;&#x5173;&#x7D27;&#x8981;&#x3002;</p>
</blockquote>
<p>Splitting up a method only makes sense if it results in cleaner abstractions, overall. There are two ways to do this, which are diagrammed in Figure 9.3. The best way is by factoring out a subtask into a separate method, as shown in Figure 9.3(b). The subdivision results in a child method containing the subtask and a parent method containing the remainder of the original method; the parent invokes the child. The interface of the new parent method is the same as the original method. This form of subdivision makes sense if there is a subtask that is cleanly separable from the rest of the original method, which means (a) someone reading the child method doesn&#x2019;t need to know anything about the parent method and (b) someone reading the parent method doesn&#x2019;t need to understand the implementation of the child method. Typically this means that the child method is relatively general-purpose: it could conceivably be used by other methods besides the parent. If you make a split of this form and then find yourself flipping back and forth between the parent and child to understand how they work together, that is a red flag (&#x201C;Conjoined Methods&#x201D;) indicating that the split was probably a bad idea.</p>
<blockquote>
<p>&#x603B;&#x4F53;&#x800C;&#x8A00;&#xFF0C;&#x62C6;&#x5206;&#x65B9;&#x6CD5;&#x53EA;&#x6709;&#x5728;&#x5176;&#x5BFC;&#x81F4;&#x66F4;&#x62BD;&#x8C61;&#x7684;&#x62BD;&#x8C61;&#x65F6;&#x624D;&#x6709;&#x610F;&#x4E49;&#x3002;&#x6709;&#x4E24;&#x79CD;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x505A;&#x5230;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x5982;&#x56FE; 9.3 &#x6240;&#x793A;&#x3002;&#x6700;&#x4F73;&#x65B9;&#x6CD5;&#x662F;&#x5C06;&#x5B50;&#x4EFB;&#x52A1;&#x5206;&#x89E3;&#x4E3A;&#x5355;&#x72EC;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5982;&#x56FE; 9.3&#xFF08;b&#xFF09;&#x6240;&#x793A;&#x3002;&#x8BE5;&#x7EC6;&#x5206;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x5305;&#x542B;&#x8BE5;&#x5B50;&#x4EFB;&#x52A1;&#x7684;&#x5B50;&#x65B9;&#x6CD5;&#x548C;&#x4E00;&#x4E2A;&#x5305;&#x542B;&#x539F;&#x59CB;&#x65B9;&#x6CD5;&#x5176;&#x4F59;&#x90E8;&#x5206;&#x7684;&#x7236;&#x65B9;&#x6CD5;&#xFF1B;&#x7236;&#x7EA7;&#x8C03;&#x7528;&#x5B50;&#x7EA7;&#x3002;&#x65B0;&#x7684;&#x7236;&#x65B9;&#x6CD5;&#x7684;&#x63A5;&#x53E3;&#x4E0E;&#x539F;&#x59CB;&#x65B9;&#x6CD5;&#x7684;&#x63A5;&#x53E3;&#x76F8;&#x540C;&#x3002;&#x5982;&#x679C;&#x5B58;&#x5728;&#x4E00;&#x4E2A;&#x4E0E;&#x539F;&#x59CB;&#x65B9;&#x6CD5;&#x7684;&#x5176;&#x4F59;&#x90E8;&#x5206;&#x5B8C;&#x5168;&#x53EF;&#x5206;&#x79BB;&#x7684;&#x5B50;&#x4EFB;&#x52A1;&#xFF0C;&#x5219;&#x8FD9;&#x79CD;&#x7EC6;&#x5206;&#x5F62;&#x5F0F;&#x662F;&#x6709;&#x610F;&#x4E49;&#x7684;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#xFF08;a&#xFF09;&#x8BFB;&#x53D6;&#x5B50;&#x65B9;&#x6CD5;&#x7684;&#x67D0;&#x4EBA;&#x4E0D;&#x9700;&#x8981;&#x4E86;&#x89E3;&#x6709;&#x5173;&#x7236;&#x65B9;&#x6CD5;&#x7684;&#x4EFB;&#x4F55;&#x4FE1;&#x606F;&#xFF0C;&#x4EE5;&#x53CA;&#xFF08;b&#xFF09;&#x67D0;&#x4EBA;&#x5728;&#x9605;&#x8BFB;&#x7236;&#x65B9;&#x6CD5;&#x4E0D;&#x9700;&#x8981;&#x4E86;&#x89E3;&#x5B50;&#x65B9;&#x6CD5;&#x7684;&#x5B9E;&#x73B0;&#x3002;&#x901A;&#x5E38;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5B50;&#x65B9;&#x6CD5;&#x662F;&#x76F8;&#x5BF9;&#x901A;&#x7528;&#x7684;&#xFF1A;&#x53EF;&#x4EE5;&#x60F3;&#x8C61;&#x9664;&#x7236;&#x65B9;&#x6CD5;&#x5916;&#xFF0C;&#x5176;&#x4ED6;&#x65B9;&#x6CD5;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5B83;&#x3002;&#x5982;&#x679C;&#x60A8;&#x5BF9;&#x8FD9;&#x79CD;&#x5F62;&#x5F0F;&#x8FDB;&#x884C;&#x62C6;&#x5206;&#xFF0C;&#x7136;&#x540E;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x5728;&#x7236;&#x6BCD;&#x548C;&#x5B69;&#x5B50;&#x4E4B;&#x95F4;&#x6765;&#x56DE;&#x7FFB;&#x8F6C;&#x4EE5;&#x4E86;&#x89E3;&#x4ED6;&#x4EEC;&#x5982;&#x4F55;&#x4E00;&#x8D77;&#x5DE5;&#x4F5C;&#xFF0C;&#x90A3;&#x662F;&#x4E00;&#x4E2A;&#x7EA2;&#x8272;&#x6807;&#x8BB0;&#xFF08;&#x201C;&#x8054;&#x5408;&#x65B9;&#x6CD5;&#x201D;&#xFF09;&#xFF0C;&#x8868;&#x660E;&#x62C6;&#x5206;&#x53EF;&#x80FD;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x597D;&#x4E3B;&#x610F;&#x3002;</p>
</blockquote>
<p>The second way to break up a method is to split it into two separate methods, each visible to callers of the original method, as in Figure 9.3(c). This makes sense if the original method had an overly complex interface because it tried to do multiple things that were not closely related. If this is the case, it may be possible to divide the method&#x2019;s functionality into two or more smaller methods, each of which has only a part of the original method&#x2019;s functionality. If you make a split like this, the interface for each of the resulting methods should be simpler than the interface of the original method. Ideally, most callers should only need to invoke one of the two new methods; if callers must invoke both of the new methods, then that adds complexity, which makes it less likely that the split is a good idea. The new methods will be more focused in what they do. It is a good sign if the new methods are more general-purpose than the original method (i.e., you can imagine using them separately in other situations).</p>
<blockquote>
<p>&#x5206;&#x89E3;&#x65B9;&#x6CD5;&#x7684;&#x7B2C;&#x4E8C;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x5C06;&#x5176;&#x62C6;&#x5206;&#x4E3A;&#x4E24;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x6BCF;&#x4E2A;&#x65B9;&#x6CD5;&#x5BF9;&#x539F;&#x59CB;&#x65B9;&#x6CD5;&#x7684;&#x8C03;&#x7528;&#x8005;&#x53EF;&#x89C1;&#xFF0C;&#x5982;&#x56FE; 9.3&#xFF08;c&#xFF09;&#x6240;&#x793A;&#x3002;&#x5982;&#x679C;&#x539F;&#x59CB;&#x65B9;&#x6CD5;&#x7684;&#x63A5;&#x53E3;&#x8FC7;&#x4E8E;&#x590D;&#x6742;&#xFF0C;&#x8FD9;&#x662F;&#x6709;&#x9053;&#x7406;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x8BE5;&#x63A5;&#x53E3;&#x8BD5;&#x56FE;&#x6267;&#x884C;&#x4E0D;&#x5BC6;&#x5207;&#x76F8;&#x5173;&#x7684;&#x591A;&#x9879;&#x64CD;&#x4F5C;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x65B9;&#x6CD5;&#x7684;&#x529F;&#x80FD;&#x5212;&#x5206;&#x4E3A;&#x4E24;&#x4E2A;&#x6216;&#x66F4;&#x591A;&#x4E2A;&#x8F83;&#x5C0F;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x6BCF;&#x4E2A;&#x65B9;&#x6CD5;&#x4EC5;&#x5177;&#x6709;&#x539F;&#x59CB;&#x65B9;&#x6CD5;&#x529F;&#x80FD;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;&#x5982;&#x679C;&#x8FDB;&#x884C;&#x8FD9;&#x6837;&#x7684;&#x62C6;&#x5206;&#xFF0C;&#x5219;&#x6BCF;&#x4E2A;&#x7ED3;&#x679C;&#x65B9;&#x6CD5;&#x7684;&#x63A5;&#x53E3;&#x5E94;&#x8BE5;&#x6BD4;&#x539F;&#x59CB;&#x65B9;&#x6CD5;&#x7684;&#x63A5;&#x53E3;&#x66F4;&#x7B80;&#x5355;&#x3002;&#x7406;&#x60F3;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x8C03;&#x7528;&#x8005;&#x53EA;&#x9700;&#x8981;&#x8C03;&#x7528;&#x4E24;&#x4E2A;&#x65B0;&#x65B9;&#x6CD5;&#x4E4B;&#x4E00;&#x5373;&#x53EF;&#xFF1B;&#x5982;&#x679C;&#x8C03;&#x7528;&#x8005;&#x5FC5;&#x987B;&#x540C;&#x65F6;&#x8C03;&#x7528;&#x8FD9;&#x4E24;&#x4E2A;&#x65B0;&#x65B9;&#x6CD5;&#xFF0C;&#x5219;&#x5C06;&#x589E;&#x52A0;&#x590D;&#x6742;&#x6027;&#xFF0C;&#x4ECE;&#x800C;&#x964D;&#x4F4E;&#x62C6;&#x5206;&#x662F;&#x4E2A;&#x597D;&#x4E3B;&#x610F;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x3002;&#x65B0;&#x65B9;&#x6CD5;&#x5C06;&#x66F4;&#x52A0;&#x4E13;&#x6CE8;&#x4E8E;&#x5B83;&#x4EEC;&#x7684;&#x5DE5;&#x4F5C;&#x3002;&#x5982;&#x679C;&#x65B0;&#x65B9;&#x6CD5;&#x6BD4;&#x539F;&#x59CB;&#x65B9;&#x6CD5;&#x66F4;&#x5177;&#x901A;&#x7528;&#x6027;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x597D;&#x5146;&#x5934;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x60F3;&#x8C61;&#x5728;&#x5176;&#x4ED6;&#x60C5;&#x51B5;&#x4E0B;&#x5355;&#x72EC;&#x4F7F;&#x7528;&#x5B83;&#x4EEC;&#xFF09;&#x3002;</p>
</blockquote>
<p>Splits of the form shown in Figure 9.3(c) don&#x2019;t make sense very often, because they result in callers having to deal with multiple methods instead of one. When you split this way, you run the risk of ending up with several shallow methods, as in Figure 9.3(d). If the caller has to invoke each of the separate methods, passing state back and forth between them, then splitting is not a good idea. If you&#x2019;re considering a split like the one in Figure 9.3(c), you should judge it based on whether it simplifies things for callers.</p>
<blockquote>
<p>&#x56FE; 9.3&#xFF08;c&#xFF09;&#x6240;&#x793A;&#x5F62;&#x5F0F;&#x7684;&#x62C6;&#x5206;&#x5E76;&#x4E0D;&#x662F;&#x5F88;&#x6709;&#x610F;&#x4E49;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x5BFC;&#x81F4;&#x8C03;&#x7528;&#x8005;&#x4E0D;&#x5F97;&#x4E0D;&#x5904;&#x7406;&#x591A;&#x4E2A;&#x65B9;&#x6CD5;&#x800C;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x3002;&#x5F53;&#x60A8;&#x4EE5;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x62C6;&#x5206;&#x65F6;&#xFF0C;&#x60A8;&#x53EF;&#x80FD;&#x4F1A;&#x9047;&#x5230;&#x51E0;&#x79CD;&#x6D45;&#x5C42;&#x65B9;&#x6CD5;&#x7684;&#x98CE;&#x9669;&#xFF0C;&#x5982;&#x56FE; 9.3&#xFF08;d&#xFF09;&#x6240;&#x793A;&#x3002;&#x5982;&#x679C;&#x8C03;&#x7528;&#x8005;&#x5FC5;&#x987B;&#x8C03;&#x7528;&#x6BCF;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5E76;&#x5728;&#x5B83;&#x4EEC;&#x4E4B;&#x95F4;&#x6765;&#x56DE;&#x4F20;&#x9012;&#x72B6;&#x6001;&#xFF0C;&#x5219;&#x62C6;&#x5206;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x597D;&#x4E3B;&#x610F;&#x3002;&#x5982;&#x679C;&#x60A8;&#x6B63;&#x5728;&#x8003;&#x8651;&#x50CF;&#x56FE; 9.3&#xFF08;c&#xFF09;&#x6240;&#x793A;&#x7684;&#x62C6;&#x5206;&#xFF0C;&#x5219;&#x5E94;&#x57FA;&#x4E8E;&#x5B83;&#x662F;&#x5426;&#x7B80;&#x5316;&#x4E86;&#x547C;&#x53EB;&#x8005;&#x7684;&#x60C5;&#x51B5;&#x6765;&#x8FDB;&#x884C;&#x5224;&#x65AD;&#x3002;</p>
</blockquote>
<p>There are also situations where a system can be made simpler by joining methods together. For example, joining methods might replace two shallow methods with one deeper method; it might eliminate duplication of code; it might eliminate dependencies between the original methods, or intermediate data structures; it might result in better encapsulation, so that knowledge that was previously present in multiple places is now isolated in a single place; or it might result in a simpler interface, as discussed in Section 9.2.</p>
<blockquote>
<p>&#x5728;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x901A;&#x8FC7;&#x5C06;&#x65B9;&#x6CD5;&#x7ED3;&#x5408;&#x5728;&#x4E00;&#x8D77;&#x53EF;&#x4EE5;&#x7B80;&#x5316;&#x7CFB;&#x7EDF;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x8FDE;&#x63A5;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x7528;&#x4E00;&#x79CD;&#x66F4;&#x6DF1;&#x7684;&#x65B9;&#x6CD5;&#x4EE3;&#x66FF;&#x4E24;&#x79CD;&#x6D45;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x5B83;&#x53EF;&#x4EE5;&#x6D88;&#x9664;&#x91CD;&#x590D;&#x7684;&#x4EE3;&#x7801;&#xFF1B;&#x5B83;&#x53EF;&#x4EE5;&#x6D88;&#x9664;&#x539F;&#x59CB;&#x65B9;&#x6CD5;&#x6216;&#x4E2D;&#x95F4;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4E4B;&#x95F4;&#x7684;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#xFF1B;&#x5B83;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x66F4;&#x597D;&#x7684;&#x5C01;&#x88C5;&#xFF0C;&#x4ECE;&#x800C;&#x4F7F;&#x4EE5;&#x524D;&#x5728;&#x591A;&#x4E2A;&#x4F4D;&#x7F6E;&#x5B58;&#x5728;&#x7684;&#x77E5;&#x8BC6;&#x73B0;&#x5728;&#x88AB;&#x9694;&#x79BB;&#x5728;&#x4E00;&#x4E2A;&#x4F4D;&#x7F6E;&#xFF1B;&#x5426;&#x5219;&#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x63A5;&#x53E3;&#x66F4;&#x7B80;&#x5355;&#xFF0C;&#x5982; 9.2 &#x8282;&#x6240;&#x8FF0;&#x3002;</p>
</blockquote>
<p>img Red Flag: Conjoined Methods img</p>
<p>It should be possible to understand each method independently. If you can&#x2019;t understand the implementation of one method without also understanding the implementation of another, that&#x2019;s a red flag. This red flag can occur in other contexts as well: if two pieces of code are physically separated, but each can only be understood by looking at the other, that is a red flag.</p>
<blockquote>
<p>&#x5E94;&#x8BE5;&#x6709;&#x53EF;&#x80FD;&#x72EC;&#x7ACB;&#x5730;&#x7406;&#x89E3;&#x6BCF;&#x79CD;&#x65B9;&#x6CD5;&#x3002;&#x5982;&#x679C;&#x60A8;&#x4E0D;&#x80FD;&#x4E0D;&#x7406;&#x89E3;&#x53E6;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x7684;&#x5B9E;&#x73B0;&#x800C;&#x65E0;&#x6CD5;&#x7406;&#x89E3;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x7684;&#x5B9E;&#x73B0;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x5371;&#x9669;&#x4FE1;&#x53F7;&#x3002;&#x8BE5;&#x5371;&#x9669;&#x4FE1;&#x53F7;&#x4E5F;&#x53EF;&#x4EE5;&#x5728;&#x5176;&#x4ED6;&#x60C5;&#x51B5;&#x4E0B;&#x53D1;&#x751F;&#xFF1A;&#x5982;&#x679C;&#x4E24;&#x6BB5;&#x4EE3;&#x7801;&#x5728;&#x7269;&#x7406;&#x4E0A;&#x662F;&#x5206;&#x5F00;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x53EA;&#x6709;&#x901A;&#x8FC7;&#x67E5;&#x770B;&#x53E6;&#x4E00;&#x6BB5;&#x4EE3;&#x7801;&#x624D;&#x80FD;&#x7406;&#x89E3;&#x5B83;&#x4EEC;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x5371;&#x9669;&#x4FE1;&#x53F7;&#x3002;</p>
</blockquote>
<h2 id="99-conclusion-&#x7ED3;&#x8BBA;">9.9 Conclusion &#x7ED3;&#x8BBA;</h2>
<p>The decision to split or join modules should be based on complexity. Pick the structure that results in the best information hiding, the fewest dependencies, and the deepest interfaces.</p>
<blockquote>
<p>&#x62C6;&#x5206;&#x6216;&#x52A0;&#x5165;&#x6A21;&#x5757;&#x7684;&#x51B3;&#x5B9A;&#x5E94;&#x57FA;&#x4E8E;&#x590D;&#x6742;&#x6027;&#x3002;&#x9009;&#x62E9;&#x4E00;&#x79CD;&#x7ED3;&#x6784;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x9690;&#x85CF;&#x6700;&#x4F73;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x6700;&#x5C11;&#x7684;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x548C;&#x6700;&#x6DF1;&#x7684;&#x63A5;&#x53E3;&#x3002;</p>
</blockquote>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="ch8.html" class="navigation navigation-prev " aria-label="Previous page: 第八章: 降低复杂性">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="ch10.html" class="navigation navigation-next " aria-label="Next page: 第十章: 定义不存在的错误">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第九章: 在一起更好还是分开更好？","level":"1.12","depth":1,"next":{"title":"第十章: 定义不存在的错误","level":"1.13","depth":1,"path":"docs/ch10.md","ref":"./docs/ch10.md","articles":[]},"previous":{"title":"第八章: 降低复杂性","level":"1.11","depth":1,"path":"docs/ch8.md","ref":"./docs/ch8.md","articles":[]},"dir":"ltr"},"config":{"plugins":["back-to-top-button","expandable-chapters-small","page-toc-button","livereload"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"livereload":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"page-toc-button":{},"back-to-top-button":{},"expandable-chapters-small":{},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"John Ousterhout","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"软件设计哲学","language":"zh-hans","gitbook":"*","description":"书中讨论了软件设计的主题：如何将复杂的软件系统分解成可以相对独立实现的模块(如类和方法)"},"file":{"path":"docs/ch9.md","mtime":"2020-08-06T16:26:19.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-02-06T04:55:41.669Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-page-toc-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

