
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>总结 · 软件设计哲学</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="John Ousterhout">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-page-toc-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="ch21.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    首页
            
                </span>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="preface">
            
                <span>
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="ch1.html">
            
                <a href="ch1.html">
            
                    
                    第一章：介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="ch2.html">
            
                <a href="ch2.html">
            
                    
                    第二章：复杂性的本质
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="ch3.html">
            
                <a href="ch3.html">
            
                    
                    第三章：工作代码是不够的（战略与战术编程）
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="ch4.html">
            
                <a href="ch4.html">
            
                    
                    第四章：模块应该是深的
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="ch5.html">
            
                <a href="ch5.html">
            
                    
                    第五章：信息隐藏(和泄露)
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="ch6.html">
            
                <a href="ch6.html">
            
                    
                    第六章：通用模块更深入
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="ch7.html">
            
                <a href="ch7.html">
            
                    
                    第七章: 不同的层，不同的抽象
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="ch8.html">
            
                <a href="ch8.html">
            
                    
                    第八章: 降低复杂性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="ch9.html">
            
                <a href="ch9.html">
            
                    
                    第九章: 在一起更好还是分开更好？
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="ch10.html">
            
                <a href="ch10.html">
            
                    
                    第十章: 定义不存在的错误
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="ch11.html">
            
                <a href="ch11.html">
            
                    
                    第十一章: 设计它两次
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="ch12.html">
            
                <a href="ch12.html">
            
                    
                    第十二章: 为什么写注释？四个理由
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="ch13.html">
            
                <a href="ch13.html">
            
                    
                    第十三章: 注释应该描述代码中不明显的内容
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="ch14.html">
            
                <a href="ch14.html">
            
                    
                    第十四章: 选择的名字
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="ch15.html">
            
                <a href="ch15.html">
            
                    
                    第十五章: 先写注释
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="ch16.html">
            
                <a href="ch16.html">
            
                    
                    第十六章: 修改现有的代码
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.20" data-path="ch17.html">
            
                <a href="ch17.html">
            
                    
                    第十七章: 一致性
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.21" data-path="ch18.html">
            
                <a href="ch18.html">
            
                    
                    第十八章: 代码应该是显而易见的
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.22" data-path="ch19.html">
            
                <a href="ch19.html">
            
                    
                    第十九章: 软件发展趋势
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.23" data-path="ch20.html">
            
                <a href="ch20.html">
            
                    
                    第二十章: 设计性能
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.24" data-path="ch21.html">
            
                <a href="ch21.html">
            
                    
                    第二十一章: 结论
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.25" data-path="summary.html">
            
                <a href="summary.html">
            
                    
                    总结
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >总结</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x603B;&#x7ED3;">&#x603B;&#x7ED3;</h1>
<h2 id="summary-of-design-principles-&#x8BBE;&#x8BA1;&#x539F;&#x5219;&#x6458;&#x8981;">Summary of Design Principles &#x8BBE;&#x8BA1;&#x539F;&#x5219;&#x6458;&#x8981;</h2>
<p>Here are the most important software design principles discussed in this book:</p>
<blockquote>
<p>&#x8FD9;&#x662F;&#x672C;&#x4E66;&#x4E2D;&#x8BA8;&#x8BBA;&#x7684;&#x6700;&#x91CD;&#x8981;&#x7684;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x539F;&#x5219;&#xFF1A;</p>
</blockquote>
<ol>
<li>Complexity is incremental: you have to sweat the small stuff (see p. 11).</li>
<li>Working code isn&#x2019;t enough (see p. 14).</li>
<li>Make continual small investments to improve system design (see p. 15).</li>
<li>Modules should be deep (see p. 22)</li>
<li>Interfaces should be designed to make the most common usage as simple as possible (see p. 27).</li>
<li>It&#x2019;s more important for a module to have a simple interface than a simple implementation (see pp. 55, 71).</li>
<li>General-purpose modules are deeper (see p. 39).</li>
<li>Separate general-purpose and special-purpose code (see p. 62).</li>
<li>Different layers should have different abstractions (see p. 45).</li>
<li>Pull complexity downward (see p. 55).</li>
<li>Define errors (and special cases) out of existence (see p. 79).</li>
<li>Design it twice (see p. 91).</li>
<li>Comments should describe things that are not obvious from the code (see p. 101).</li>
<li>Software should be designed for ease of reading, not ease of writing (see p. 149).</li>
<li>The increments of software development should be abstractions, not features (see p. 154).</li>
</ol>
<hr>
<blockquote>
<ol>
<li>&#x590D;&#x6742;&#x6027;&#x662F;&#x9010;&#x6B65;&#x589E;&#x52A0;&#x7684;&#xFF1A;&#x60A8;&#x5FC5;&#x987B;&#x6D41;&#x6C57;&#x4E00;&#x4E9B;&#x5C0F;&#x4E1C;&#x897F;&#xFF08;&#x8BF7;&#x53C2;&#x9605;&#x7B2C; 11 &#x9875;&#xFF09;&#x3002;</li>
<li>&#x5DE5;&#x4F5C;&#x4EE3;&#x7801;&#x8FD8;&#x4E0D;&#x591F;&#xFF08;&#x8BF7;&#x53C2;&#x9605;&#x7B2C; 14 &#x9875;&#xFF09;&#x3002;</li>
<li>&#x6301;&#x7EED;&#x8FDB;&#x884C;&#x5C11;&#x91CF;&#x6295;&#x8D44;&#x4EE5;&#x6539;&#x5584;&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;&#xFF08;&#x8BF7;&#x53C2;&#x9605;&#x7B2C; 15 &#x9875;&#xFF09;&#x3002;</li>
<li>&#x6A21;&#x5757;&#x5E94;&#x8F83;&#x6DF1;&#xFF08;&#x8BF7;&#x53C2;&#x89C1;&#x7B2C; 22 &#x9875;&#xFF09;</li>
<li>&#x63A5;&#x53E3;&#x7684;&#x8BBE;&#x8BA1;&#x5E94;&#x5C3D;&#x53EF;&#x80FD;&#x7B80;&#x5316;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x7528;&#x6CD5;&#xFF08;&#x8BF7;&#x53C2;&#x9605;&#x7B2C; 27 &#x9875;&#xFF09;&#x3002;</li>
<li>&#x4E00;&#x4E2A;&#x6A21;&#x5757;&#x5177;&#x6709;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x63A5;&#x53E3;&#x6BD4;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x5B9E;&#x73B0;&#x66F4;&#x91CD;&#x8981;&#xFF08;&#x8BF7;&#x53C2;&#x9605;&#x7B2C; 55&#x3001;71 &#x9875;&#xFF09;&#x3002;</li>
<li>&#x901A;&#x7528;&#x6A21;&#x5757;&#x66F4;&#x6DF1;&#x5165;&#xFF08;&#x8BF7;&#x53C2;&#x9605;&#x7B2C; 39 &#x9875;&#xFF09;&#x3002;</li>
<li>&#x901A;&#x7528;&#x548C;&#x4E13;&#x7528;&#x4EE3;&#x7801;&#x5206;&#x5F00;&#xFF08;&#x8BF7;&#x53C2;&#x89C1;&#x7B2C; 62 &#x9875;&#xFF09;&#x3002;</li>
<li>&#x4E0D;&#x540C;&#x7684;&#x5C42;&#x5E94;&#x5177;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x62BD;&#x8C61;&#xFF08;&#x8BF7;&#x53C2;&#x89C1;&#x7B2C; 45 &#x9875;&#xFF09;&#x3002;</li>
<li>&#x964D;&#x4F4E;&#x590D;&#x6742;&#x5EA6;&#xFF08;&#x8BF7;&#x53C2;&#x9605;&#x7B2C; 55 &#x9875;&#xFF09;&#x3002;</li>
<li>&#x5B9A;&#x4E49;&#x4E0D;&#x5B58;&#x5728;&#x7684;&#x9519;&#x8BEF;&#xFF08;&#x548C;&#x7279;&#x6B8A;&#x60C5;&#x51B5;&#xFF09;&#xFF08;&#x8BF7;&#x53C2;&#x9605;&#x7B2C; 79 &#x9875;&#xFF09;&#x3002;</li>
<li>&#x8BBE;&#x8BA1;&#x4E24;&#x6B21;&#xFF08;&#x8BF7;&#x53C2;&#x9605;&#x7B2C; 91 &#x9875;&#xFF09;&#x3002;</li>
<li>&#x6CE8;&#x91CA;&#x5E94;&#x63CF;&#x8FF0;&#x4EE3;&#x7801;&#x4E2D;&#x4E0D;&#x660E;&#x663E;&#x7684;&#x5185;&#x5BB9;&#xFF08;&#x8BF7;&#x53C2;&#x89C1;&#x7B2C; 101 &#x9875;&#xFF09;&#x3002;</li>
<li>&#x8F6F;&#x4EF6;&#x7684;&#x8BBE;&#x8BA1;&#x5E94;&#x6613;&#x4E8E;&#x9605;&#x8BFB;&#x800C;&#x4E0D;&#x662F;&#x6613;&#x4E8E;&#x7F16;&#x5199;&#xFF08;&#x8BF7;&#x53C2;&#x89C1;&#x7B2C; 149 &#x9875;&#xFF09;&#x3002;</li>
<li>&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x7684;&#x589E;&#x91CF;&#x5E94;&#x8BE5;&#x662F;&#x62BD;&#x8C61;&#x800C;&#x4E0D;&#x662F;&#x529F;&#x80FD;&#xFF08;&#x8BF7;&#x53C2;&#x89C1;&#x7B2C; 154 &#x9875;&#xFF09;&#x3002;</li>
</ol>
</blockquote>
<h2 id="summary-of-red-flags-&#x7EA2;&#x65D7;&#x6458;&#x8981;">Summary of Red Flags &#x7EA2;&#x65D7;&#x6458;&#x8981;</h2>
<p>Here are a few of of the most important red flags discussed in this book. The presence of any of these symptoms in a system suggests that there is a problem with the system&#x2019;s design:</p>
<blockquote>
<p>&#x8FD9;&#x662F;&#x672C;&#x4E66;&#x4E2D;&#x8BA8;&#x8BBA;&#x7684;&#x4E00;&#x4E9B;&#x6700;&#x91CD;&#x8981;&#x7684;&#x5371;&#x9669;&#x4FE1;&#x53F7;&#x3002;&#x7CFB;&#x7EDF;&#x4E2D;&#x4EFB;&#x4F55;&#x8FD9;&#x4E9B;&#x75C7;&#x72B6;&#x7684;&#x5B58;&#x5728;&#x8868;&#x660E;&#x7CFB;&#x7EDF;&#x7684;&#x8BBE;&#x8BA1;&#x5B58;&#x5728;&#x95EE;&#x9898;&#xFF1A;</p>
</blockquote>
<ul>
<li>Shallow Module: the interface for a class or method isn&#x2019;t much simpler than its implementation (see pp. 25, 110).</li>
<li>Information Leakage: a design decision is reflected in multiple modules (see p. 31).</li>
<li>Temporal Decomposition: the code structure is based on the order in which operations are executed, not on information hiding (see p. 32).</li>
<li>Overexposure: An API forces callers to be aware of rarely used features in order to use commonly used features (see p. 36).</li>
<li>Pass-Through Method: a method does almost nothing except pass its arguments to another method with a similar signature (see p. 46).</li>
<li>Repetition: a nontrivial piece of code is repeated over and over (see p. 62).</li>
<li>Special-General Mixture: special-purpose code is not cleanly separated from general purpose code (see p. 65).</li>
<li>Conjoined Methods: two methods have so many dependencies that its hard to understand the implementation of one without understanding the implementation of the other (see p. 72).</li>
<li>Comment Repeats Code: all of the information in a comment is immediately obvious from the code next to the comment (see p. 104).</li>
<li>Implementation Documentation Contaminates Interface: an interface comment describes implementation details not needed by users of the thing being documented (see p. 114).</li>
<li>Vague Name: the name of a variable or method is so imprecise that it doesn&#x2019;t convey much useful information (see p. 123).</li>
<li>Hard to Pick Name: it is difficult to come up with a precise and intuitive name for an entity (see p. 125).</li>
<li>Hard to Describe: in order to be complete, the documentation for a variable or method must be long. (see p. 131).</li>
<li>Nonobvious Code: the behavior or meaning of a piece of code cannot be understood easily. (see p. 148).</li>
</ul>
<hr>
<blockquote>
<ul>
<li>&#x6D45;&#x6A21;&#x5757;&#xFF1A;&#x7C7B;&#x6216;&#x65B9;&#x6CD5;&#x7684;&#x63A5;&#x53E3;&#x5E76;&#x4E0D;&#x6BD4;&#x5176;&#x5B9E;&#x73B0;&#x7B80;&#x5355;&#x5F97;&#x591A;&#xFF08;&#x8BF7;&#x53C2;&#x89C1;&#x7B2C; 25&#x3001;110 &#x9875;&#xFF09;&#x3002;</li>
<li>&#x4FE1;&#x606F;&#x6CC4;&#x6F0F;&#xFF1A;&#x8BBE;&#x8BA1;&#x51B3;&#x7B56;&#x53CD;&#x6620;&#x5728;&#x591A;&#x4E2A;&#x6A21;&#x5757;&#x4E2D;&#xFF08;&#x8BF7;&#x53C2;&#x9605;&#x7B2C; 31 &#x9875;&#xFF09;&#x3002;</li>
<li>&#x65F6;&#x95F4;&#x5206;&#x89E3;&#xFF1A;&#x4EE3;&#x7801;&#x7ED3;&#x6784;&#x57FA;&#x4E8E;&#x6267;&#x884C;&#x64CD;&#x4F5C;&#x7684;&#x987A;&#x5E8F;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4FE1;&#x606F;&#x9690;&#x85CF;&#xFF08;&#x8BF7;&#x53C2;&#x89C1;&#x7B2C; 32 &#x9875;&#xFF09;&#x3002;</li>
<li>&#x8FC7;&#x5EA6;&#x66B4;&#x9732;&#xFF1A;API &#x5F3A;&#x5236;&#x8C03;&#x7528;&#x8005;&#x6CE8;&#x610F;&#x5F88;&#x5C11;&#x4F7F;&#x7528;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x4EE5;&#x4FBF;&#x4F7F;&#x7528;&#x5E38;&#x7528;&#x529F;&#x80FD;&#xFF08;&#x8BF7;&#x53C2;&#x9605;&#x7B2C; 36 &#x9875;&#xFF09;&#x3002;</li>
<li>Pass-Through Method&#xFF1A;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x51E0;&#x4E4E;&#x4E0D;&#x6267;&#x884C;&#x4EFB;&#x4F55;&#x64CD;&#x4F5C;&#xFF0C;&#x53EA;&#x662F;&#x5C06;&#x5176;&#x53C2;&#x6570;&#x4F20;&#x9012;&#x7ED9;&#x5177;&#x6709;&#x76F8;&#x4F3C;&#x7B7E;&#x540D;&#x7684;&#x53E6;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#xFF08;&#x8BF7;&#x53C2;&#x89C1;&#x7B2C; 46 &#x9875;&#xFF09;&#x3002;</li>
<li>&#x91CD;&#x590D;&#xFF1A;&#x4E00;&#x904D;&#x53C8;&#x4E00;&#x904D;&#x7684;&#x91CD;&#x590D;&#x4EE3;&#x7801;&#xFF08;&#x8BF7;&#x53C2;&#x89C1;&#x7B2C; 62 &#x9875;&#xFF09;&#x3002;</li>
<li>&#x7279;&#x6B8A;&#x901A;&#x7528;&#x6DF7;&#x5408;&#x7269;&#xFF1A;&#x7279;&#x6B8A;&#x7528;&#x9014;&#x4EE3;&#x7801;&#x672A;&#x4E0E;&#x901A;&#x7528;&#x4EE3;&#x7801;&#x5B8C;&#x5168;&#x5206;&#x5F00;&#xFF08;&#x8BF7;&#x53C2;&#x9605;&#x7B2C; 65 &#x9875;&#xFF09;&#x3002;</li>
<li>&#x8054;&#x5408;&#x65B9;&#x6CD5;&#xFF1A;&#x4E24;&#x79CD;&#x65B9;&#x6CD5;&#x4E4B;&#x95F4;&#x7684;&#x4F9D;&#x8D56;&#x6027;&#x5F88;&#x5927;&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;&#x5F88;&#x96BE;&#x7406;&#x89E3;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x7684;&#x5B9E;&#x73B0;&#x800C;&#x53C8;&#x4E0D;&#x7406;&#x89E3;&#x53E6;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x7684;&#x5B9E;&#x73B0;&#xFF08;&#x8BF7;&#x53C2;&#x9605;&#x7B2C; 72 &#x9875;&#xFF09;&#x3002;</li>
<li>&#x6CE8;&#x91CA;&#x91CD;&#x590D;&#x4EE3;&#x7801;&#xFF1A;&#x6CE8;&#x91CA;&#x65C1;&#x8FB9;&#x7684;&#x4EE3;&#x7801;&#x4F1A;&#x7ACB;&#x5373;&#x663E;&#x793A;&#x6CE8;&#x91CA;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x4FE1;&#x606F;&#xFF08;&#x8BF7;&#x53C2;&#x9605;&#x7B2C; 104 &#x9875;&#xFF09;&#x3002;</li>
<li>&#x5B9E;&#x65BD;&#x6587;&#x6863;&#x6C61;&#x67D3;&#x4E86;&#x754C;&#x9762;&#xFF1A;&#x754C;&#x9762;&#x6CE8;&#x91CA;&#x63CF;&#x8FF0;&#x4E86;&#x6240;&#x8BB0;&#x5F55;&#x4E8B;&#x7269;&#x7684;&#x7528;&#x6237;&#x4E0D;&#x9700;&#x8981;&#x7684;&#x5B9E;&#x65BD;&#x7EC6;&#x8282;&#xFF08;&#x8BF7;&#x53C2;&#x9605;&#x7B2C; 114 &#x9875;&#xFF09;&#x3002;</li>
<li>&#x542B;&#x7CCA;&#x4E0D;&#x6E05;&#x7684;&#x540D;&#x79F0;&#xFF1A;&#x53D8;&#x91CF;&#x6216;&#x65B9;&#x6CD5;&#x7684;&#x540D;&#x79F0;&#x8FC7;&#x4E8E;&#x7CBE;&#x786E;&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;&#x5B83;&#x4E0D;&#x80FD;&#x4F20;&#x8FBE;&#x5F88;&#x591A;&#x6709;&#x7528;&#x7684;&#x4FE1;&#x606F;&#xFF08;&#x8BF7;&#x53C2;&#x9605;&#x7B2C; 123 &#x9875;&#xFF09;&#x3002;</li>
<li>&#x96BE;&#x4EE5;&#x9009;&#x62E9;&#x7684;&#x540D;&#x79F0;&#xFF1A;&#x5F88;&#x96BE;&#x4E3A;&#x5B9E;&#x4F53;&#x63D0;&#x4F9B;&#x51C6;&#x786E;&#x800C;&#x76F4;&#x89C2;&#x7684;&#x540D;&#x79F0;&#xFF08;&#x8BF7;&#x53C2;&#x89C1;&#x7B2C; 125 &#x9875;&#xFF09;&#x3002;</li>
<li>&#x96BE;&#x4EE5;&#x63CF;&#x8FF0;&#xFF1A;&#x4E3A;&#x4E86;&#x5B8C;&#x6574;&#x8D77;&#x89C1;&#xFF0C;&#x53D8;&#x91CF;&#x6216;&#x65B9;&#x6CD5;&#x7684;&#x6587;&#x6863;&#x5FC5;&#x987B;&#x5F88;&#x957F;&#x3002;&#xFF08;&#x8BF7;&#x53C2;&#x9605;&#x7B2C; 131 &#x9875;&#xFF09;&#x3002;</li>
<li>&#x975E;&#x663E;&#x800C;&#x6613;&#x89C1;&#x7684;&#x4EE3;&#x7801;&#xFF1A;&#x4E00;&#x6BB5;&#x4EE3;&#x7801;&#x7684;&#x884C;&#x4E3A;&#x6216;&#x542B;&#x4E49;&#x4E0D;&#x5BB9;&#x6613;&#x7406;&#x89E3;&#x3002;&#xFF08;&#x8BF7;&#x53C2;&#x9605;&#x7B2C; 148 &#x9875;&#xFF09;&#x3002;</li>
</ul>
</blockquote>
<h2 id="about-the-author-&#x5173;&#x4E8E;&#x4F5C;&#x8005;">About the Author &#x5173;&#x4E8E;&#x4F5C;&#x8005;</h2>
<p>John Ousterhout is the Bosack Lerner Professor of Computer Science at Stanford University. He is the creator of the Tcl scripting language and is also well known for his work in distributed operating systems and storage systems. Ousterhout received a BS degree in Physics from Yale University and a PhD in Computer Science from Carnegie Mellon University. He is a member of the National Academy of Engineering and has received numerous awards, including the ACM Software System Award, the ACM Grace Murray Hopper Award, the National Science Foundation Presidential Young Investigator Award, and the U.C. Berkeley Distinguished Teaching Award.</p>
<blockquote>
<p>John Ousterhout &#x662F;&#x65AF;&#x5766;&#x798F;&#x5927;&#x5B66;&#x7684; Bosack Lerner &#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x6559;&#x6388;&#x3002;&#x4ED6;&#x662F; Tcl &#x811A;&#x672C;&#x8BED;&#x8A00;&#x7684;&#x521B;&#x5EFA;&#x8005;&#xFF0C;&#x5E76;&#x4E14;&#x4EE5;&#x5728;&#x5206;&#x5E03;&#x5F0F;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x548C;&#x5B58;&#x50A8;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x5DE5;&#x4F5C;&#x800C;&#x95FB;&#x540D;&#x3002;Ousterhout &#x5728;&#x8036;&#x9C81;&#x5927;&#x5B66;&#x83B7;&#x5F97;&#x4E86;&#x7269;&#x7406;&#x5B66;&#x5B66;&#x58EB;&#x5B66;&#x4F4D;&#xFF0C;&#x5E76;&#x5728;&#x5361;&#x5185;&#x57FA;&#x6885;&#x9686;&#x5927;&#x5B66;&#x83B7;&#x5F97;&#x4E86;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x535A;&#x58EB;&#x5B66;&#x4F4D;&#x3002;&#x4ED6;&#x662F;&#x7F8E;&#x56FD;&#x56FD;&#x5BB6;&#x5DE5;&#x7A0B;&#x9662;&#x9662;&#x58EB;&#xFF0C;&#x5E76;&#x83B7;&#x5F97;&#x4E86;&#x65E0;&#x6570;&#x5956;&#x9879;&#xFF0C;&#x5305;&#x62EC; ACM &#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x5956;&#xFF0C;ACM Grace Murray Hopper &#x5956;&#xFF0C;&#x7F8E;&#x56FD;&#x56FD;&#x5BB6;&#x79D1;&#x5B66;&#x57FA;&#x91D1;&#x4F1A;&#x603B;&#x7EDF;&#x5E74;&#x8F7B;&#x7814;&#x7A76;&#x8005;&#x5956;&#x548C; UC Berkeley &#x6770;&#x51FA;&#x6559;&#x5B66;&#x5956;&#x3002;</p>
</blockquote>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="ch21.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: 第二十一章: 结论">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"总结","level":"1.25","depth":1,"previous":{"title":"第二十一章: 结论","level":"1.24","depth":1,"path":"docs/ch21.md","ref":"./docs/ch21.md","articles":[]},"dir":"ltr"},"config":{"plugins":["back-to-top-button","expandable-chapters-small","page-toc-button","livereload"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"livereload":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"page-toc-button":{},"back-to-top-button":{},"expandable-chapters-small":{},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"John Ousterhout","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"软件设计哲学","language":"zh-hans","gitbook":"*","description":"书中讨论了软件设计的主题：如何将复杂的软件系统分解成可以相对独立实现的模块(如类和方法)"},"file":{"path":"docs/summary.md","mtime":"2020-08-06T16:26:19.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-02-06T04:55:41.669Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-page-toc-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

